Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:atdf="http://crownking/atdf" xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd" edc:name="ATSAMV70N20B" edc:arch="arm32bit" edc:procid="0x0000" atdf:architecture="CORTEX-M7" atdf:family="SAMV" edc:hasFreeze="false" edc:atsamname="ATSAMV70N20B">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:minvoltage="1.62" edc:maxvoltage="3.6" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true">
    <edc:ProgrammingRowSize edc:progop="rowerase" edc:nzsize="8192"/>
  </edc:Programming>
  <edc:ArchDef edc:name="arm32bit" edc:desc="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv7m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:irq="-15" edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset"/>
    <edc:Interrupt edc:irq="-14" edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted"/>
    <edc:Interrupt edc:irq="-13" edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault"/>
    <edc:Interrupt edc:irq="-12" edc:cname="MemoryManagement" edc:desc="Memory Management, MPU mismatch, including Access Violation and No Match"/>
    <edc:Interrupt edc:irq="-11" edc:cname="BusFault" edc:desc="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault"/>
    <edc:Interrupt edc:irq="-10" edc:cname="UsageFault" edc:desc="Usage Fault, i.e. Undef Instruction, Illegal State Transition"/>
    <edc:Interrupt edc:irq="-5" edc:cname="SVCall" edc:desc="System Service Call via SVC instruction"/>
    <edc:Interrupt edc:irq="-4" edc:cname="DebugMonitor" edc:desc="Debug Monitor"/>
    <edc:Interrupt edc:irq="-2" edc:cname="PendSV" edc:desc="Pendable request for system service"/>
    <edc:Interrupt edc:irq="-1" edc:cname="SysTick" edc:desc="System Tick Timer"/>
    <edc:Interrupt edc:irq="0" edc:cname="SUPC" edc:desc="Supply Controller" ltx:memberofperipheral="SUPC"/>
    <edc:Interrupt edc:irq="1" edc:cname="RSTC" edc:desc="Reset Controller" ltx:memberofperipheral="RSTC"/>
    <edc:Interrupt edc:irq="2" edc:cname="RTC" edc:desc="Real Time Clock" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:irq="3" edc:cname="RTT" edc:desc="Real Time Timer" ltx:memberofperipheral="RTT"/>
    <edc:Interrupt edc:irq="4" edc:cname="WDT" edc:desc="Watchdog Timer" ltx:memberofperipheral="WDT"/>
    <edc:Interrupt edc:irq="5" edc:cname="PMC" edc:desc="Power Management Controller" ltx:memberofperipheral="PMC"/>
    <edc:Interrupt edc:irq="6" edc:cname="EFC" edc:desc="Enhanced Embedded Flash Controller" ltx:memberofperipheral="EFC"/>
    <edc:Interrupt edc:irq="7" edc:cname="UART0" edc:desc="UART 0" ltx:memberofperipheral="UART0"/>
    <edc:Interrupt edc:irq="8" edc:cname="UART1" edc:desc="UART 1" ltx:memberofperipheral="UART1"/>
    <edc:Interrupt edc:irq="10" edc:cname="PIOA" edc:desc="Parallel I/O Controller A" ltx:memberofperipheral="PIOA"/>
    <edc:Interrupt edc:irq="11" edc:cname="PIOB" edc:desc="Parallel I/O Controller B" ltx:memberofperipheral="PIOB"/>
    <edc:Interrupt edc:irq="13" edc:cname="USART0" edc:desc="USART 0" ltx:memberofperipheral="USART0"/>
    <edc:Interrupt edc:irq="14" edc:cname="USART1" edc:desc="USART 1" ltx:memberofperipheral="USART1"/>
    <edc:Interrupt edc:irq="15" edc:cname="USART2" edc:desc="USART 2" ltx:memberofperipheral="USART2"/>
    <edc:Interrupt edc:irq="16" edc:cname="PIOD" edc:desc="Parallel I/O Controller D" ltx:memberofperipheral="PIOD"/>
    <edc:Interrupt edc:irq="18" edc:cname="HSMCI" edc:desc="Multimedia Card Interface" ltx:memberofperipheral="HSMCI"/>
    <edc:Interrupt edc:irq="19" edc:cname="TWIHS0" edc:desc="Two Wire Interface 0 HS" ltx:memberofperipheral="TWIHS0"/>
    <edc:Interrupt edc:irq="20" edc:cname="TWIHS1" edc:desc="Two Wire Interface 1 HS" ltx:memberofperipheral="TWIHS1"/>
    <edc:Interrupt edc:irq="21" edc:cname="SPI0" edc:desc="Serial Peripheral Interface 0" ltx:memberofperipheral="SPI0"/>
    <edc:Interrupt edc:irq="22" edc:cname="SSC" edc:desc="Synchronous Serial Controller" ltx:memberofperipheral="SSC"/>
    <edc:Interrupt edc:irq="23" edc:cname="TC0" edc:desc="Timer/Counter 0" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:irq="24" edc:cname="TC1" edc:desc="Timer/Counter 1" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:irq="25" edc:cname="TC2" edc:desc="Timer/Counter 2" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:irq="26" edc:cname="TC3" edc:desc="Timer/Counter 3" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:irq="27" edc:cname="TC4" edc:desc="Timer/Counter 4" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:irq="28" edc:cname="TC5" edc:desc="Timer/Counter 5" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:irq="29" edc:cname="AFEC0" edc:desc="Analog Front End 0" ltx:memberofperipheral="AFEC0"/>
    <edc:Interrupt edc:irq="30" edc:cname="DACC" edc:desc="Digital To Analog Converter" ltx:memberofperipheral="DACC"/>
    <edc:Interrupt edc:irq="31" edc:cname="PWM0" edc:desc="Pulse Width Modulation 0" ltx:memberofperipheral="PWM0"/>
    <edc:Interrupt edc:irq="32" edc:cname="ICM" edc:desc="Integrity Check Monitor" ltx:memberofperipheral="ICM"/>
    <edc:Interrupt edc:irq="33" edc:cname="ACC" edc:desc="Analog Comparator" ltx:memberofperipheral="ACC"/>
    <edc:Interrupt edc:irq="34" edc:cname="USBHS" edc:desc="USB Host / Device Controller" ltx:memberofperipheral="USBHS"/>
    <edc:Interrupt edc:irq="35" edc:cname="MCAN0_INT0" edc:desc="MCAN Controller 0 Interrupt 0" ltx:memberofperipheral="MCAN0"/>
    <edc:Interrupt edc:irq="36" edc:cname="MCAN0_INT1" edc:desc="MCAN Controller 0 Interrupt 1" ltx:memberofperipheral="MCAN0"/>
    <edc:Interrupt edc:irq="37" edc:cname="MCAN1_INT0" edc:desc="MCAN Controller 1 Interrupt 0" ltx:memberofperipheral="MCAN1"/>
    <edc:Interrupt edc:irq="38" edc:cname="MCAN1_INT1" edc:desc="MCAN Controller 1 Interrupt 1" ltx:memberofperipheral="MCAN1"/>
    <edc:Interrupt edc:irq="40" edc:cname="AFEC1" edc:desc="Analog Front End 1" ltx:memberofperipheral="AFEC1"/>
    <edc:Interrupt edc:irq="41" edc:cname="TWIHS2" edc:desc="Two Wire Interface 2 HS" ltx:memberofperipheral="TWIHS2"/>
    <edc:Interrupt edc:irq="43" edc:cname="QSPI" edc:desc="Quad I/O Serial Peripheral Interface" ltx:memberofperipheral="QSPI"/>
    <edc:Interrupt edc:irq="44" edc:cname="UART2" edc:desc="UART 2" ltx:memberofperipheral="UART2"/>
    <edc:Interrupt edc:irq="45" edc:cname="UART3" edc:desc="UART 3" ltx:memberofperipheral="UART3"/>
    <edc:Interrupt edc:irq="46" edc:cname="UART4" edc:desc="UART 4" ltx:memberofperipheral="UART4"/>
    <edc:Interrupt edc:irq="47" edc:cname="TC6" edc:desc="Timer/Counter 6" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:irq="48" edc:cname="TC7" edc:desc="Timer/Counter 7" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:irq="49" edc:cname="TC8" edc:desc="Timer/Counter 8" ltx:memberofperipheral="TC2"/>
    <edc:Interrupt edc:irq="50" edc:cname="TC9" edc:desc="Timer/Counter 9" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:irq="51" edc:cname="TC10" edc:desc="Timer/Counter 10" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:irq="52" edc:cname="TC11" edc:desc="Timer/Counter 11" ltx:memberofperipheral="TC3"/>
    <edc:Interrupt edc:irq="53" edc:cname="MLB" edc:desc="MediaLB" ltx:memberofperipheral="MLB"/>
    <edc:Interrupt edc:irq="56" edc:cname="AES" edc:desc="AES" ltx:memberofperipheral="AES"/>
    <edc:Interrupt edc:irq="57" edc:cname="TRNG" edc:desc="True Random Generator" ltx:memberofperipheral="TRNG"/>
    <edc:Interrupt edc:irq="58" edc:cname="XDMAC" edc:desc="DMA" ltx:memberofperipheral="XDMAC"/>
    <edc:Interrupt edc:irq="59" edc:cname="ISI" edc:desc="Camera Interface" ltx:memberofperipheral="ISI"/>
    <edc:Interrupt edc:irq="60" edc:cname="PWM1" edc:desc="Pulse Width Modulation 1" ltx:memberofperipheral="PWM1"/>
    <edc:Interrupt edc:irq="61" edc:cname="FPU" edc:desc="Floating Point Unit" ltx:memberofperipheral="FPU"/>
    <edc:Interrupt edc:irq="63" edc:cname="RSWDT" edc:desc="Reinforced Secure Watchdog Timer" ltx:memberofperipheral="RSWDT"/>
    <edc:Interrupt edc:irq="64" edc:cname="CCW" edc:desc="Cache ECC Warning" ltx:memberofperipheral="SCB"/>
    <edc:Interrupt edc:irq="65" edc:cname="CCF" edc:desc="Cache ECC Fault" ltx:memberofperipheral="SCB"/>
    <edc:Interrupt edc:irq="68" edc:cname="IXC" edc:desc="Floating Point Unit IXC" ltx:memberofperipheral="FPU"/>
    <edc:Interrupt edc:irq="69" edc:cname="I2SC0" edc:desc="Inter-IC Sound controller 0" ltx:memberofperipheral="I2SC0"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="ACC" edc:desc=""/>
    <edc:Peripheral edc:cname="AES" edc:desc=""/>
    <edc:Peripheral edc:cname="AFEC0" edc:desc=""/>
    <edc:Peripheral edc:cname="AFEC1" edc:desc=""/>
    <edc:Peripheral edc:cname="CHIPID" edc:desc=""/>
    <edc:Peripheral edc:cname="DACC" edc:desc=""/>
    <edc:Peripheral edc:cname="EFC" edc:desc=""/>
    <edc:Peripheral edc:cname="GPBR" edc:desc=""/>
    <edc:Peripheral edc:cname="HSMCI" edc:desc=""/>
    <edc:Peripheral edc:cname="I2SC0" edc:desc=""/>
    <edc:Peripheral edc:cname="ICM" edc:desc=""/>
    <edc:Peripheral edc:cname="ISI" edc:desc=""/>
    <edc:Peripheral edc:cname="MATRIX" edc:desc=""/>
    <edc:Peripheral edc:cname="MCAN0" edc:desc=""/>
    <edc:Peripheral edc:cname="MCAN1" edc:desc=""/>
    <edc:Peripheral edc:cname="MLB" edc:desc=""/>
    <edc:Peripheral edc:cname="PIOA" edc:desc=""/>
    <edc:Peripheral edc:cname="PIOB" edc:desc=""/>
    <edc:Peripheral edc:cname="PIOD" edc:desc=""/>
    <edc:Peripheral edc:cname="PMC" edc:desc=""/>
    <edc:Peripheral edc:cname="PWM0" edc:desc=""/>
    <edc:Peripheral edc:cname="PWM1" edc:desc=""/>
    <edc:Peripheral edc:cname="QSPI" edc:desc=""/>
    <edc:Peripheral edc:cname="RSTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RSWDT" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RTT" edc:desc=""/>
    <edc:Peripheral edc:cname="SPI0" edc:desc=""/>
    <edc:Peripheral edc:cname="SSC" edc:desc=""/>
    <edc:Peripheral edc:cname="SUPC" edc:desc=""/>
    <edc:Peripheral edc:cname="TC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TC3" edc:desc=""/>
    <edc:Peripheral edc:cname="TRNG" edc:desc=""/>
    <edc:Peripheral edc:cname="TWIHS0" edc:desc=""/>
    <edc:Peripheral edc:cname="TWIHS1" edc:desc=""/>
    <edc:Peripheral edc:cname="TWIHS2" edc:desc=""/>
    <edc:Peripheral edc:cname="UART0" edc:desc=""/>
    <edc:Peripheral edc:cname="UART1" edc:desc=""/>
    <edc:Peripheral edc:cname="UART2" edc:desc=""/>
    <edc:Peripheral edc:cname="UART3" edc:desc=""/>
    <edc:Peripheral edc:cname="UART4" edc:desc=""/>
    <edc:Peripheral edc:cname="USART0" edc:desc=""/>
    <edc:Peripheral edc:cname="USART1" edc:desc=""/>
    <edc:Peripheral edc:cname="USART2" edc:desc=""/>
    <edc:Peripheral edc:cname="USBHS" edc:desc=""/>
    <edc:Peripheral edc:cname="UTMI" edc:desc=""/>
    <edc:Peripheral edc:cname="WDT" edc:desc=""/>
    <edc:Peripheral edc:cname="XDMAC" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSES" edc:desc=""/>
    <edc:Peripheral edc:cname="LOCKBIT" edc:desc=""/>
    <edc:Peripheral edc:cname="SCnSCB" edc:desc=""/>
    <edc:Peripheral edc:cname="SCB" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC" edc:desc=""/>
    <edc:Peripheral edc:cname="MPU" edc:desc=""/>
    <edc:Peripheral edc:cname="FPU" edc:desc=""/>
    <edc:Peripheral edc:cname="ICE" edc:desc=""/>
    <edc:Peripheral edc:cname="TPIU" edc:desc=""/>
  </edc:PeripheralList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R0" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="0"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R1" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="4"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R2" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="8"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R3" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="12"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R4" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="16"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R5" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="20"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R6" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="24"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R7" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="28"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R8" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="32"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R9" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="36"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R10" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="40"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R11" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="44"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R12" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="48"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="SP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Stack Pointer" edc:nmmrid="52"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="MSP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Main Stack Pointer" edc:nmmrid="64"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Process Stack Pointer" edc:nmmrid="68"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="LR" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:desc="Link Register" edc:nmmrid="56"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PC" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Program Counter" edc:nmmrid="60"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSR" edc:impl="0xFF00FDFF" edc:access="nnnnnnnn--------nnnnnn-nnnnnnnnn" edc:por="00000001000000000000000000000000" edc:mclr="00000001000000000000000000000000" edc:desc="Program Status Register" edc:nmmrid="72"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="APSR" edc:impl="0xF80F0000" edc:access="nnnnn-------nnnn----------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Application Program Status Register" edc:nmmrid="76"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="IPSR" edc:impl="0x1FF" edc:access="-----------------------rrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Interrupt Program Status Register" edc:nmmrid="80"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="EPSR" edc:impl="0x700FC00" edc:access="-----rrr--------rrrrrr----------" edc:por="00000001000000000000000000000000" edc:mclr="00000001000000000000000000000000" edc:desc="Execution Program Status Register" edc:nmmrid="84"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PRIMASK" edc:impl="0x1" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Priority Mask Register" edc:nmmrid="88"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="FAULTMASK" edc:impl="0x1" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Fault Mask Register" edc:nmmrid="92"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="BASEPRI" edc:impl="0xFF" edc:access="------------------------nnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Base Priority Mask Register" edc:nmmrid="96"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="CONTROL" edc:impl="0x7" edc:access="-----------------------------nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Control Register" edc:nmmrid="100"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="FPSCR" edc:impl="0xFFF79F9F" edc:access="nnnnnnnnnnnn-nnnn--nnnnnn--nnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Status And Control Register" edc:nmmrid="144"/>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D0" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S0" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="148"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S1" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="152"/>
      </edc:JoinedSFRDef>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D1" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S2" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="156"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S3" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="160"/>
      </edc:JoinedSFRDef>
      <edc:JoinedSFRDef edc:nzwidth="0x40" edc:cname="D2" edc:impl="0xFFFFFFFFFFFFFFFF" edc:desc="Floating-Point Extension Register">
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S4" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="164"/>
        <edc:SFRDef edc:nzwidth="0x20" edc:cname="S5" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Floating-Point Extension Register" edc:nmmrid="168"/>
      </edc:JoinedSFRDef>
