Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_DTOR" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:impl="0x7F" edc:_addr="0x40000008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DTOCYC" edc:nzwidth="0x4" edc:desc="Data Timeout Cycle Number"/>
            <edc:SFRFieldDef edc:cname="DTOMUL" edc:nzwidth="0x3" edc:desc="Data Timeout Multiplier">
              <edc:SFRFieldSemantic edc:cname="_1" edc:desc="DTOCYC" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16" edc:desc="DTOCYC x 16" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_128" edc:desc="DTOCYC x 128" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_256" edc:desc="DTOCYC x 256" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_1024" edc:desc="DTOCYC x 1024" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_4096" edc:desc="DTOCYC x 4096" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_65536" edc:desc="DTOCYC x 65536" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1048576" edc:desc="DTOCYC x 1048576" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_SDCR" edc:nzwidth="0x20" edc:access="------------------------nn----nn" edc:impl="0xC3" edc:_addr="0x4000000C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="SDCSEL" edc:nzwidth="0x2" edc:desc="SDCard/SDIO Slot">
              <edc:SFRFieldSemantic edc:cname="SLOTA" edc:desc="Slot A is selected." edc:when="(field &amp; 0x3) == 0"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SDCBUS" edc:nzwidth="0x2" edc:desc="SDCard/SDIO Bus Width">
              <edc:SFRFieldSemantic edc:cname="_1" edc:desc="1 bit" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_4" edc:desc="4 bits" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8" edc:desc="8 bits" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_ARGR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40000010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="ARG" edc:nzwidth="0x20" edc:desc="Command Argument"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_CMDR" edc:nzwidth="0x20" edc:access="----wwww--wwwwww---wwwwwwwwwwwww" edc:impl="0xF3F1FFF" edc:_addr="0x40000014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="CMDNB" edc:nzwidth="0x6" edc:desc="Command Number"/>
            <edc:SFRFieldDef edc:cname="RSPTYP" edc:nzwidth="0x2" edc:desc="Response Type">
              <edc:SFRFieldSemantic edc:cname="NORESP" edc:desc="No response" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_48_BIT" edc:desc="48-bit response" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_136_BIT" edc:desc="136-bit response" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="R1B" edc:desc="R1b response type" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SPCMD" edc:nzwidth="0x3" edc:desc="Special Command">
              <edc:SFRFieldSemantic edc:cname="STD" edc:desc="Not a special CMD." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="INIT" edc:desc="Initialization CMD: 74 clock cycles for initialization sequence." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Synchronized CMD: Wait for the end of the current data block transfer before sending the pending command." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CE_ATA" edc:desc="CE-ATA Completion Signal disable Command. The host cancels the ability for the device to return a command completion signal on the command line." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="IT_CMD" edc:desc="Interrupt command: Corresponds to the Interrupt Mode (CMD40)." edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="IT_RESP" edc:desc="Interrupt response: Corresponds to the Interrupt Mode (CMD40)." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="BOR" edc:desc="Boot Operation Request. Start a boot operation mode, the host processor can read boot data from the MMC device directly." edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="EBO" edc:desc="End Boot Operation. This command allows the host processor to terminate the boot operation mode." edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OPDCMD" edc:nzwidth="0x1" edc:desc="Open Drain Command">
              <edc:SFRFieldSemantic edc:cname="PUSHPULL" edc:desc="Push pull command." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="OPENDRAIN" edc:desc="Open drain command." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MAXLAT" edc:nzwidth="0x1" edc:desc="Max Latency for Command to Response">
              <edc:SFRFieldSemantic edc:cname="_5" edc:desc="5-cycle max latency." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="_64" edc:desc="64-cycle max latency." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TRCMD" edc:nzwidth="0x2" edc:desc="Transfer Command">
              <edc:SFRFieldSemantic edc:cname="NO_DATA" edc:desc="No data transfer" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="START_DATA" edc:desc="Start data transfer" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="STOP_DATA" edc:desc="Stop data transfer" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRDIR" edc:nzwidth="0x1" edc:desc="Transfer Direction">
              <edc:SFRFieldSemantic edc:cname="WRITE" edc:desc="Write." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="READ" edc:desc="Read." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRTYP" edc:nzwidth="0x3" edc:desc="Transfer Type">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="MMC/SD Card Single Block" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE" edc:desc="MMC/SD Card Multiple Block" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="STREAM" edc:desc="MMC Stream" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="SDIO Byte" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="BLOCK" edc:desc="SDIO Block" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="IOSPCMD" edc:nzwidth="0x2" edc:desc="SDIO Special Command">
              <edc:SFRFieldSemantic edc:cname="STD" edc:desc="Not an SDIO Special Command" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUSPEND" edc:desc="SDIO Suspend Command" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RESUME" edc:desc="SDIO Resume Command" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ATACS" edc:nzwidth="0x1" edc:desc="ATA with Command Completion Signal">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal operation mode." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="COMPLETION" edc:desc="This bit indicates that a completion signal is expected within a programmed amount of time (HSMCI_CSTOR)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BOOT_ACK" edc:nzwidth="0x1" edc:desc="Boot Operation Acknowledge"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
