Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_BLKR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40000018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="BCNT" edc:nzwidth="0x10" edc:desc="MMC/SDIO Block Count - SDIO Byte Count"/>
            <edc:SFRFieldDef edc:cname="BLKLEN" edc:nzwidth="0x10" edc:desc="Data Block Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_CSTOR" edc:nzwidth="0x20" edc:access="-------------------------nnnnnnn" edc:impl="0x7F" edc:_addr="0x4000001C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="CSTOCYC" edc:nzwidth="0x4" edc:desc="Completion Signal Timeout Cycle Number"/>
            <edc:SFRFieldDef edc:cname="CSTOMUL" edc:nzwidth="0x3" edc:desc="Completion Signal Timeout Multiplier">
              <edc:SFRFieldSemantic edc:cname="_1" edc:desc="CSTOCYC x 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16" edc:desc="CSTOCYC x 16" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_128" edc:desc="CSTOCYC x 128" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_256" edc:desc="CSTOCYC x 256" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_1024" edc:desc="CSTOCYC x 1024" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_4096" edc:desc="CSTOCYC x 4096" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_65536" edc:desc="CSTOCYC x 65536" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1048576" edc:desc="CSTOCYC x 1048576" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_RSPR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40000020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="RSP" edc:nzwidth="0x20" edc:desc="Response"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_RSPR1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40000024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="RSP" edc:nzwidth="0x20" edc:desc="Response"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_RSPR2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40000028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="RSP" edc:nzwidth="0x20" edc:desc="Response"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_RSPR3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4000002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="RSP" edc:nzwidth="0x20" edc:desc="Response"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_RDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40000030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data to Read"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_TDR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40000034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data to Write"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40000038"/>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_SR" edc:nzwidth="0x20" edc:access="rrrrrr-rrrrrrrrr--rr---r--rrrrrr" edc:impl="0xFDFF313F" edc:_addr="0x40000040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="CMDRDY" edc:nzwidth="0x1" edc:desc="Command Ready (cleared by writing in HSMCI_CMDR)"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receiver Ready (cleared by reading HSMCI_RDR)"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready (cleared by writing in HSMCI_TDR)"/>
            <edc:SFRFieldDef edc:cname="BLKE" edc:nzwidth="0x1" edc:desc="Data Block Ended (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="DTIP" edc:nzwidth="0x1" edc:desc="Data Transfer in Progress (cleared at the end of CRC16 calculation)"/>
            <edc:SFRFieldDef edc:cname="NOTBUSY" edc:nzwidth="0x1" edc:desc="HSMCI Not Busy"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SDIOIRQA" edc:nzwidth="0x1" edc:desc="SDIO Interrupt for Slot A (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SDIOWAIT" edc:nzwidth="0x1" edc:desc="SDIO Read Wait Operation Status"/>
            <edc:SFRFieldDef edc:cname="CSRCV" edc:nzwidth="0x1" edc:desc="CE-ATA Completion Signal Received (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RINDE" edc:nzwidth="0x1" edc:desc="Response Index Error (cleared by writing in HSMCI_CMDR)"/>
            <edc:SFRFieldDef edc:cname="RDIRE" edc:nzwidth="0x1" edc:desc="Response Direction Error (cleared by writing in HSMCI_CMDR)"/>
            <edc:SFRFieldDef edc:cname="RCRCE" edc:nzwidth="0x1" edc:desc="Response CRC Error (cleared by writing in HSMCI_CMDR)"/>
            <edc:SFRFieldDef edc:cname="RENDE" edc:nzwidth="0x1" edc:desc="Response End Bit Error (cleared by writing in HSMCI_CMDR)"/>
            <edc:SFRFieldDef edc:cname="RTOE" edc:nzwidth="0x1" edc:desc="Response Time-out Error (cleared by writing in HSMCI_CMDR)"/>
            <edc:SFRFieldDef edc:cname="DCRCE" edc:nzwidth="0x1" edc:desc="Data CRC Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="DTOE" edc:nzwidth="0x1" edc:desc="Data Time-out Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CSTOE" edc:nzwidth="0x1" edc:desc="Completion Signal Time-out Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="BLKOVRE" edc:nzwidth="0x1" edc:desc="DMA Block Overrun Error (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOEMPTY" edc:nzwidth="0x1" edc:desc="FIFO empty flag"/>
            <edc:SFRFieldDef edc:cname="XFRDONE" edc:nzwidth="0x1" edc:desc="Transfer Done flag"/>
            <edc:SFRFieldDef edc:cname="ACKRCV" edc:nzwidth="0x1" edc:desc="Boot Operation Acknowledge Received (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ACKRCVE" edc:nzwidth="0x1" edc:desc="Boot Operation Acknowledge Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0)"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun (if FERRCTRL = 1, cleared by writing in HSMCI_CMDR or cleared on read if FERRCTRL = 0)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
