Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_IER" edc:nzwidth="0x20" edc:access="wwwwww-wwwwwwwww--ww---w--wwwwww" edc:impl="0xFDFF313F" edc:_addr="0x40000044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="CMDRDY" edc:nzwidth="0x1" edc:desc="Command Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receiver Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BLKE" edc:nzwidth="0x1" edc:desc="Data Block Ended Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DTIP" edc:nzwidth="0x1" edc:desc="Data Transfer in Progress Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NOTBUSY" edc:nzwidth="0x1" edc:desc="Data Not Busy Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SDIOIRQA" edc:nzwidth="0x1" edc:desc="SDIO Interrupt for Slot A Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SDIOWAIT" edc:nzwidth="0x1" edc:desc="SDIO Read Wait Operation Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CSRCV" edc:nzwidth="0x1" edc:desc="Completion Signal Received Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RINDE" edc:nzwidth="0x1" edc:desc="Response Index Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RDIRE" edc:nzwidth="0x1" edc:desc="Response Direction Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RCRCE" edc:nzwidth="0x1" edc:desc="Response CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RENDE" edc:nzwidth="0x1" edc:desc="Response End Bit Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RTOE" edc:nzwidth="0x1" edc:desc="Response Time-out Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DCRCE" edc:nzwidth="0x1" edc:desc="Data CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DTOE" edc:nzwidth="0x1" edc:desc="Data Time-out Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CSTOE" edc:nzwidth="0x1" edc:desc="Completion Signal Timeout Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BLKOVRE" edc:nzwidth="0x1" edc:desc="DMA Block Overrun Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOEMPTY" edc:nzwidth="0x1" edc:desc="FIFO empty Interrupt enable"/>
            <edc:SFRFieldDef edc:cname="XFRDONE" edc:nzwidth="0x1" edc:desc="Transfer Done Interrupt enable"/>
            <edc:SFRFieldDef edc:cname="ACKRCV" edc:nzwidth="0x1" edc:desc="Boot Acknowledge Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ACKRCVE" edc:nzwidth="0x1" edc:desc="Boot Acknowledge Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_IDR" edc:nzwidth="0x20" edc:access="wwwwww-wwwwwwwww--ww---w--wwwwww" edc:impl="0xFDFF313F" edc:_addr="0x40000048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="CMDRDY" edc:nzwidth="0x1" edc:desc="Command Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receiver Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="BLKE" edc:nzwidth="0x1" edc:desc="Data Block Ended Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DTIP" edc:nzwidth="0x1" edc:desc="Data Transfer in Progress Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NOTBUSY" edc:nzwidth="0x1" edc:desc="Data Not Busy Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SDIOIRQA" edc:nzwidth="0x1" edc:desc="SDIO Interrupt for Slot A Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SDIOWAIT" edc:nzwidth="0x1" edc:desc="SDIO Read Wait Operation Status Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CSRCV" edc:nzwidth="0x1" edc:desc="Completion Signal received interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RINDE" edc:nzwidth="0x1" edc:desc="Response Index Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RDIRE" edc:nzwidth="0x1" edc:desc="Response Direction Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RCRCE" edc:nzwidth="0x1" edc:desc="Response CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RENDE" edc:nzwidth="0x1" edc:desc="Response End Bit Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RTOE" edc:nzwidth="0x1" edc:desc="Response Time-out Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DCRCE" edc:nzwidth="0x1" edc:desc="Data CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DTOE" edc:nzwidth="0x1" edc:desc="Data Time-out Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CSTOE" edc:nzwidth="0x1" edc:desc="Completion Signal Time out Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="BLKOVRE" edc:nzwidth="0x1" edc:desc="DMA Block Overrun Error Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOEMPTY" edc:nzwidth="0x1" edc:desc="FIFO empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="XFRDONE" edc:nzwidth="0x1" edc:desc="Transfer Done Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ACKRCV" edc:nzwidth="0x1" edc:desc="Boot Acknowledge Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ACKRCVE" edc:nzwidth="0x1" edc:desc="Boot Acknowledge Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
