Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_IMR" edc:nzwidth="0x20" edc:access="rrrrrr-rrrrrrrrr--rr---r--rrrrrr" edc:impl="0xFDFF313F" edc:_addr="0x4000004C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="CMDRDY" edc:nzwidth="0x1" edc:desc="Command Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receiver Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="BLKE" edc:nzwidth="0x1" edc:desc="Data Block Ended Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="DTIP" edc:nzwidth="0x1" edc:desc="Data Transfer in Progress Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="NOTBUSY" edc:nzwidth="0x1" edc:desc="Data Not Busy Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SDIOIRQA" edc:nzwidth="0x1" edc:desc="SDIO Interrupt for Slot A Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SDIOWAIT" edc:nzwidth="0x1" edc:desc="SDIO Read Wait Operation Status Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CSRCV" edc:nzwidth="0x1" edc:desc="Completion Signal Received Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RINDE" edc:nzwidth="0x1" edc:desc="Response Index Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RDIRE" edc:nzwidth="0x1" edc:desc="Response Direction Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RCRCE" edc:nzwidth="0x1" edc:desc="Response CRC Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RENDE" edc:nzwidth="0x1" edc:desc="Response End Bit Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RTOE" edc:nzwidth="0x1" edc:desc="Response Time-out Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="DCRCE" edc:nzwidth="0x1" edc:desc="Data CRC Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="DTOE" edc:nzwidth="0x1" edc:desc="Data Time-out Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CSTOE" edc:nzwidth="0x1" edc:desc="Completion Signal Time-out Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="BLKOVRE" edc:nzwidth="0x1" edc:desc="DMA Block Overrun Error Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOEMPTY" edc:nzwidth="0x1" edc:desc="FIFO Empty Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="XFRDONE" edc:nzwidth="0x1" edc:desc="Transfer Done Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ACKRCV" edc:nzwidth="0x1" edc:desc="Boot Operation Acknowledge Received Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ACKRCVE" edc:nzwidth="0x1" edc:desc="Boot Operation Acknowledge Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_DMA" edc:nzwidth="0x20" edc:access="-----------------------n-nnn----" edc:impl="0x170" edc:_addr="0x40000050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CHKSIZE" edc:nzwidth="0x3" edc:desc="DMA Channel Read and Write Chunk Size">
              <edc:SFRFieldSemantic edc:cname="_1" edc:desc="1 data available" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2" edc:desc="2 data available" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_4" edc:desc="4 data available" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8" edc:desc="8 data available" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_16" edc:desc="16 data available" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAEN" edc:nzwidth="0x1" edc:desc="DMA Hardware Handshaking Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_CFG" edc:nzwidth="0x20" edc:access="-------------------n---n---n---n" edc:impl="0x1111" edc:_addr="0x40000054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="FIFOMODE" edc:nzwidth="0x1" edc:desc="HSMCI Internal FIFO control mode"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="FERRCTRL" edc:nzwidth="0x1" edc:desc="Flow Error flag reset control mode"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="HSMODE" edc:nzwidth="0x1" edc:desc="High Speed Mode"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="LSYNC" edc:nzwidth="0x1" edc:desc="Synchronize on the last block"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8C" edc:_addr="0x40000058"/>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400000E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protect Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protect Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x4D4349"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400000E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
