Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_FIFO250" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400005E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data to Read or Data to Write"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_FIFO251" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400005EC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data to Read or Data to Write"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_FIFO252" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400005F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data to Read or Data to Write"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_FIFO253" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400005F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data to Read or Data to Write"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_FIFO254" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400005F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data to Read or Data to Write"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="HSMCI" edc:cname="HSMCI_FIFO255" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400005FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="HSMCI">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Data to Read or Data to Write"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3A00" edc:_addr="0x40000600"/>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_CR" edc:nzwidth="0x20" edc:access="----------------w-----ww------ww" edc:impl="0x8303" edc:_addr="0x40004000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Receive Enable"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:nzwidth="0x1" edc:desc="Receive Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:nzwidth="0x1" edc:desc="Transmit Enable"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:nzwidth="0x1" edc:desc="Transmit Disable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_CMR" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0x40004004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0xC" edc:desc="Clock Divider"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40004008"/>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_RCMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---nnnnnnnnnnnnn" edc:impl="0xFFFF1FFF" edc:_addr="0x40004010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="CKS" edc:nzwidth="0x2" edc:desc="Receive Clock Selection">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Divided Clock" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TK" edc:desc="TK Clock signal" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RK" edc:desc="RK pin" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CKO" edc:nzwidth="0x3" edc:desc="Receive Clock Output Mode Selection">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None, RK pin is an input" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous Receive Clock, RK pin is an output" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="TRANSFER" edc:desc="Receive Clock only during data transfers, RK pin is an output" edc:when="(field &amp; 0x7) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CKI" edc:nzwidth="0x1" edc:desc="Receive Clock Inversion"/>
            <edc:SFRFieldDef edc:cname="CKG" edc:nzwidth="0x2" edc:desc="Receive Clock Gating Selection">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="None" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="EN_RF_LOW" edc:desc="Receive Clock enabled only if RF Low" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EN_RF_HIGH" edc:desc="Receive Clock enabled only if RF High" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x4" edc:desc="Receive Start Selection">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data." edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRANSMIT" edc:desc="Transmit start" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RF_LOW" edc:desc="Detection of a low level on RF signal" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="RF_HIGH" edc:desc="Detection of a high level on RF signal" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="RF_FALLING" edc:desc="Detection of a falling edge on RF signal" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="RF_RISING" edc:desc="Detection of a rising edge on RF signal" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="RF_LEVEL" edc:desc="Detection of any level change on RF signal" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="RF_EDGE" edc:desc="Detection of any edge on RF signal" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="CMP_0" edc:desc="Compare 0" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STOP" edc:nzwidth="0x1" edc:desc="Receive Stop Selection"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="STTDLY" edc:nzwidth="0x8" edc:desc="Receive Start Delay"/>
            <edc:SFRFieldDef edc:cname="PERIOD" edc:nzwidth="0x8" edc:desc="Receive Period Divider Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
