Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_IMR" edc:nzwidth="0x20" edc:access="--------------------rrrr--rr--rr" edc:impl="0xF33" edc:_addr="0x4000404C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmit Empty Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="OVRUN" edc:nzwidth="0x1" edc:desc="Receive Overrun Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CP0" edc:nzwidth="0x1" edc:desc="Compare 0 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CP1" edc:nzwidth="0x1" edc:desc="Compare 1 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXSYN" edc:nzwidth="0x1" edc:desc="Tx Sync Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXSYN" edc:nzwidth="0x1" edc:desc="Rx Sync Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x94" edc:_addr="0x40004050"/>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400040E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x535343"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SSC" edc:cname="SSC_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400040E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SSC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protect Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F14" edc:_addr="0x400040EC"/>
      <edc:SFRDef ltx:memberofperipheral="SPI0" edc:cname="SPI0_CR" edc:nzwidth="0x20" edc:access="-------w-----------w----w-----ww" edc:impl="0x1001083" edc:_addr="0x40008000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI0">
            <edc:SFRFieldDef edc:cname="SPIEN" edc:nzwidth="0x1" edc:desc="SPI Enable"/>
            <edc:SFRFieldDef edc:cname="SPIDIS" edc:nzwidth="0x1" edc:desc="SPI Disable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="SPI Software Reset"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="REQCLR" edc:nzwidth="0x1" edc:desc="Request to Clear the Comparison Trigger"/>
            <edc:AdjustPoint edc:offset="0xB"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:nzwidth="0x1" edc:desc="Last Transfer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPI0" edc:cname="SPI0_MR" edc:nzwidth="0x20" edc:access="nnnnnnnn----nnnn--------n-nn-nnn" edc:impl="0xFF0F00B7" edc:_addr="0x40008004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI0">
            <edc:SFRFieldDef edc:cname="MSTR" edc:nzwidth="0x1" edc:desc="Master/Slave Mode">
              <edc:SFRFieldSemantic edc:cname="MASTER" edc:desc="Master" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SLAVE" edc:desc="Slave" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PS" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="PCSDEC" edc:nzwidth="0x1" edc:desc="Chip Select Decode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MODFDIS" edc:nzwidth="0x1" edc:desc="Mode Fault Detection"/>
            <edc:SFRFieldDef edc:cname="WDRBT" edc:nzwidth="0x1" edc:desc="Wait Data Read Before Transfer"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LLB" edc:nzwidth="0x1" edc:desc="Local Loopback Enable"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PCS" edc:nzwidth="0x4" edc:desc="Peripheral Chip Select">
              <edc:SFRFieldSemantic edc:cname="NPCS0" edc:desc="NPCS0 as Chip Select" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="NPCS1" edc:desc="NPCS1 as Chip Select" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="NPCS2" edc:desc="NPCS2 as Chip Select" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="NPCS3" edc:desc="NPCS3 as Chip Select" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DLYBCS" edc:nzwidth="0x8" edc:desc="Delay Between Chip Selects"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPI0" edc:cname="SPI0_RDR" edc:nzwidth="0x20" edc:access="------------rrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFF" edc:_addr="0x40008008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI0">
            <edc:SFRFieldDef edc:cname="RD" edc:nzwidth="0x10" edc:desc="Receive Data"/>
            <edc:SFRFieldDef edc:cname="PCS" edc:nzwidth="0x4" edc:desc="Peripheral Chip Select"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPI0" edc:cname="SPI0_TDR" edc:nzwidth="0x20" edc:access="-------w----wwwwwwwwwwwwwwwwwwww" edc:impl="0x10FFFFF" edc:_addr="0x4000800C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI0">
            <edc:SFRFieldDef edc:cname="TD" edc:nzwidth="0x10" edc:desc="Transmit Data"/>
            <edc:SFRFieldDef edc:cname="PCS" edc:nzwidth="0x4" edc:desc="Peripheral Chip Select">
              <edc:SFRFieldSemantic edc:cname="NPCS0" edc:desc="NPCS0 as Chip Select" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="NPCS1" edc:desc="NPCS1 as Chip Select" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="NPCS2" edc:desc="NPCS2 as Chip Select" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="NPCS3" edc:desc="NPCS3 as Chip Select" edc:when="(field &amp; 0xF) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:nzwidth="0x1" edc:desc="Last Transfer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPI0" edc:cname="SPI0_SR" edc:nzwidth="0x20" edc:access="---------------r-----rrr----rrrr" edc:impl="0x1070F" edc:_addr="0x40008010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI0">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full (cleared by reading SPI_RDR)"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="Transmit Data Register Empty (cleared by writing SPI_TDR)"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:nzwidth="0x1" edc:desc="Mode Fault Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Status (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:nzwidth="0x1" edc:desc="NSS Rising (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty (cleared by writing SPI_TDR)"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:nzwidth="0x1" edc:desc="Underrun Error Status (Slave mode only) (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SPIENS" edc:nzwidth="0x1" edc:desc="SPI Enable Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPI0" edc:cname="SPI0_IER" edc:nzwidth="0x20" edc:access="---------------------www----wwww" edc:impl="0x70F" edc:_addr="0x40008014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI0">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="SPI Transmit Data Register Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:nzwidth="0x1" edc:desc="Mode Fault Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:nzwidth="0x1" edc:desc="NSS Rising Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty Enable"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
