Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="TC2" edc:cname="TC2_FMR" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x400140D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="ENCF0" edc:nzwidth="0x1" edc:desc="Enable Compare Fault Channel 0"/>
            <edc:SFRFieldDef edc:cname="ENCF1" edc:nzwidth="0x1" edc:desc="Enable Compare Fault Channel 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400140DC"/>
      <edc:SFRDef ltx:memberofperipheral="TC2" edc:cname="TC2_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400140E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC2">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x54494D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F18" edc:_addr="0x400140E8"/>
      <edc:SFRDef ltx:memberofperipheral="TWIHS0" edc:cname="TWIHS0_CR" edc:nzwidth="0x20" edc:access="--ww-w-w------wwwwwwwwwwwwwwwwww" edc:impl="0x3503FFFF" edc:_addr="0x40018000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="Send a START Condition"/>
            <edc:SFRFieldDef edc:cname="STOP" edc:nzwidth="0x1" edc:desc="Send a STOP Condition"/>
            <edc:SFRFieldDef edc:cname="MSEN" edc:nzwidth="0x1" edc:desc="TWIHS Master Mode Enabled"/>
            <edc:SFRFieldDef edc:cname="MSDIS" edc:nzwidth="0x1" edc:desc="TWIHS Master Mode Disabled"/>
            <edc:SFRFieldDef edc:cname="SVEN" edc:nzwidth="0x1" edc:desc="TWIHS Slave Mode Enabled"/>
            <edc:SFRFieldDef edc:cname="SVDIS" edc:nzwidth="0x1" edc:desc="TWIHS Slave Mode Disabled"/>
            <edc:SFRFieldDef edc:cname="QUICK" edc:nzwidth="0x1" edc:desc="SMBus Quick Command"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="HSEN" edc:nzwidth="0x1" edc:desc="TWIHS High-Speed Mode Enabled"/>
            <edc:SFRFieldDef edc:cname="HSDIS" edc:nzwidth="0x1" edc:desc="TWIHS High-Speed Mode Disabled"/>
            <edc:SFRFieldDef edc:cname="SMBEN" edc:nzwidth="0x1" edc:desc="SMBus Mode Enabled"/>
            <edc:SFRFieldDef edc:cname="SMBDIS" edc:nzwidth="0x1" edc:desc="SMBus Mode Disabled"/>
            <edc:SFRFieldDef edc:cname="PECEN" edc:nzwidth="0x1" edc:desc="Packet Error Checking Enable"/>
            <edc:SFRFieldDef edc:cname="PECDIS" edc:nzwidth="0x1" edc:desc="Packet Error Checking Disable"/>
            <edc:SFRFieldDef edc:cname="PECRQ" edc:nzwidth="0x1" edc:desc="PEC Request"/>
            <edc:SFRFieldDef edc:cname="CLEAR" edc:nzwidth="0x1" edc:desc="Bus CLEAR Command"/>
            <edc:SFRFieldDef edc:cname="ACMEN" edc:nzwidth="0x1" edc:desc="Alternative Command Mode Enable"/>
            <edc:SFRFieldDef edc:cname="ACMDIS" edc:nzwidth="0x1" edc:desc="Alternative Command Mode Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="THRCLR" edc:nzwidth="0x1" edc:desc="Transmit Holding Register Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKCLR" edc:nzwidth="0x1" edc:desc="Lock Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOEN" edc:nzwidth="0x1" edc:desc="FIFO Enable"/>
            <edc:SFRFieldDef edc:cname="FIFODIS" edc:nzwidth="0x1" edc:desc="FIFO Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TWIHS0" edc:cname="TWIHS0_MMR" edc:nzwidth="0x20" edc:access="---------nnnnnnn---n--nn--------" edc:impl="0x7F1300" edc:_addr="0x40018004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="IADRSZ" edc:nzwidth="0x2" edc:desc="Internal Device Address Size">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No internal device address" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BYTE" edc:desc="One-byte internal device address" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BYTE" edc:desc="Two-byte internal device address" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BYTE" edc:desc="Three-byte internal device address" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MREAD" edc:nzwidth="0x1" edc:desc="Master Read Direction"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DADR" edc:nzwidth="0x7" edc:desc="Device Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TWIHS0" edc:cname="TWIHS0_SMR" edc:nzwidth="0x20" edc:access="nnnn-----nnnnnnn-nnnnnnn-n--nn-n" edc:impl="0xF07F7F4D" edc:_addr="0x40018008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="NACKEN" edc:nzwidth="0x1" edc:desc="Slave Receiver Data Phase NACK enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMDA" edc:nzwidth="0x1" edc:desc="SMBus Default Address"/>
            <edc:SFRFieldDef edc:cname="SMHH" edc:nzwidth="0x1" edc:desc="SMBus Host Header"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SCLWSDIS" edc:nzwidth="0x1" edc:desc="Clock Wait State Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x7" edc:desc="Slave Address Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SADR" edc:nzwidth="0x7" edc:desc="Slave Address"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SADR1EN" edc:nzwidth="0x1" edc:desc="Slave Address 1 Enable"/>
            <edc:SFRFieldDef edc:cname="SADR2EN" edc:nzwidth="0x1" edc:desc="Slave Address 2 Enable"/>
            <edc:SFRFieldDef edc:cname="SADR3EN" edc:nzwidth="0x1" edc:desc="Slave Address 3 Enable"/>
            <edc:SFRFieldDef edc:cname="DATAMEN" edc:nzwidth="0x1" edc:desc="Data Matching Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TWIHS0" edc:cname="TWIHS0_IADR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4001800C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="IADR" edc:nzwidth="0x18" edc:desc="Internal Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TWIHS0" edc:cname="TWIHS0_CWGR" edc:nzwidth="0x20" edc:access="--nnnnnn-----nnnnnnnnnnnnnnnnnnn" edc:impl="0x3F07FFFF" edc:_addr="0x40018010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS0">
            <edc:SFRFieldDef edc:cname="CLDIV" edc:nzwidth="0x8" edc:desc="Clock Low Divider"/>
            <edc:SFRFieldDef edc:cname="CHDIV" edc:nzwidth="0x8" edc:desc="Clock High Divider"/>
            <edc:SFRFieldDef edc:cname="CKDIV" edc:nzwidth="0x3" edc:desc="Clock Divider"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="HOLD" edc:nzwidth="0x6" edc:desc="TWD Hold Time Versus TWCK Falling"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
