Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_OOV" edc:nzwidth="0x20" edc:access="------------nnnn------------nnnn" edc:impl="0xF000F" edc:_addr="0x40020044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OOVH0" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OOVH1" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OOVH2" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OOVH3" edc:nzwidth="0x1" edc:desc="Output Override Value for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OOVL0" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OOVL1" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OOVL2" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OOVL3" edc:nzwidth="0x1" edc:desc="Output Override Value for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_OS" edc:nzwidth="0x20" edc:access="------------nnnn------------nnnn" edc:impl="0xF000F" edc:_addr="0x40020048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OSH0" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSH1" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSH2" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSH3" edc:nzwidth="0x1" edc:desc="Output Selection for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSL0" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSL1" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSL2" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSL3" edc:nzwidth="0x1" edc:desc="Output Selection for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_OSS" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x4002004C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OSSH0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSH1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSH2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSSH3" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSSL0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSL1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSL2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSSL3" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_OSC" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x40020050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OSCH0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCH1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCH2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSCH3" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSCL0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCL1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCL2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSCL3" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_OSSUPD" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x40020054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OSSUPH0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSUPH1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSUPH2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSSUPH3" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSSUPL0" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSSUPL1" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSSUPL2" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSSUPL3" edc:nzwidth="0x1" edc:desc="Output Selection Set for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM0" edc:cname="PWM0_OSCUPD" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x40020058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="OSCUPH0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCUPH1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCUPH2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSCUPH3" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWMH output of the channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="OSCUPL0" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 0"/>
            <edc:SFRFieldDef edc:cname="OSCUPL1" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 1"/>
            <edc:SFRFieldDef edc:cname="OSCUPL2" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 2"/>
            <edc:SFRFieldDef edc:cname="OSCUPL3" edc:nzwidth="0x1" edc:desc="Output Selection Clear for PWML output of the channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
