Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_IDTRX" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40024084">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="IDTRX" edc:nzwidth="0x18" edc:desc="LON Indeterminate Time after Reception (comm_type = 1 mode only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_ICDIFF" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0x40024088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="ICDIFF" edc:nzwidth="0x4" edc:desc="IC Differentiator Number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x58" edc:_addr="0x4002408C"/>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400240E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x555341"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART0" edc:cname="US_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400240E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F14" edc:_addr="0x400240EC"/>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_CR" edc:nzwidth="0x20" edc:access="----------wwwwwwwwwwwwwwwwwwww--" edc:impl="0x3FFFFC" edc:_addr="0x40028000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RSTRX" edc:nzwidth="0x1" edc:desc="Reset Receiver"/>
            <edc:SFRFieldDef edc:cname="RSTTX" edc:nzwidth="0x1" edc:desc="Reset Transmitter"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Receiver Enable"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:nzwidth="0x1" edc:desc="Receiver Disable"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:nzwidth="0x1" edc:desc="Transmitter Enable"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:nzwidth="0x1" edc:desc="Transmitter Disable"/>
            <edc:SFRFieldDef edc:cname="RSTSTA" edc:nzwidth="0x1" edc:desc="Reset Status Bits"/>
            <edc:SFRFieldDef edc:cname="STTBRK" edc:nzwidth="0x1" edc:desc="Start Break"/>
            <edc:SFRFieldDef edc:cname="STPBRK" edc:nzwidth="0x1" edc:desc="Stop Break"/>
            <edc:SFRFieldDef edc:cname="STTTO" edc:nzwidth="0x1" edc:desc="Clear TIMEOUT Flag and Start Timeout After Next Character Received"/>
            <edc:SFRFieldDef edc:cname="SENDA" edc:nzwidth="0x1" edc:desc="Send Address"/>
            <edc:SFRFieldDef edc:cname="RSTIT" edc:nzwidth="0x1" edc:desc="Reset Iterations"/>
            <edc:SFRFieldDef edc:cname="RSTNACK" edc:nzwidth="0x1" edc:desc="Reset Non Acknowledge"/>
            <edc:SFRFieldDef edc:cname="RETTO" edc:nzwidth="0x1" edc:desc="Start Timeout Immediately"/>
            <edc:SFRFieldDef edc:cname="DTREN" edc:nzwidth="0x1" edc:desc="Data Terminal Ready Enable"/>
            <edc:SFRFieldDef edc:cname="DTRDIS" edc:nzwidth="0x1" edc:desc="Data Terminal Ready Disable"/>
            <edc:SFRFieldDef edc:cname="FCS" edc:nzwidth="0x1" edc:desc="Force SPI Chip Select"/>
            <edc:SFRFieldDef edc:cname="RCS" edc:nzwidth="0x1" edc:desc="Release SPI Chip Select"/>
            <edc:SFRFieldDef edc:cname="LINABT" edc:nzwidth="0x1" edc:desc="Abort LIN Transmission"/>
            <edc:SFRFieldDef edc:cname="LINWKUP" edc:nzwidth="0x1" edc:desc="Send LIN Wakeup Signal"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_MR" edc:nzwidth="0x20" edc:access="nnnn-nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xF7FFFFFF" edc:_addr="0x40028004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="USART_MODE" edc:nzwidth="0x4" edc:desc="USART Mode of Operation">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RS485" edc:desc="RS485" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HW_HANDSHAKING" edc:desc="Hardware handshaking" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODEM" edc:desc="Modem" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="IS07816_T_0" edc:desc="IS07816 Protocol: T = 0" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="IS07816_T_1" edc:desc="IS07816 Protocol: T = 1" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="IRDA" edc:desc="IrDA" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="LON" edc:desc="LON" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="LIN_MASTER" edc:desc="LIN Master mode" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="LIN_SLAVE" edc:desc="LIN Slave mode" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="SPI_MASTER" edc:desc="SPI Master mode (CLKO must be written to 1 and USCLKS = 0, 1 or 2)" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="SPI_SLAVE" edc:desc="SPI Slave mode" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="USCLKS" edc:nzwidth="0x2" edc:desc="Clock Selection">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Peripheral clock is selected" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Peripheral clock divided (DIV = 8) is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PCK" edc:desc="PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SCK" edc:desc="Serial clock (SCK) is selected" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHRL" edc:nzwidth="0x2" edc:desc="Character Length">
              <edc:SFRFieldSemantic edc:cname="_5_BIT" edc:desc="Character length is 5 bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_6_BIT" edc:desc="Character length is 6 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_7_BIT" edc:desc="Character length is 7 bits" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="Character length is 8 bits" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPHA" edc:nzwidth="0x1" edc:desc="SPI Clock Phase"/>
            <edc:SFRFieldDef edc:cname="PAR" edc:nzwidth="0x3" edc:desc="Parity Type">
              <edc:SFRFieldSemantic edc:cname="EVEN" edc:desc="Even parity" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ODD" edc:desc="Odd parity" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPACE" edc:desc="Parity forced to 0 (Space)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MARK" edc:desc="Parity forced to 1 (Mark)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No parity" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MULTIDROP" edc:desc="Multidrop mode" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBSTOP" edc:nzwidth="0x2" edc:desc="Number of Stop Bits">
              <edc:SFRFieldSemantic edc:cname="_1_BIT" edc:desc="1 stop bit" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_5_BIT" edc:desc="1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BIT" edc:desc="2 stop bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHMODE" edc:nzwidth="0x2" edc:desc="Channel Mode">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AUTOMATIC" edc:desc="Automatic Echo. Receiver input is connected to the TXD pin." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LOCAL_LOOPBACK" edc:desc="Local Loopback. Transmitter output is connected to the Receiver Input." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REMOTE_LOOPBACK" edc:desc="Remote Loopback. RXD pin is internally connected to the TXD pin." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:nzwidth="0x1" edc:desc="SPI Clock Polarity"/>
            <edc:SFRFieldDef edc:cname="MODE9" edc:nzwidth="0x1" edc:desc="9-bit Character Length"/>
            <edc:SFRFieldDef edc:cname="CLKO" edc:nzwidth="0x1" edc:desc="Clock Output Select"/>
            <edc:SFRFieldDef edc:cname="OVER" edc:nzwidth="0x1" edc:desc="Oversampling Mode"/>
            <edc:SFRFieldDef edc:cname="WRDBT" edc:nzwidth="0x1" edc:desc="Wait Read Data Before Transfer"/>
            <edc:SFRFieldDef edc:cname="DSNACK" edc:nzwidth="0x1" edc:desc="Disable Successive NACK"/>
            <edc:SFRFieldDef edc:cname="VAR_SYNC" edc:nzwidth="0x1" edc:desc="Variable Synchronization of Command/Data Sync Start Frame Delimiter"/>
            <edc:SFRFieldDef edc:cname="INVDATA" edc:nzwidth="0x1" edc:desc="Inverted Data"/>
            <edc:SFRFieldDef edc:cname="MAX_ITERATION" edc:nzwidth="0x3" edc:desc="Maximum Number of Automatic Iteration"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FILTER" edc:nzwidth="0x1" edc:desc="Receive Line Filter"/>
            <edc:SFRFieldDef edc:cname="MAN" edc:nzwidth="0x1" edc:desc="Manchester Encoder/Decoder Enable"/>
            <edc:SFRFieldDef edc:cname="MODSYNC" edc:nzwidth="0x1" edc:desc="Manchester Synchronization Mode"/>
            <edc:SFRFieldDef edc:cname="ONEBIT" edc:nzwidth="0x1" edc:desc="Start Frame Delimiter Selector"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_IER" edc:nzwidth="0x20" edc:access="wwwwwwww----wwwwwww--wwwwww--www" edc:impl="0xFF0FE7E7" edc:_addr="0x40028008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="RXRDY Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="TXRDY Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Receiver Break Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:nzwidth="0x1" edc:desc="LON Short Frame Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:nzwidth="0x1" edc:desc="LON CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Timeout Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="TXEMPTY Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:nzwidth="0x1" edc:desc="LIN Break Sent or LIN Break Received Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:nzwidth="0x1" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:nzwidth="0x1" edc:desc="LIN Transfer Completed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:nzwidth="0x1" edc:desc="Ring Indicator Input Change Enable"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:nzwidth="0x1" edc:desc="Data Set Ready Input Change Enable"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:nzwidth="0x1" edc:desc="Data Carrier Detect Input Change Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:nzwidth="0x1" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:nzwidth="0x1" edc:desc="LON Transmission Done Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:nzwidth="0x1" edc:desc="LON Collision Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:nzwidth="0x1" edc:desc="LON Frame Early Termination Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:nzwidth="0x1" edc:desc="LON Reception Done Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:nzwidth="0x1" edc:desc="LON Backlog Overflow Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:nzwidth="0x1" edc:desc="LIN Slave Not Responding Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:nzwidth="0x1" edc:desc="LIN Synch Tolerance Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:nzwidth="0x1" edc:desc="LIN Header Timeout Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_IDR" edc:nzwidth="0x20" edc:access="wwwwwwww----wwwwwww--wwwwww--www" edc:impl="0xFF0FE7E7" edc:_addr="0x4002800C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="RXRDY Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="TXRDY Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Receiver Break Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:nzwidth="0x1" edc:desc="LON Short Frame Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:nzwidth="0x1" edc:desc="LON CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Timeout Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="TXEMPTY Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="SPI Underrun Error Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:nzwidth="0x1" edc:desc="LIN Break Sent or LIN Break Received Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:nzwidth="0x1" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:nzwidth="0x1" edc:desc="LIN Transfer Completed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:nzwidth="0x1" edc:desc="Ring Indicator Input Change Disable"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:nzwidth="0x1" edc:desc="Data Set Ready Input Change Disable"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:nzwidth="0x1" edc:desc="Data Carrier Detect Input Change Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:nzwidth="0x1" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:nzwidth="0x1" edc:desc="LON Transmission Done Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:nzwidth="0x1" edc:desc="LON Collision Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:nzwidth="0x1" edc:desc="LON Frame Early Termination Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:nzwidth="0x1" edc:desc="LON Reception Done Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:nzwidth="0x1" edc:desc="LON Backlog Overflow Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:nzwidth="0x1" edc:desc="LIN Slave Not Responding Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:nzwidth="0x1" edc:desc="LIN Synch Tolerance Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:nzwidth="0x1" edc:desc="LIN Header Timeout Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART1" edc:cname="US_IMR" edc:nzwidth="0x20" edc:access="rrrrrrrr----rrrrrrr--rrrrrr--rrr" edc:impl="0xFF0FE7E7" edc:_addr="0x40028010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="RXRDY Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="TXRDY Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Receiver Break Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:nzwidth="0x1" edc:desc="LON Short Frame Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:nzwidth="0x1" edc:desc="LON CRC Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Timeout Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="TXEMPTY Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="SPI Underrun Error Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:nzwidth="0x1" edc:desc="LIN Break Sent or LIN Break Received Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:nzwidth="0x1" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:nzwidth="0x1" edc:desc="LIN Transfer Completed Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:nzwidth="0x1" edc:desc="Ring Indicator Input Change Mask"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:nzwidth="0x1" edc:desc="Data Set Ready Input Change Mask"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:nzwidth="0x1" edc:desc="Data Carrier Detect Input Change Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:nzwidth="0x1" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:nzwidth="0x1" edc:desc="LON Transmission Done Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:nzwidth="0x1" edc:desc="LON Collision Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:nzwidth="0x1" edc:desc="LON Frame Early Termination Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:nzwidth="0x1" edc:desc="LON Reception Done Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:nzwidth="0x1" edc:desc="LON Backlog Overflow Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:nzwidth="0x1" edc:desc="LIN Slave Not Responding Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:nzwidth="0x1" edc:desc="LIN Synch Tolerance Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:nzwidth="0x1" edc:desc="LIN Header Timeout Error Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
