Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USART2" edc:cname="US_IER" edc:nzwidth="0x20" edc:access="wwwwwwww----wwwwwww--wwwwww--www" edc:impl="0xFF0FE7E7" edc:_addr="0x4002C008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="RXRDY Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="TXRDY Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Receiver Break Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:nzwidth="0x1" edc:desc="LON Short Frame Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:nzwidth="0x1" edc:desc="LON CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Timeout Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="TXEMPTY Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:nzwidth="0x1" edc:desc="LIN Break Sent or LIN Break Received Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:nzwidth="0x1" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:nzwidth="0x1" edc:desc="LIN Transfer Completed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:nzwidth="0x1" edc:desc="Ring Indicator Input Change Enable"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:nzwidth="0x1" edc:desc="Data Set Ready Input Change Enable"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:nzwidth="0x1" edc:desc="Data Carrier Detect Input Change Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:nzwidth="0x1" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:nzwidth="0x1" edc:desc="LON Transmission Done Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:nzwidth="0x1" edc:desc="LON Collision Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:nzwidth="0x1" edc:desc="LON Frame Early Termination Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:nzwidth="0x1" edc:desc="LON Reception Done Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:nzwidth="0x1" edc:desc="LON Backlog Overflow Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:nzwidth="0x1" edc:desc="LIN Slave Not Responding Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:nzwidth="0x1" edc:desc="LIN Synch Tolerance Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:nzwidth="0x1" edc:desc="LIN Header Timeout Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART2" edc:cname="US_IDR" edc:nzwidth="0x20" edc:access="wwwwwwww----wwwwwww--wwwwww--www" edc:impl="0xFF0FE7E7" edc:_addr="0x4002C00C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="RXRDY Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="TXRDY Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Receiver Break Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:nzwidth="0x1" edc:desc="LON Short Frame Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:nzwidth="0x1" edc:desc="LON CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Timeout Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="TXEMPTY Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="SPI Underrun Error Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:nzwidth="0x1" edc:desc="LIN Break Sent or LIN Break Received Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:nzwidth="0x1" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:nzwidth="0x1" edc:desc="LIN Transfer Completed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:nzwidth="0x1" edc:desc="Ring Indicator Input Change Disable"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:nzwidth="0x1" edc:desc="Data Set Ready Input Change Disable"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:nzwidth="0x1" edc:desc="Data Carrier Detect Input Change Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:nzwidth="0x1" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:nzwidth="0x1" edc:desc="LON Transmission Done Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:nzwidth="0x1" edc:desc="LON Collision Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:nzwidth="0x1" edc:desc="LON Frame Early Termination Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:nzwidth="0x1" edc:desc="LON Reception Done Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:nzwidth="0x1" edc:desc="LON Backlog Overflow Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:nzwidth="0x1" edc:desc="LIN Slave Not Responding Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:nzwidth="0x1" edc:desc="LIN Synch Tolerance Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:nzwidth="0x1" edc:desc="LIN Header Timeout Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART2" edc:cname="US_IMR" edc:nzwidth="0x20" edc:access="rrrrrrrr----rrrrrrr--rrrrrr--rrr" edc:impl="0xFF0FE7E7" edc:_addr="0x4002C010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="RXRDY Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="TXRDY Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Receiver Break Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:nzwidth="0x1" edc:desc="LON Short Frame Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:nzwidth="0x1" edc:desc="LON CRC Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Timeout Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="TXEMPTY Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="SPI Underrun Error Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:nzwidth="0x1" edc:desc="LIN Break Sent or LIN Break Received Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:nzwidth="0x1" edc:desc="LIN Identifier Sent or LIN Identifier Received Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:nzwidth="0x1" edc:desc="LIN Transfer Completed Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:nzwidth="0x1" edc:desc="Ring Indicator Input Change Mask"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:nzwidth="0x1" edc:desc="Data Set Ready Input Change Mask"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:nzwidth="0x1" edc:desc="Data Carrier Detect Input Change Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:nzwidth="0x1" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:nzwidth="0x1" edc:desc="LON Transmission Done Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:nzwidth="0x1" edc:desc="LON Collision Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:nzwidth="0x1" edc:desc="LON Frame Early Termination Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:nzwidth="0x1" edc:desc="LON Reception Done Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:nzwidth="0x1" edc:desc="LON Backlog Overflow Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:nzwidth="0x1" edc:desc="LIN Slave Not Responding Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:nzwidth="0x1" edc:desc="LIN Synch Tolerance Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:nzwidth="0x1" edc:desc="LIN Header Timeout Error Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART2" edc:cname="US_CSR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrr--rrrrrr--rrr" edc:impl="0xFFFFE7E7" edc:_addr="0x4002C014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receiver Ready (cleared by reading US_RHR)"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmitter Ready (cleared by writing US_THR)"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:nzwidth="0x1" edc:desc="Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)"/>
            <edc:SFRFieldDef edc:cname="LSFE" edc:nzwidth="0x1" edc:desc="LON Short Frame Error"/>
            <edc:SFRFieldDef edc:cname="LCRCE" edc:nzwidth="0x1" edc:desc="LON CRC Error"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:nzwidth="0x1" edc:desc="Receiver Timeout (cleared by writing a one to bit US_CR.STTTO)"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmitter Empty (cleared by writing US_THR)"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Error"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LINBK" edc:nzwidth="0x1" edc:desc="LIN Break Sent or LIN Break Received"/>
            <edc:SFRFieldDef edc:cname="LINID" edc:nzwidth="0x1" edc:desc="LIN Identifier Sent or LIN Identifier Received"/>
            <edc:SFRFieldDef edc:cname="LINTC" edc:nzwidth="0x1" edc:desc="LIN Transfer Completed"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:nzwidth="0x1" edc:desc="Ring Indicator Input Change Flag (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:nzwidth="0x1" edc:desc="Data Set Ready Input Change Flag (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:nzwidth="0x1" edc:desc="Data Carrier Detect Input Change Flag (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="NSSE" edc:nzwidth="0x1" edc:desc="NSS Line (Driving CTS Pin) Rising or Falling Edge Event"/>
            <edc:SFRFieldDef edc:cname="RI" edc:nzwidth="0x1" edc:desc="Image of RI Input"/>
            <edc:SFRFieldDef edc:cname="DSR" edc:nzwidth="0x1" edc:desc="Image of DSR Input"/>
            <edc:SFRFieldDef edc:cname="DCD" edc:nzwidth="0x1" edc:desc="Image of DCD Input"/>
            <edc:SFRFieldDef edc:cname="LINBLS" edc:nzwidth="0x1" edc:desc="LIN Bus Line Status"/>
            <edc:SFRFieldDef edc:cname="LTXD" edc:nzwidth="0x1" edc:desc="LON Transmission End Flag"/>
            <edc:SFRFieldDef edc:cname="LCOL" edc:nzwidth="0x1" edc:desc="LON Collision Detected Flag"/>
            <edc:SFRFieldDef edc:cname="LFET" edc:nzwidth="0x1" edc:desc="LON Frame Early Termination"/>
            <edc:SFRFieldDef edc:cname="LRXD" edc:nzwidth="0x1" edc:desc="LON Reception End Flag"/>
            <edc:SFRFieldDef edc:cname="LBLOVFE" edc:nzwidth="0x1" edc:desc="LON Backlog Overflow Error"/>
            <edc:SFRFieldDef edc:cname="LINSNRE" edc:nzwidth="0x1" edc:desc="LIN Slave Not Responding Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LINSTE" edc:nzwidth="0x1" edc:desc="LIN Synch Tolerance Error"/>
            <edc:SFRFieldDef edc:cname="LINHTE" edc:nzwidth="0x1" edc:desc="LIN Header Timeout Error"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USART2" edc:cname="US_RHR" edc:nzwidth="0x20" edc:access="----------------r------rrrrrrrrr" edc:impl="0x81FF" edc:_addr="0x4002C018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:nzwidth="0x9" edc:desc="Received Character"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXSYNH" edc:nzwidth="0x1" edc:desc="Received Sync"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
