Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TSCC" edc:nzwidth="0x20" edc:access="------------nnnn--------------nn" edc:impl="0xF0003" edc:_addr="0x40030020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TSS" edc:nzwidth="0x2" edc:desc="Timestamp Select">
              <edc:SFRFieldSemantic edc:cname="ALWAYS_0" edc:desc="Timestamp counter value always 0x0000" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TCP_INC" edc:desc="Timestamp counter value incremented according to TCP" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EXT_TIMESTAMP" edc:desc="External timestamp counter value used" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="TCP" edc:nzwidth="0x4" edc:desc="Timestamp Counter Prescaler"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TSCV" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40030024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TSC" edc:nzwidth="0x10" edc:desc="Timestamp Counter (cleared on write)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TOCC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn-------------nnn" edc:impl="0xFFFF0007" edc:_addr="0x40030028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="ETOC" edc:nzwidth="0x1" edc:desc="Enable Timeout Counter">
              <edc:SFRFieldSemantic edc:cname="NO_TIMEOUT" edc:desc="Timeout Counter disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TOS_CONTROLLED" edc:desc="Timeout Counter enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TOS" edc:nzwidth="0x2" edc:desc="Timeout Select">
              <edc:SFRFieldSemantic edc:cname="CONTINUOUS" edc:desc="Continuous operation" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TX_EV_TIMEOUT" edc:desc="Timeout controlled by Tx Event FIFO" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RX0_EV_TIMEOUT" edc:desc="Timeout controlled by Receive FIFO 0" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="RX1_EV_TIMEOUT" edc:desc="Timeout controlled by Receive FIFO 1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="TOP" edc:nzwidth="0x10" edc:desc="Timeout Period"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TOCV" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4003002C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TOC" edc:nzwidth="0x10" edc:desc="Timeout Counter (cleared on write)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x40030030"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_ECR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFFF" edc:_addr="0x40030040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TEC" edc:nzwidth="0x8" edc:desc="Transmit Error Counter"/>
            <edc:SFRFieldDef edc:cname="REC" edc:nzwidth="0x7" edc:desc="Receive Error Counter"/>
            <edc:SFRFieldDef edc:cname="RP" edc:nzwidth="0x1" edc:desc="Receive Error Passive"/>
            <edc:SFRFieldDef edc:cname="CEL" edc:nzwidth="0x8" edc:desc="CAN Error Logging (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_PSR" edc:nzwidth="0x20" edc:access="---------rrrrrrr-rrrrrrrrrrrrrrr" edc:impl="0x7F7FFF" edc:_addr="0x40030044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="LEC" edc:nzwidth="0x3" edc:desc="Last Error Code (set to 111 on read)">
              <edc:SFRFieldSemantic edc:cname="NO_ERROR" edc:desc="No error occurred since LEC has been reset by successful reception or transmission." edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="STUFF_ERROR" edc:desc="More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed." edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FORM_ERROR" edc:desc="A fixed format part of a received frame has the wrong format." edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ACK_ERROR" edc:desc="The message transmitted by the MCAN was not acknowledged by another node." edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="BIT1_ERROR" edc:desc="During transmission of a message (with the exception of the arbitration field), the device tried to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant." edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="BIT0_ERROR" edc:desc="During transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device tried to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery, this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed)." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CRC_ERROR" edc:desc="The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match the CRC calculated from the received data." edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="NO_CHANGE" edc:desc="Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register." edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACT" edc:nzwidth="0x2" edc:desc="Activity">
              <edc:SFRFieldSemantic edc:cname="SYNCHRONIZING" edc:desc="Node is synchronizing on CAN communication" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Node is neither receiver nor transmitter" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RECEIVER" edc:desc="Node is operating as receiver" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TRANSMITTER" edc:desc="Node is operating as transmitter" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EP" edc:nzwidth="0x1" edc:desc="Error Passive"/>
            <edc:SFRFieldDef edc:cname="EW" edc:nzwidth="0x1" edc:desc="Warning Status"/>
            <edc:SFRFieldDef edc:cname="BO" edc:nzwidth="0x1" edc:desc="Bus_Off Status"/>
            <edc:SFRFieldDef edc:cname="DLEC" edc:nzwidth="0x3" edc:desc="Data Phase Last Error Code (set to 111 on read)"/>
            <edc:SFRFieldDef edc:cname="RESI" edc:nzwidth="0x1" edc:desc="ESI Flag of Last Received CAN FD Message (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RBRS" edc:nzwidth="0x1" edc:desc="BRS Flag of Last Received CAN FD Message (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="RFDF" edc:nzwidth="0x1" edc:desc="Received a CAN FD Message (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="PXE" edc:nzwidth="0x1" edc:desc="Protocol Exception Event (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCV" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_TDCR" edc:nzwidth="0x20" edc:access="-----------------nnnnnnn-nnnnnnn" edc:impl="0x7F7F" edc:_addr="0x40030048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="TDCF" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Filter"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCO" edc:nzwidth="0x7" edc:desc="Transmitter Delay Compensation Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4003004C"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_IR" edc:nzwidth="0x20" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FCFFFFF" edc:_addr="0x40030050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="RF0N" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 New Message"/>
            <edc:SFRFieldDef edc:cname="RF0W" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="RF0F" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Full"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Message Lost"/>
            <edc:SFRFieldDef edc:cname="RF1N" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 New Message"/>
            <edc:SFRFieldDef edc:cname="RF1W" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="RF1F" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Full"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Message Lost"/>
            <edc:SFRFieldDef edc:cname="HPM" edc:nzwidth="0x1" edc:desc="High Priority Message"/>
            <edc:SFRFieldDef edc:cname="TC" edc:nzwidth="0x1" edc:desc="Transmission Completed"/>
            <edc:SFRFieldDef edc:cname="TCF" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished"/>
            <edc:SFRFieldDef edc:cname="TFE" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty"/>
            <edc:SFRFieldDef edc:cname="TEFN" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry"/>
            <edc:SFRFieldDef edc:cname="TEFW" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached"/>
            <edc:SFRFieldDef edc:cname="TEFF" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Element Lost"/>
            <edc:SFRFieldDef edc:cname="TSW" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound"/>
            <edc:SFRFieldDef edc:cname="MRAF" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure"/>
            <edc:SFRFieldDef edc:cname="TOO" edc:nzwidth="0x1" edc:desc="Timeout Occurred"/>
            <edc:SFRFieldDef edc:cname="DRX" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Receive Buffer"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELO" edc:nzwidth="0x1" edc:desc="Error Logging Overflow"/>
            <edc:SFRFieldDef edc:cname="EP" edc:nzwidth="0x1" edc:desc="Error Passive"/>
            <edc:SFRFieldDef edc:cname="EW" edc:nzwidth="0x1" edc:desc="Warning Status"/>
            <edc:SFRFieldDef edc:cname="BO" edc:nzwidth="0x1" edc:desc="Bus_Off Status"/>
            <edc:SFRFieldDef edc:cname="WDI" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEA" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase"/>
            <edc:SFRFieldDef edc:cname="PED" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase"/>
            <edc:SFRFieldDef edc:cname="ARA" edc:nzwidth="0x1" edc:desc="Access to Reserved Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_IE" edc:nzwidth="0x20" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FCFFFFF" edc:_addr="0x40030054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="RF0NE" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 New Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0WE" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0FE" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF0LE" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Message Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1NE" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 New Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1WE" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1FE" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RF1LE" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Message Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HPME" edc:nzwidth="0x1" edc:desc="High Priority Message Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCE" edc:nzwidth="0x1" edc:desc="Transmission Completed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TCFE" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TFEE" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFNE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFWE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFFE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TEFLE" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Event Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TSWE" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MRAFE" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TOOE" edc:nzwidth="0x1" edc:desc="Timeout Occurred Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DRXE" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Receive Buffer Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELOE" edc:nzwidth="0x1" edc:desc="Error Logging Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EPE" edc:nzwidth="0x1" edc:desc="Error Passive Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EWE" edc:nzwidth="0x1" edc:desc="Warning Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BOE" edc:nzwidth="0x1" edc:desc="Bus_Off Status Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WDIE" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEAE" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase Enable"/>
            <edc:SFRFieldDef edc:cname="PEDE" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase Enable"/>
            <edc:SFRFieldDef edc:cname="ARAE" edc:nzwidth="0x1" edc:desc="Access to Reserved Address Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_ILS" edc:nzwidth="0x20" edc:access="--nnnnnnnn--nnnnnnnnnnnnnnnnnnnn" edc:impl="0x3FCFFFFF" edc:_addr="0x40030058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="RF0NL" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 New Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0WL" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0FL" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF0LL" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Message Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1NL" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 New Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1WL" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1FL" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="RF1LL" edc:nzwidth="0x1" edc:desc="Receive FIFO 1 Message Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="HPML" edc:nzwidth="0x1" edc:desc="High Priority Message Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TCL" edc:nzwidth="0x1" edc:desc="Transmission Completed Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TCFL" edc:nzwidth="0x1" edc:desc="Transmission Cancellation Finished Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TFEL" edc:nzwidth="0x1" edc:desc="Tx FIFO Empty Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFNL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO New Entry Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFWL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Watermark Reached Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFFL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Full Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TEFLL" edc:nzwidth="0x1" edc:desc="Tx Event FIFO Event Lost Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TSWL" edc:nzwidth="0x1" edc:desc="Timestamp Wraparound Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="MRAFL" edc:nzwidth="0x1" edc:desc="Message RAM Access Failure Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="TOOL" edc:nzwidth="0x1" edc:desc="Timeout Occurred Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="DRXL" edc:nzwidth="0x1" edc:desc="Message stored to Dedicated Receive Buffer Interrupt Line"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ELOL" edc:nzwidth="0x1" edc:desc="Error Logging Overflow Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="EPL" edc:nzwidth="0x1" edc:desc="Error Passive Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="EWL" edc:nzwidth="0x1" edc:desc="Warning Status Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="BOL" edc:nzwidth="0x1" edc:desc="Bus_Off Status Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="WDIL" edc:nzwidth="0x1" edc:desc="Watchdog Interrupt Line"/>
            <edc:SFRFieldDef edc:cname="PEAL" edc:nzwidth="0x1" edc:desc="Protocol Error in Arbitration Phase Line"/>
            <edc:SFRFieldDef edc:cname="PEDL" edc:nzwidth="0x1" edc:desc="Protocol Error in Data Phase Line"/>
            <edc:SFRFieldDef edc:cname="ARAL" edc:nzwidth="0x1" edc:desc="Access to Reserved Address Line"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_ILE" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x4003005C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="EINT0" edc:nzwidth="0x1" edc:desc="Enable Interrupt Line 0"/>
            <edc:SFRFieldDef edc:cname="EINT1" edc:nzwidth="0x1" edc:desc="Enable Interrupt Line 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x40030060"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_GFC" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:impl="0x3F" edc:_addr="0x40030080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:SFRFieldDef edc:cname="RRFE" edc:nzwidth="0x1" edc:desc="Reject Remote Frames Extended">
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Filter remote frames with 29-bit extended IDs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject all remote frames with 29-bit extended IDs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRFS" edc:nzwidth="0x1" edc:desc="Reject Remote Frames Standard">
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Filter remote frames with 11-bit standard IDs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject all remote frames with 11-bit standard IDs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ANFE" edc:nzwidth="0x2" edc:desc="Accept Non-matching Frames Extended">
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ANFS" edc:nzwidth="0x2" edc:desc="Accept Non-matching Frames Standard">
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_SIDFC" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnn--" edc:impl="0xFFFFFC" edc:_addr="0x40030084">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLSSA" edc:nzwidth="0xE" edc:desc="Filter List Standard Start Address"/>
            <edc:SFRFieldDef edc:cname="LSS" edc:nzwidth="0x8" edc:desc="List Size Standard"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN0" edc:cname="MCAN0_XIDFC" edc:nzwidth="0x20" edc:access="---------nnnnnnnnnnnnnnnnnnnnn--" edc:impl="0x7FFFFC" edc:_addr="0x40030088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLESA" edc:nzwidth="0xE" edc:desc="Filter List Extended Start Address"/>
            <edc:SFRFieldDef edc:cname="LSE" edc:nzwidth="0x7" edc:desc="List Size Extended"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
