Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_ILE" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x4003405C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="EINT0" edc:nzwidth="0x1" edc:desc="Enable Interrupt Line 0"/>
            <edc:SFRFieldDef edc:cname="EINT1" edc:nzwidth="0x1" edc:desc="Enable Interrupt Line 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x20" edc:_addr="0x40034060"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_GFC" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:impl="0x3F" edc:_addr="0x40034080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="RRFE" edc:nzwidth="0x1" edc:desc="Reject Remote Frames Extended">
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Filter remote frames with 29-bit extended IDs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject all remote frames with 29-bit extended IDs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RRFS" edc:nzwidth="0x1" edc:desc="Reject Remote Frames Standard">
              <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Filter remote frames with 11-bit standard IDs." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="REJECT" edc:desc="Reject all remote frames with 11-bit standard IDs." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ANFE" edc:nzwidth="0x2" edc:desc="Accept Non-matching Frames Extended">
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ANFS" edc:nzwidth="0x2" edc:desc="Accept Non-matching Frames Standard">
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_0" edc:desc="Accept in Rx FIFO 0" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RX_FIFO_1" edc:desc="Accept in Rx FIFO 1" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_SIDFC" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnn--" edc:impl="0xFFFFFC" edc:_addr="0x40034084">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLSSA" edc:nzwidth="0xE" edc:desc="Filter List Standard Start Address"/>
            <edc:SFRFieldDef edc:cname="LSS" edc:nzwidth="0x8" edc:desc="List Size Standard"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_XIDFC" edc:nzwidth="0x20" edc:access="---------nnnnnnnnnnnnnnnnnnnnn--" edc:impl="0x7FFFFC" edc:_addr="0x40034088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FLESA" edc:nzwidth="0xE" edc:desc="Filter List Extended Start Address"/>
            <edc:SFRFieldDef edc:cname="LSE" edc:nzwidth="0x7" edc:desc="List Size Extended"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4003408C"/>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_XIDAM" edc:nzwidth="0x20" edc:access="---nnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0x1FFFFFFF" edc:_addr="0x40034090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="EIDM" edc:nzwidth="0x1D" edc:desc="Extended ID Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_HPMS" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40034094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="BIDX" edc:nzwidth="0x6" edc:desc="Buffer Index"/>
            <edc:SFRFieldDef edc:cname="MSI" edc:nzwidth="0x2" edc:desc="Message Storage Indicator">
              <edc:SFRFieldSemantic edc:cname="NO_FIFO_SEL" edc:desc="No FIFO selected." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOST" edc:desc="FIFO message lost." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FIFO_0" edc:desc="Message stored in FIFO 0." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FIFO_1" edc:desc="Message stored in FIFO 1." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="FIDX" edc:nzwidth="0x7" edc:desc="Filter Index"/>
            <edc:SFRFieldDef edc:cname="FLST" edc:nzwidth="0x1" edc:desc="Filter List"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_NDAT1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40034098">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="ND0" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND1" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND2" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND3" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND4" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND5" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND6" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND7" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND8" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND9" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND10" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND11" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND12" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND13" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND14" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND15" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND16" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND17" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND18" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND19" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND20" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND21" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND22" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND23" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND24" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND25" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND26" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND27" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND28" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND29" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND30" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND31" edc:nzwidth="0x1" edc:desc="New Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_NDAT2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4003409C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="ND32" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND33" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND34" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND35" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND36" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND37" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND38" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND39" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND40" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND41" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND42" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND43" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND44" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND45" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND46" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND47" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND48" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND49" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND50" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND51" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND52" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND53" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND54" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND55" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND56" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND57" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND58" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND59" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND60" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND61" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND62" edc:nzwidth="0x1" edc:desc="New Data"/>
            <edc:SFRFieldDef edc:cname="ND63" edc:nzwidth="0x1" edc:desc="New Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_RXF0C" edc:nzwidth="0x20" edc:access="nnnnnnnn-nnnnnnnnnnnnnnnnnnnnn--" edc:impl="0xFF7FFFFC" edc:_addr="0x400340A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0SA" edc:nzwidth="0xE" edc:desc="Receive FIFO 0 Start Address"/>
            <edc:SFRFieldDef edc:cname="F0S" edc:nzwidth="0x7" edc:desc="Receive FIFO 0 Start Address"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F0WM" edc:nzwidth="0x7" edc:desc="Receive FIFO 0 Watermark"/>
            <edc:SFRFieldDef edc:cname="F0OM" edc:nzwidth="0x1" edc:desc="FIFO 0 Operation Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_RXF0S" edc:nzwidth="0x20" edc:access="------rr--rrrrrr--rrrrrr-rrrrrrr" edc:impl="0x33F3F7F" edc:_addr="0x400340A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="F0FL" edc:nzwidth="0x7" edc:desc="Receive FIFO 0 Fill Level"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="F0GI" edc:nzwidth="0x6" edc:desc="Receive FIFO 0 Get Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0PI" edc:nzwidth="0x6" edc:desc="Receive FIFO 0 Put Index"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="F0F" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Fill Level"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:nzwidth="0x1" edc:desc="Receive FIFO 0 Message Lost"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_RXF0A" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:impl="0x3F" edc:_addr="0x400340A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:SFRFieldDef edc:cname="F0AI" edc:nzwidth="0x6" edc:desc="Receive FIFO 0 Acknowledge Index"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MCAN1" edc:cname="MCAN1_RXBC" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnn--" edc:impl="0xFFFC" edc:_addr="0x400340AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCAN1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RBSA" edc:nzwidth="0xE" edc:desc="Receive Buffer Start Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
