Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTCFG7" edc:nzwidth="0x20" edc:access="-----------------nnnn-nn-nnnnnn-" edc:impl="0x7B7E" edc:_addr="0x4003811C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1" edc:desc="Endpoint Memory Allocate"/>
            <edc:SFRFieldDef edc:cname="EPBK" edc:nzwidth="0x2" edc:desc="Endpoint Banks">
              <edc:SFRFieldSemantic edc:cname="1_BANK" edc:desc="Single-bank endpoint" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2_BANK" edc:desc="Double-bank endpoint" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="3_BANK" edc:desc="Triple-bank endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EPSIZE" edc:nzwidth="0x3" edc:desc="Endpoint Size">
              <edc:SFRFieldSemantic edc:cname="8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDIR" edc:nzwidth="0x1" edc:desc="Endpoint Direction">
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="The endpoint direction is OUT." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="The endpoint direction is IN (nor for control endpoints)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:nzwidth="0x1" edc:desc="Automatic Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:nzwidth="0x2" edc:desc="Endpoint Type">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBTRANS" edc:nzwidth="0x2" edc:desc="Number of transactions per microframe for isochronous endpoint">
              <edc:SFRFieldSemantic edc:cname="_0_TRANS" edc:desc="Reserved to endpoint that does not have the high-bandwidth isochronous capability." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_TRANS" edc:desc="Default value: one transaction per microframe." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_TRANS" edc:desc="Two transactions per microframe. This endpoint should be configured as double-bank." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_TRANS" edc:desc="Three transactions per microframe. This endpoint should be configured as triple-bank." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTCFG8" edc:nzwidth="0x20" edc:access="-----------------nnnn-nn-nnnnnn-" edc:impl="0x7B7E" edc:_addr="0x40038120">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1" edc:desc="Endpoint Memory Allocate"/>
            <edc:SFRFieldDef edc:cname="EPBK" edc:nzwidth="0x2" edc:desc="Endpoint Banks">
              <edc:SFRFieldSemantic edc:cname="1_BANK" edc:desc="Single-bank endpoint" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2_BANK" edc:desc="Double-bank endpoint" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="3_BANK" edc:desc="Triple-bank endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EPSIZE" edc:nzwidth="0x3" edc:desc="Endpoint Size">
              <edc:SFRFieldSemantic edc:cname="8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDIR" edc:nzwidth="0x1" edc:desc="Endpoint Direction">
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="The endpoint direction is OUT." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="The endpoint direction is IN (nor for control endpoints)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:nzwidth="0x1" edc:desc="Automatic Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:nzwidth="0x2" edc:desc="Endpoint Type">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBTRANS" edc:nzwidth="0x2" edc:desc="Number of transactions per microframe for isochronous endpoint">
              <edc:SFRFieldSemantic edc:cname="_0_TRANS" edc:desc="Reserved to endpoint that does not have the high-bandwidth isochronous capability." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_TRANS" edc:desc="Default value: one transaction per microframe." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_TRANS" edc:desc="Two transactions per microframe. This endpoint should be configured as double-bank." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_TRANS" edc:desc="Three transactions per microframe. This endpoint should be configured as triple-bank." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTCFG9" edc:nzwidth="0x20" edc:access="-----------------nnnn-nn-nnnnnn-" edc:impl="0x7B7E" edc:_addr="0x40038124">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1" edc:desc="Endpoint Memory Allocate"/>
            <edc:SFRFieldDef edc:cname="EPBK" edc:nzwidth="0x2" edc:desc="Endpoint Banks">
              <edc:SFRFieldSemantic edc:cname="1_BANK" edc:desc="Single-bank endpoint" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2_BANK" edc:desc="Double-bank endpoint" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="3_BANK" edc:desc="Triple-bank endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EPSIZE" edc:nzwidth="0x3" edc:desc="Endpoint Size">
              <edc:SFRFieldSemantic edc:cname="8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDIR" edc:nzwidth="0x1" edc:desc="Endpoint Direction">
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="The endpoint direction is OUT." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="The endpoint direction is IN (nor for control endpoints)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:nzwidth="0x1" edc:desc="Automatic Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPTYPE" edc:nzwidth="0x2" edc:desc="Endpoint Type">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBTRANS" edc:nzwidth="0x2" edc:desc="Number of transactions per microframe for isochronous endpoint">
              <edc:SFRFieldSemantic edc:cname="_0_TRANS" edc:desc="Reserved to endpoint that does not have the high-bandwidth isochronous capability." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_TRANS" edc:desc="Default value: one transaction per microframe." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_TRANS" edc:desc="Two transactions per microframe. This endpoint should be configured as double-bank." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_TRANS" edc:desc="Three transactions per microframe. This endpoint should be configured as triple-bank." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40038128"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTISR0" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-rrrrrrr-rrrrrrrrrrr" edc:impl="0x7FF7F7FF" edc:_addr="0x40038130">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINI" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ERRORTRANS" edc:nzwidth="0x1" edc:desc="High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:nzwidth="0x1" edc:desc="Control Direction"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:nzwidth="0xB" edc:desc="Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTISR1" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-rrrrrrr-rrrrrrrrrrr" edc:impl="0x7FF7F7FF" edc:_addr="0x40038134">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINI" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ERRORTRANS" edc:nzwidth="0x1" edc:desc="High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:nzwidth="0x1" edc:desc="Control Direction"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:nzwidth="0xB" edc:desc="Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTISR2" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-rrrrrrr-rrrrrrrrrrr" edc:impl="0x7FF7F7FF" edc:_addr="0x40038138">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINI" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXOUTI" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHI" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKET" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DATA2" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MDATA" edc:desc="Reserved for high-bandwidth isochronous endpoint" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ERRORTRANS" edc:nzwidth="0x1" edc:desc="High-bandwidth Isochronous OUT Endpoint Transaction Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:SFRFieldDef edc:cname="CTRLDIR" edc:nzwidth="0x1" edc:desc="Control Direction"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BYCT" edc:nzwidth="0xB" edc:desc="Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
