Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIFR2" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x40038198">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIFR3" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x4003819C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIFR4" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x400381A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIFR5" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x400381A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIFR6" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x400381A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIFR7" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x400381AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIFR8" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x400381B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIFR9" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x400381B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINIS" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RXOUTIS" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHIS" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
