Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400381B8"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIMR0" edc:nzwidth="0x20" edc:access="------------rrrr-rrr-rrrrrrrrrrr" edc:impl="0xF77FF" edc:_addr="0x400381C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINE" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRE" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHE" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="MDATAE" edc:nzwidth="0x1" edc:desc="MData Interrupt"/>
            <edc:SFRFieldDef edc:cname="DATAXE" edc:nzwidth="0x1" edc:desc="DataX Interrupt"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSE" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:nzwidth="0x1" edc:desc="NYET Token Disable"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:nzwidth="0x1" edc:desc="STALL Request"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIMR1" edc:nzwidth="0x20" edc:access="------------rrrr-rrr-rrrrrrrrrrr" edc:impl="0xF77FF" edc:_addr="0x400381C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINE" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRE" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHE" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="MDATAE" edc:nzwidth="0x1" edc:desc="MData Interrupt"/>
            <edc:SFRFieldDef edc:cname="DATAXE" edc:nzwidth="0x1" edc:desc="DataX Interrupt"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSE" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:nzwidth="0x1" edc:desc="NYET Token Disable"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:nzwidth="0x1" edc:desc="STALL Request"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIMR2" edc:nzwidth="0x20" edc:access="------------rrrr-rrr-rrrrrrrrrrr" edc:impl="0xF77FF" edc:_addr="0x400381C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINE" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXOUTE" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRE" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHE" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="MDATAE" edc:nzwidth="0x1" edc:desc="MData Interrupt"/>
            <edc:SFRFieldDef edc:cname="DATAXE" edc:nzwidth="0x1" edc:desc="DataX Interrupt"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSE" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt"/>
            <edc:SFRFieldDef edc:cname="KILLBK" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMA" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request"/>
            <edc:SFRFieldDef edc:cname="NYETDIS" edc:nzwidth="0x1" edc:desc="NYET Token Disable"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
            <edc:SFRFieldDef edc:cname="STALLRQ" edc:nzwidth="0x1" edc:desc="STALL Request"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
