Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIER5" edc:nzwidth="0x20" edc:access="------------wwww-www-wwwwwwwwwww" edc:impl="0xF77FF" edc:_addr="0x40038204">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINES" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:nzwidth="0x1" edc:desc="MData Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:nzwidth="0x1" edc:desc="DataX Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:nzwidth="0x1" edc:desc="NYET Token Disable Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:nzwidth="0x1" edc:desc="STALL Request Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIER6" edc:nzwidth="0x20" edc:access="------------wwww-www-wwwwwwwwwww" edc:impl="0xF77FF" edc:_addr="0x40038208">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINES" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:nzwidth="0x1" edc:desc="MData Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:nzwidth="0x1" edc:desc="DataX Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:nzwidth="0x1" edc:desc="NYET Token Disable Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:nzwidth="0x1" edc:desc="STALL Request Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIER7" edc:nzwidth="0x20" edc:access="------------wwww-www-wwwwwwwwwww" edc:impl="0xF77FF" edc:_addr="0x4003820C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINES" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:nzwidth="0x1" edc:desc="MData Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:nzwidth="0x1" edc:desc="DataX Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:nzwidth="0x1" edc:desc="NYET Token Disable Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:nzwidth="0x1" edc:desc="STALL Request Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIER8" edc:nzwidth="0x20" edc:access="------------wwww-www-wwwwwwwwwww" edc:impl="0xF77FF" edc:_addr="0x40038210">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINES" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:nzwidth="0x1" edc:desc="MData Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:nzwidth="0x1" edc:desc="DataX Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:nzwidth="0x1" edc:desc="NYET Token Disable Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:nzwidth="0x1" edc:desc="STALL Request Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIER9" edc:nzwidth="0x20" edc:access="------------wwww-www-wwwwwwwwwww" edc:impl="0xF77FF" edc:_addr="0x40038214">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINES" edc:nzwidth="0x1" edc:desc="Transmitted IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOUTES" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOINERRES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHES" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MDATAES" edc:nzwidth="0x1" edc:desc="MData Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DATAXES" edc:nzwidth="0x1" edc:desc="DataX Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSES" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="KILLBKS" edc:nzwidth="0x1" edc:desc="Kill IN Bank"/>
            <edc:SFRFieldDef edc:cname="FIFOCONS" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAS" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="NYETDISS" edc:nzwidth="0x1" edc:desc="NYET Token Disable Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
            <edc:SFRFieldDef edc:cname="STALLRQS" edc:nzwidth="0x1" edc:desc="STALL Request Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40038218"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIDR0" edc:nzwidth="0x20" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:impl="0xB57FF" edc:_addr="0x40038220">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:nzwidth="0x1" edc:desc="Transmitted IN Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:nzwidth="0x1" edc:desc="STALLed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:nzwidth="0x1" edc:desc="Shortpacket Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:nzwidth="0x1" edc:desc="MData Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:nzwidth="0x1" edc:desc="DataX Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Clear"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:nzwidth="0x1" edc:desc="NYET Token Disable Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:nzwidth="0x1" edc:desc="STALL Request Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIDR1" edc:nzwidth="0x20" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:impl="0xB57FF" edc:_addr="0x40038224">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:nzwidth="0x1" edc:desc="Transmitted IN Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:nzwidth="0x1" edc:desc="STALLed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:nzwidth="0x1" edc:desc="Shortpacket Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:nzwidth="0x1" edc:desc="MData Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:nzwidth="0x1" edc:desc="DataX Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Clear"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:nzwidth="0x1" edc:desc="NYET Token Disable Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:nzwidth="0x1" edc:desc="STALL Request Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIDR2" edc:nzwidth="0x20" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:impl="0xB57FF" edc:_addr="0x40038228">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:nzwidth="0x1" edc:desc="Transmitted IN Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:nzwidth="0x1" edc:desc="STALLed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:nzwidth="0x1" edc:desc="Shortpacket Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:nzwidth="0x1" edc:desc="MData Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:nzwidth="0x1" edc:desc="DataX Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Clear"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:nzwidth="0x1" edc:desc="NYET Token Disable Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:nzwidth="0x1" edc:desc="STALL Request Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIDR3" edc:nzwidth="0x20" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:impl="0xB57FF" edc:_addr="0x4003822C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:nzwidth="0x1" edc:desc="Transmitted IN Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:nzwidth="0x1" edc:desc="STALLed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:nzwidth="0x1" edc:desc="Shortpacket Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:nzwidth="0x1" edc:desc="MData Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:nzwidth="0x1" edc:desc="DataX Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Clear"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:nzwidth="0x1" edc:desc="NYET Token Disable Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:nzwidth="0x1" edc:desc="STALL Request Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
