Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIDR8" edc:nzwidth="0x20" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:impl="0xB57FF" edc:_addr="0x40038240">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:nzwidth="0x1" edc:desc="Transmitted IN Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:nzwidth="0x1" edc:desc="STALLed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:nzwidth="0x1" edc:desc="Shortpacket Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:nzwidth="0x1" edc:desc="MData Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:nzwidth="0x1" edc:desc="DataX Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Clear"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:nzwidth="0x1" edc:desc="NYET Token Disable Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:nzwidth="0x1" edc:desc="STALL Request Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVEPTIDR9" edc:nzwidth="0x20" edc:access="------------w-ww-w-w-wwwwwwwwwww" edc:impl="0xB57FF" edc:_addr="0x40038244">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="TXINEC" edc:nzwidth="0x1" edc:desc="Transmitted IN Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXOUTEC" edc:nzwidth="0x1" edc:desc="Received OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOINERREC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Underflow Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HBISOFLUSHEC" edc:nzwidth="0x1" edc:desc="High Bandwidth Isochronous IN Flush Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="STALLEDEC" edc:nzwidth="0x1" edc:desc="STALLed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETEC" edc:nzwidth="0x1" edc:desc="Shortpacket Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="MDATAEC" edc:nzwidth="0x1" edc:desc="MData Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="DATAXEC" edc:nzwidth="0x1" edc:desc="DataX Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="ERRORTRANSEC" edc:nzwidth="0x1" edc:desc="Transaction Error Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EPDISHDMAC" edc:nzwidth="0x1" edc:desc="Endpoint Interrupts Disable HDMA Request Clear"/>
            <edc:SFRFieldDef edc:cname="NYETDISC" edc:nzwidth="0x1" edc:desc="NYET Token Disable Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="STALLRQC" edc:nzwidth="0x1" edc:desc="STALL Request Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC8" edc:_addr="0x40038248"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA0USBHS_DEVDMANXTDSC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038310">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:nzwidth="0x20" edc:desc="Next Descriptor Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA0USBHS_DEVDMAADDRESS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038314">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:nzwidth="0x20" edc:desc="Buffer Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA0USBHS_DEVDMACONTROL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:impl="0xFFFF00FF" edc:_addr="0x40038318">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Command"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:nzwidth="0x1" edc:desc="Load Next Channel Transfer Descriptor Enable Command"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:nzwidth="0x1" edc:desc="End of Transfer Enable Control (OUT transfers only)"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:nzwidth="0x1" edc:desc="End of Buffer Enable Control"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:nzwidth="0x1" edc:desc="End of Transfer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:nzwidth="0x1" edc:desc="End of Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:nzwidth="0x1" edc:desc="Burst Lock Enable"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:nzwidth="0x10" edc:desc="Buffer Byte Length (Write-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA0USBHS_DEVDMASTATUS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:impl="0xFFFF0073" edc:_addr="0x4003831C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Status"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:nzwidth="0x1" edc:desc="Channel Active Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:nzwidth="0x1" edc:desc="End of Channel Transfer Status"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:nzwidth="0x1" edc:desc="End of Channel Buffer Status"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Status"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:nzwidth="0x10" edc:desc="Buffer Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA1USBHS_DEVDMANXTDSC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038320">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:nzwidth="0x20" edc:desc="Next Descriptor Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA1USBHS_DEVDMAADDRESS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038324">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:nzwidth="0x20" edc:desc="Buffer Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA1USBHS_DEVDMACONTROL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:impl="0xFFFF00FF" edc:_addr="0x40038328">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Command"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:nzwidth="0x1" edc:desc="Load Next Channel Transfer Descriptor Enable Command"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:nzwidth="0x1" edc:desc="End of Transfer Enable Control (OUT transfers only)"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:nzwidth="0x1" edc:desc="End of Buffer Enable Control"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:nzwidth="0x1" edc:desc="End of Transfer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:nzwidth="0x1" edc:desc="End of Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:nzwidth="0x1" edc:desc="Burst Lock Enable"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:nzwidth="0x10" edc:desc="Buffer Byte Length (Write-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA1USBHS_DEVDMASTATUS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:impl="0xFFFF0073" edc:_addr="0x4003832C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Status"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:nzwidth="0x1" edc:desc="Channel Active Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:nzwidth="0x1" edc:desc="End of Channel Transfer Status"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:nzwidth="0x1" edc:desc="End of Channel Buffer Status"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Status"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:nzwidth="0x10" edc:desc="Buffer Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA2USBHS_DEVDMANXTDSC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038330">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:nzwidth="0x20" edc:desc="Next Descriptor Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA2USBHS_DEVDMAADDRESS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038334">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:nzwidth="0x20" edc:desc="Buffer Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
