Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA5USBHS_DEVDMASTATUS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:impl="0xFFFF0073" edc:_addr="0x4003836C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Status"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:nzwidth="0x1" edc:desc="Channel Active Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:nzwidth="0x1" edc:desc="End of Channel Transfer Status"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:nzwidth="0x1" edc:desc="End of Channel Buffer Status"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Status"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:nzwidth="0x10" edc:desc="Buffer Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA6USBHS_DEVDMANXTDSC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038370">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:nzwidth="0x20" edc:desc="Next Descriptor Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA6USBHS_DEVDMAADDRESS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038374">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:nzwidth="0x20" edc:desc="Buffer Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA6USBHS_DEVDMACONTROL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:impl="0xFFFF00FF" edc:_addr="0x40038378">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Command"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:nzwidth="0x1" edc:desc="Load Next Channel Transfer Descriptor Enable Command"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:nzwidth="0x1" edc:desc="End of Transfer Enable Control (OUT transfers only)"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:nzwidth="0x1" edc:desc="End of Buffer Enable Control"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:nzwidth="0x1" edc:desc="End of Transfer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:nzwidth="0x1" edc:desc="End of Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:nzwidth="0x1" edc:desc="Burst Lock Enable"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:nzwidth="0x10" edc:desc="Buffer Byte Length (Write-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_DEVDMA6USBHS_DEVDMASTATUS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:impl="0xFFFF0073" edc:_addr="0x4003837C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Status"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:nzwidth="0x1" edc:desc="Channel Active Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:nzwidth="0x1" edc:desc="End of Channel Transfer Status"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:nzwidth="0x1" edc:desc="End of Channel Buffer Status"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Status"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:nzwidth="0x10" edc:desc="Buffer Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x80" edc:_addr="0x40038380"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTCTRL" edc:nzwidth="0x20" edc:access="------------------nn-nnn--------" edc:impl="0x3700" edc:_addr="0x40038400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SOFE" edc:nzwidth="0x1" edc:desc="Start of Frame Generation Enable"/>
            <edc:SFRFieldDef edc:cname="RESET" edc:nzwidth="0x1" edc:desc="Send USB Reset"/>
            <edc:SFRFieldDef edc:cname="RESUME" edc:nzwidth="0x1" edc:desc="Send USB Resume"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SPDCONF" edc:nzwidth="0x2" edc:desc="Mode Configuration">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="The host starts in Full-speed mode and performs a high-speed reset to switch to High-speed mode if the downstream peripheral is high-speed capable." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LOW_POWER" edc:desc="For a better consumption, if high speed is not needed." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_SPEED" edc:desc="Forced high speed." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="FORCED_FS" edc:desc="The host remains in Full-speed mode whatever the peripheral speed capability." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTISR" edc:nzwidth="0x20" edc:access="rrrrrrr-------rrrrrrrrrr-rrrrrrr" edc:impl="0xFE03FF7F" edc:_addr="0x40038404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DCONNI" edc:nzwidth="0x1" edc:desc="Device Connection Interrupt"/>
            <edc:SFRFieldDef edc:cname="DDISCI" edc:nzwidth="0x1" edc:desc="Device Disconnection Interrupt"/>
            <edc:SFRFieldDef edc:cname="RSTI" edc:nzwidth="0x1" edc:desc="USB Reset Sent Interrupt"/>
            <edc:SFRFieldDef edc:cname="RSMEDI" edc:nzwidth="0x1" edc:desc="Downstream Resume Sent Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXRSMI" edc:nzwidth="0x1" edc:desc="Upstream Resume Received Interrupt"/>
            <edc:SFRFieldDef edc:cname="HSOFI" edc:nzwidth="0x1" edc:desc="Host Start of Frame Interrupt"/>
            <edc:SFRFieldDef edc:cname="HWUPI" edc:nzwidth="0x1" edc:desc="Host Wake-Up Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:nzwidth="0x1" edc:desc="Pipe 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:nzwidth="0x1" edc:desc="Pipe 1 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:nzwidth="0x1" edc:desc="Pipe 2 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:nzwidth="0x1" edc:desc="Pipe 3 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:nzwidth="0x1" edc:desc="Pipe 4 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:nzwidth="0x1" edc:desc="Pipe 5 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:nzwidth="0x1" edc:desc="Pipe 6 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:nzwidth="0x1" edc:desc="Pipe 7 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:nzwidth="0x1" edc:desc="Pipe 8 Interrupt"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:nzwidth="0x1" edc:desc="Pipe 9 Interrupt"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:nzwidth="0x1" edc:desc="DMA Channel 0 Interrupt"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:nzwidth="0x1" edc:desc="DMA Channel 1 Interrupt"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:nzwidth="0x1" edc:desc="DMA Channel 2 Interrupt"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:nzwidth="0x1" edc:desc="DMA Channel 3 Interrupt"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:nzwidth="0x1" edc:desc="DMA Channel 4 Interrupt"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:nzwidth="0x1" edc:desc="DMA Channel 5 Interrupt"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:nzwidth="0x1" edc:desc="DMA Channel 6 Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTICR" edc:nzwidth="0x20" edc:access="-------------------------wwwwwww" edc:impl="0x7F" edc:_addr="0x40038408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DCONNIC" edc:nzwidth="0x1" edc:desc="Device Connection Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="DDISCIC" edc:nzwidth="0x1" edc:desc="Device Disconnection Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RSTIC" edc:nzwidth="0x1" edc:desc="USB Reset Sent Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RSMEDIC" edc:nzwidth="0x1" edc:desc="Downstream Resume Sent Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="RXRSMIC" edc:nzwidth="0x1" edc:desc="Upstream Resume Received Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HSOFIC" edc:nzwidth="0x1" edc:desc="Host Start of Frame Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="HWUPIC" edc:nzwidth="0x1" edc:desc="Host Wake-Up Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTIFR" edc:nzwidth="0x20" edc:access="wwwwwww------------------wwwwwww" edc:impl="0xFE00007F" edc:_addr="0x4003840C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DCONNIS" edc:nzwidth="0x1" edc:desc="Device Connection Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DDISCIS" edc:nzwidth="0x1" edc:desc="Device Disconnection Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RSTIS" edc:nzwidth="0x1" edc:desc="USB Reset Sent Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RSMEDIS" edc:nzwidth="0x1" edc:desc="Downstream Resume Sent Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="RXRSMIS" edc:nzwidth="0x1" edc:desc="Upstream Resume Received Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HSOFIS" edc:nzwidth="0x1" edc:desc="Host Start of Frame Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="HWUPIS" edc:nzwidth="0x1" edc:desc="Host Wake-Up Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:nzwidth="0x1" edc:desc="DMA Channel 0 Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:nzwidth="0x1" edc:desc="DMA Channel 1 Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:nzwidth="0x1" edc:desc="DMA Channel 2 Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:nzwidth="0x1" edc:desc="DMA Channel 3 Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:nzwidth="0x1" edc:desc="DMA Channel 4 Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:nzwidth="0x1" edc:desc="DMA Channel 5 Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:nzwidth="0x1" edc:desc="DMA Channel 6 Interrupt Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTIMR" edc:nzwidth="0x20" edc:access="rrrrrrr-------rrrrrrrrrr-rrrrrrr" edc:impl="0xFE03FF7F" edc:_addr="0x40038410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DCONNIE" edc:nzwidth="0x1" edc:desc="Device Connection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DDISCIE" edc:nzwidth="0x1" edc:desc="Device Disconnection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RSTIE" edc:nzwidth="0x1" edc:desc="USB Reset Sent Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RSMEDIE" edc:nzwidth="0x1" edc:desc="Downstream Resume Sent Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXRSMIE" edc:nzwidth="0x1" edc:desc="Upstream Resume Received Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HSOFIE" edc:nzwidth="0x1" edc:desc="Host Start of Frame Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HWUPIE" edc:nzwidth="0x1" edc:desc="Host Wake-Up Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:nzwidth="0x1" edc:desc="Pipe 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:nzwidth="0x1" edc:desc="Pipe 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:nzwidth="0x1" edc:desc="Pipe 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:nzwidth="0x1" edc:desc="Pipe 3 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:nzwidth="0x1" edc:desc="Pipe 4 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:nzwidth="0x1" edc:desc="Pipe 5 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:nzwidth="0x1" edc:desc="Pipe 6 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:nzwidth="0x1" edc:desc="Pipe 7 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:nzwidth="0x1" edc:desc="Pipe 8 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:nzwidth="0x1" edc:desc="Pipe 9 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:nzwidth="0x1" edc:desc="DMA Channel 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:nzwidth="0x1" edc:desc="DMA Channel 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:nzwidth="0x1" edc:desc="DMA Channel 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:nzwidth="0x1" edc:desc="DMA Channel 3 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:nzwidth="0x1" edc:desc="DMA Channel 4 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:nzwidth="0x1" edc:desc="DMA Channel 5 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:nzwidth="0x1" edc:desc="DMA Channel 6 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTIDR" edc:nzwidth="0x20" edc:access="wwwwwww-------wwwwwwwwww-wwwwwww" edc:impl="0xFE03FF7F" edc:_addr="0x40038414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DCONNIEC" edc:nzwidth="0x1" edc:desc="Device Connection Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DDISCIEC" edc:nzwidth="0x1" edc:desc="Device Disconnection Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RSTIEC" edc:nzwidth="0x1" edc:desc="USB Reset Sent Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RSMEDIEC" edc:nzwidth="0x1" edc:desc="Downstream Resume Sent Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXRSMIEC" edc:nzwidth="0x1" edc:desc="Upstream Resume Received Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="HSOFIEC" edc:nzwidth="0x1" edc:desc="Host Start of Frame Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="HWUPIEC" edc:nzwidth="0x1" edc:desc="Host Wake-Up Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:nzwidth="0x1" edc:desc="Pipe 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:nzwidth="0x1" edc:desc="Pipe 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:nzwidth="0x1" edc:desc="Pipe 2 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:nzwidth="0x1" edc:desc="Pipe 3 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:nzwidth="0x1" edc:desc="Pipe 4 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:nzwidth="0x1" edc:desc="Pipe 5 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:nzwidth="0x1" edc:desc="Pipe 6 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:nzwidth="0x1" edc:desc="Pipe 7 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:nzwidth="0x1" edc:desc="Pipe 8 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:nzwidth="0x1" edc:desc="Pipe 9 Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:nzwidth="0x1" edc:desc="DMA Channel 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:nzwidth="0x1" edc:desc="DMA Channel 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:nzwidth="0x1" edc:desc="DMA Channel 2 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:nzwidth="0x1" edc:desc="DMA Channel 3 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:nzwidth="0x1" edc:desc="DMA Channel 4 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:nzwidth="0x1" edc:desc="DMA Channel 5 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:nzwidth="0x1" edc:desc="DMA Channel 6 Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTIER" edc:nzwidth="0x20" edc:access="wwwwwww-------wwwwwwwwww-wwwwwww" edc:impl="0xFE03FF7F" edc:_addr="0x40038418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="DCONNIES" edc:nzwidth="0x1" edc:desc="Device Connection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DDISCIES" edc:nzwidth="0x1" edc:desc="Device Disconnection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RSTIES" edc:nzwidth="0x1" edc:desc="USB Reset Sent Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RSMEDIES" edc:nzwidth="0x1" edc:desc="Downstream Resume Sent Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXRSMIES" edc:nzwidth="0x1" edc:desc="Upstream Resume Received Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HSOFIES" edc:nzwidth="0x1" edc:desc="Host Start of Frame Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="HWUPIES" edc:nzwidth="0x1" edc:desc="Host Wake-Up Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PEP_0" edc:nzwidth="0x1" edc:desc="Pipe 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_1" edc:nzwidth="0x1" edc:desc="Pipe 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_2" edc:nzwidth="0x1" edc:desc="Pipe 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_3" edc:nzwidth="0x1" edc:desc="Pipe 3 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_4" edc:nzwidth="0x1" edc:desc="Pipe 4 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_5" edc:nzwidth="0x1" edc:desc="Pipe 5 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_6" edc:nzwidth="0x1" edc:desc="Pipe 6 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_7" edc:nzwidth="0x1" edc:desc="Pipe 7 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_8" edc:nzwidth="0x1" edc:desc="Pipe 8 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PEP_9" edc:nzwidth="0x1" edc:desc="Pipe 9 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DMA_1" edc:nzwidth="0x1" edc:desc="DMA Channel 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_2" edc:nzwidth="0x1" edc:desc="DMA Channel 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_3" edc:nzwidth="0x1" edc:desc="DMA Channel 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_4" edc:nzwidth="0x1" edc:desc="DMA Channel 3 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_5" edc:nzwidth="0x1" edc:desc="DMA Channel 4 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_6" edc:nzwidth="0x1" edc:desc="DMA Channel 5 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DMA_7" edc:nzwidth="0x1" edc:desc="DMA Channel 6 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
