Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPCFG4" edc:nzwidth="0x20" edc:access="nnnnnnnn---nnnnn--nn-nnn-nnnnnn-" edc:impl="0xFF1F377E" edc:_addr="0x40038510">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1" edc:desc="Pipe Memory Allocate"/>
            <edc:SFRFieldDef edc:cname="PBK" edc:nzwidth="0x2" edc:desc="Pipe Banks">
              <edc:SFRFieldSemantic edc:cname="_1_BANK" edc:desc="Single-bank pipe" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_BANK" edc:desc="Double-bank pipe" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_BANK" edc:desc="Triple-bank pipe" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PSIZE" edc:nzwidth="0x3" edc:desc="Pipe Size">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTOKEN" edc:nzwidth="0x2" edc:desc="Pipe Token">
              <edc:SFRFieldSemantic edc:cname="SETUP" edc:desc="SETUP" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="IN" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="OUT" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:nzwidth="0x1" edc:desc="Automatic Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:nzwidth="0x2" edc:desc="Pipe Type">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PEPNUM" edc:nzwidth="0x4" edc:desc="Pipe Endpoint Number"/>
            <edc:SFRFieldDef edc:cname="PINGEN" edc:nzwidth="0x1" edc:desc="Ping Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BINTERVAL" edc:nzwidth="0x8" edc:desc="bInterval Parameter for the Bulk-Out/Ping Transaction"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPCFG5" edc:nzwidth="0x20" edc:access="nnnnnnnn---nnnnn--nn-nnn-nnnnnn-" edc:impl="0xFF1F377E" edc:_addr="0x40038514">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1" edc:desc="Pipe Memory Allocate"/>
            <edc:SFRFieldDef edc:cname="PBK" edc:nzwidth="0x2" edc:desc="Pipe Banks">
              <edc:SFRFieldSemantic edc:cname="_1_BANK" edc:desc="Single-bank pipe" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_BANK" edc:desc="Double-bank pipe" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_BANK" edc:desc="Triple-bank pipe" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PSIZE" edc:nzwidth="0x3" edc:desc="Pipe Size">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTOKEN" edc:nzwidth="0x2" edc:desc="Pipe Token">
              <edc:SFRFieldSemantic edc:cname="SETUP" edc:desc="SETUP" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="IN" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="OUT" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:nzwidth="0x1" edc:desc="Automatic Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:nzwidth="0x2" edc:desc="Pipe Type">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PEPNUM" edc:nzwidth="0x4" edc:desc="Pipe Endpoint Number"/>
            <edc:SFRFieldDef edc:cname="PINGEN" edc:nzwidth="0x1" edc:desc="Ping Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BINTERVAL" edc:nzwidth="0x8" edc:desc="bInterval Parameter for the Bulk-Out/Ping Transaction"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPCFG6" edc:nzwidth="0x20" edc:access="nnnnnnnn---nnnnn--nn-nnn-nnnnnn-" edc:impl="0xFF1F377E" edc:_addr="0x40038518">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1" edc:desc="Pipe Memory Allocate"/>
            <edc:SFRFieldDef edc:cname="PBK" edc:nzwidth="0x2" edc:desc="Pipe Banks">
              <edc:SFRFieldSemantic edc:cname="_1_BANK" edc:desc="Single-bank pipe" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_BANK" edc:desc="Double-bank pipe" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_BANK" edc:desc="Triple-bank pipe" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PSIZE" edc:nzwidth="0x3" edc:desc="Pipe Size">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTOKEN" edc:nzwidth="0x2" edc:desc="Pipe Token">
              <edc:SFRFieldSemantic edc:cname="SETUP" edc:desc="SETUP" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="IN" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="OUT" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:nzwidth="0x1" edc:desc="Automatic Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:nzwidth="0x2" edc:desc="Pipe Type">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PEPNUM" edc:nzwidth="0x4" edc:desc="Pipe Endpoint Number"/>
            <edc:SFRFieldDef edc:cname="PINGEN" edc:nzwidth="0x1" edc:desc="Ping Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BINTERVAL" edc:nzwidth="0x8" edc:desc="bInterval Parameter for the Bulk-Out/Ping Transaction"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPCFG7" edc:nzwidth="0x20" edc:access="nnnnnnnn---nnnnn--nn-nnn-nnnnnn-" edc:impl="0xFF1F377E" edc:_addr="0x4003851C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1" edc:desc="Pipe Memory Allocate"/>
            <edc:SFRFieldDef edc:cname="PBK" edc:nzwidth="0x2" edc:desc="Pipe Banks">
              <edc:SFRFieldSemantic edc:cname="_1_BANK" edc:desc="Single-bank pipe" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_BANK" edc:desc="Double-bank pipe" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_BANK" edc:desc="Triple-bank pipe" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PSIZE" edc:nzwidth="0x3" edc:desc="Pipe Size">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTOKEN" edc:nzwidth="0x2" edc:desc="Pipe Token">
              <edc:SFRFieldSemantic edc:cname="SETUP" edc:desc="SETUP" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="IN" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="OUT" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:nzwidth="0x1" edc:desc="Automatic Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:nzwidth="0x2" edc:desc="Pipe Type">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PEPNUM" edc:nzwidth="0x4" edc:desc="Pipe Endpoint Number"/>
            <edc:SFRFieldDef edc:cname="PINGEN" edc:nzwidth="0x1" edc:desc="Ping Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BINTERVAL" edc:nzwidth="0x8" edc:desc="bInterval Parameter for the Bulk-Out/Ping Transaction"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPCFG8" edc:nzwidth="0x20" edc:access="nnnnnnnn---nnnnn--nn-nnn-nnnnnn-" edc:impl="0xFF1F377E" edc:_addr="0x40038520">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1" edc:desc="Pipe Memory Allocate"/>
            <edc:SFRFieldDef edc:cname="PBK" edc:nzwidth="0x2" edc:desc="Pipe Banks">
              <edc:SFRFieldSemantic edc:cname="_1_BANK" edc:desc="Single-bank pipe" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_BANK" edc:desc="Double-bank pipe" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_BANK" edc:desc="Triple-bank pipe" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PSIZE" edc:nzwidth="0x3" edc:desc="Pipe Size">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTOKEN" edc:nzwidth="0x2" edc:desc="Pipe Token">
              <edc:SFRFieldSemantic edc:cname="SETUP" edc:desc="SETUP" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="IN" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="OUT" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:nzwidth="0x1" edc:desc="Automatic Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:nzwidth="0x2" edc:desc="Pipe Type">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PEPNUM" edc:nzwidth="0x4" edc:desc="Pipe Endpoint Number"/>
            <edc:SFRFieldDef edc:cname="PINGEN" edc:nzwidth="0x1" edc:desc="Ping Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BINTERVAL" edc:nzwidth="0x8" edc:desc="bInterval Parameter for the Bulk-Out/Ping Transaction"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPCFG9" edc:nzwidth="0x20" edc:access="nnnnnnnn---nnnnn--nn-nnn-nnnnnn-" edc:impl="0xFF1F377E" edc:_addr="0x40038524">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ALLOC" edc:nzwidth="0x1" edc:desc="Pipe Memory Allocate"/>
            <edc:SFRFieldDef edc:cname="PBK" edc:nzwidth="0x2" edc:desc="Pipe Banks">
              <edc:SFRFieldSemantic edc:cname="_1_BANK" edc:desc="Single-bank pipe" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_2_BANK" edc:desc="Double-bank pipe" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_3_BANK" edc:desc="Triple-bank pipe" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PSIZE" edc:nzwidth="0x3" edc:desc="Pipe Size">
              <edc:SFRFieldSemantic edc:cname="_8_BYTE" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_16_BYTE" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_32_BYTE" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_64_BYTE" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_128_BYTE" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_256_BYTE" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_512_BYTE" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_1024_BYTE" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTOKEN" edc:nzwidth="0x2" edc:desc="Pipe Token">
              <edc:SFRFieldSemantic edc:cname="SETUP" edc:desc="SETUP" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="IN" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="OUT" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AUTOSW" edc:nzwidth="0x1" edc:desc="Automatic Switch"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PTYPE" edc:nzwidth="0x2" edc:desc="Pipe Type">
              <edc:SFRFieldSemantic edc:cname="CTRL" edc:desc="Control" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ISO" edc:desc="Isochronous" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BLK" edc:desc="Bulk" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="INTRPT" edc:desc="Interrupt" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PEPNUM" edc:nzwidth="0x4" edc:desc="Pipe Endpoint Number"/>
            <edc:SFRFieldDef edc:cname="PINGEN" edc:nzwidth="0x1" edc:desc="Ping Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BINTERVAL" edc:nzwidth="0x8" edc:desc="bInterval Parameter for the Bulk-Out/Ping Transaction"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
