Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPISR7" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:impl="0x7FF5F3FF" edc:_addr="0x4003854C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINI" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:nzwidth="0x1" edc:desc="NAKed Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:nzwidth="0xB" edc:desc="Pipe Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPISR8" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:impl="0x7FF5F3FF" edc:_addr="0x40038550">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINI" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:nzwidth="0x1" edc:desc="NAKed Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:nzwidth="0xB" edc:desc="Pipe Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPISR9" edc:nzwidth="0x20" edc:access="-rrrrrrrrrrr-r-rrrrr--rrrrrrrrrr" edc:impl="0x7FF5F3FF" edc:_addr="0x40038554">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINI" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXOUTI" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt"/>
            <edc:SFRFieldDef edc:cname="UNDERFI" edc:nzwidth="0x1" edc:desc="Underflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="PERRI" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="NAKEDI" edc:nzwidth="0x1" edc:desc="NAKed Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVERFI" edc:nzwidth="0x1" edc:desc="Overflow Interrupt"/>
            <edc:SFRFieldDef edc:cname="CRCERRI" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETI" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt"/>
            <edc:SFRFieldDef edc:cname="DTSEQ" edc:nzwidth="0x2" edc:desc="Data Toggle Sequence">
              <edc:SFRFieldSemantic edc:cname="DATA0" edc:desc="Data0 toggle sequence" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DATA1" edc:desc="Data1 toggle sequence" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NBUSYBK" edc:nzwidth="0x2" edc:desc="Number of Busy Banks">
              <edc:SFRFieldSemantic edc:cname="_0_BUSY" edc:desc="0 busy bank (all banks free)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_BUSY" edc:desc="1 busy bank" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BUSY" edc:desc="2 busy banks" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_3_BUSY" edc:desc="3 busy banks" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CURRBK" edc:nzwidth="0x2" edc:desc="Current Bank">
              <edc:SFRFieldSemantic edc:cname="BANK0" edc:desc="Current bank is bank0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BANK1" edc:desc="Current bank is bank1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BANK2" edc:desc="Current bank is bank2" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RWALL" edc:nzwidth="0x1" edc:desc="Read/Write Allowed"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CFGOK" edc:nzwidth="0x1" edc:desc="Configuration OK Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PBYCT" edc:nzwidth="0xB" edc:desc="Pipe Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40038558"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPICR0" edc:nzwidth="0x20" edc:access="------------------------wwww-www" edc:impl="0xF7" edc:_addr="0x40038560">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="TXOUTIC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPICR1" edc:nzwidth="0x20" edc:access="------------------------wwww-www" edc:impl="0xF7" edc:_addr="0x40038564">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="TXOUTIC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPICR2" edc:nzwidth="0x20" edc:access="------------------------wwww-www" edc:impl="0xF7" edc:_addr="0x40038568">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="TXOUTIC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPICR3" edc:nzwidth="0x20" edc:access="------------------------wwww-www" edc:impl="0xF7" edc:_addr="0x4003856C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="TXOUTIC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPICR4" edc:nzwidth="0x20" edc:access="------------------------wwww-www" edc:impl="0xF7" edc:_addr="0x40038570">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="TXOUTIC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPICR5" edc:nzwidth="0x20" edc:access="------------------------wwww-www" edc:impl="0xF7" edc:_addr="0x40038574">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="TXOUTIC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPICR6" edc:nzwidth="0x20" edc:access="------------------------wwww-www" edc:impl="0xF7" edc:_addr="0x40038578">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="TXOUTIC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPICR7" edc:nzwidth="0x20" edc:access="------------------------wwww-www" edc:impl="0xF7" edc:_addr="0x4003857C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="TXOUTIC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPICR8" edc:nzwidth="0x20" edc:access="------------------------wwww-www" edc:impl="0xF7" edc:_addr="0x40038580">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="TXOUTIC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPICR9" edc:nzwidth="0x20" edc:access="------------------------wwww-www" edc:impl="0xF7" edc:_addr="0x40038584">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="TXOUTIC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="UNDERFIC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NAKEDIC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="OVERFIC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="CRCERRIC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Clear"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
