Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40038588"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIFR0" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x40038590">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIFR1" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x40038594">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIFR2" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x40038598">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIFR3" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x4003859C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIFR4" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x400385A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
