Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIFR5" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x400385A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIFR6" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x400385A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIFR7" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x400385AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIFR8" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x400385B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIFR9" edc:nzwidth="0x20" edc:access="-------------------w----wwwwwwww" edc:impl="0x10FF" edc:_addr="0x400385B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINIS" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="TXOUTIS" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="UNDERFIS" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="PERRIS" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="NAKEDIS" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="OVERFIS" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="CRCERRIS" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Set"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIS" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Set"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKS" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400385B8"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIMR0" edc:nzwidth="0x20" edc:access="-------------rrr-r-r----rrrrrrrr" edc:impl="0x750FF" edc:_addr="0x400385C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
