Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIMR1" edc:nzwidth="0x20" edc:access="-------------rrr-r-r----rrrrrrrr" edc:impl="0x750FF" edc:_addr="0x400385C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIMR2" edc:nzwidth="0x20" edc:access="-------------rrr-r-r----rrrrrrrr" edc:impl="0x750FF" edc:_addr="0x400385C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIMR3" edc:nzwidth="0x20" edc:access="-------------rrr-r-r----rrrrrrrr" edc:impl="0x750FF" edc:_addr="0x400385CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIMR4" edc:nzwidth="0x20" edc:access="-------------rrr-r-r----rrrrrrrr" edc:impl="0x750FF" edc:_addr="0x400385D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIMR5" edc:nzwidth="0x20" edc:access="-------------rrr-r-r----rrrrrrrr" edc:impl="0x750FF" edc:_addr="0x400385D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIMR6" edc:nzwidth="0x20" edc:access="-------------rrr-r-r----rrrrrrrr" edc:impl="0x750FF" edc:_addr="0x400385D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIMR7" edc:nzwidth="0x20" edc:access="-------------rrr-r-r----rrrrrrrr" edc:impl="0x750FF" edc:_addr="0x400385DC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIMR8" edc:nzwidth="0x20" edc:access="-------------rrr-r-r----rrrrrrrr" edc:impl="0x750FF" edc:_addr="0x400385E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIMR9" edc:nzwidth="0x20" edc:access="-------------rrr-r-r----rrrrrrrr" edc:impl="0x750FF" edc:_addr="0x400385E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINE" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTE" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIE" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRE" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDE" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIE" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRE" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIE" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKE" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCON" edc:nzwidth="0x1" edc:desc="FIFO Control"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMA" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZE" edc:nzwidth="0x1" edc:desc="Pipe Freeze"/>
            <edc:SFRFieldDef edc:cname="RSTDT" edc:nzwidth="0x1" edc:desc="Reset Data Toggle"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400385E8"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIER0" edc:nzwidth="0x20" edc:access="-------------www---w----wwwwwwww" edc:impl="0x710FF" edc:_addr="0x400385F0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:nzwidth="0x1" edc:desc="Pipe Freeze Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIER1" edc:nzwidth="0x20" edc:access="-------------www---w----wwwwwwww" edc:impl="0x710FF" edc:_addr="0x400385F4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:nzwidth="0x1" edc:desc="Pipe Freeze Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIER2" edc:nzwidth="0x20" edc:access="-------------www---w----wwwwwwww" edc:impl="0x710FF" edc:_addr="0x400385F8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINES" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXOUTES" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIES" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="PERRES" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NAKEDES" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVERFIES" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRCERRES" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIES" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKES" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAS" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Enable"/>
            <edc:SFRFieldDef edc:cname="PFREEZES" edc:nzwidth="0x1" edc:desc="Pipe Freeze Enable"/>
            <edc:SFRFieldDef edc:cname="RSTDTS" edc:nzwidth="0x1" edc:desc="Reset Data Toggle Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
