Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIDR6" edc:nzwidth="0x20" edc:access="--------------ww-w-w----wwwwwwww" edc:impl="0x350FF" edc:_addr="0x40038638">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Disable"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:nzwidth="0x1" edc:desc="Pipe Freeze Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIDR7" edc:nzwidth="0x20" edc:access="--------------ww-w-w----wwwwwwww" edc:impl="0x350FF" edc:_addr="0x4003863C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Disable"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:nzwidth="0x1" edc:desc="Pipe Freeze Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIDR8" edc:nzwidth="0x20" edc:access="--------------ww-w-w----wwwwwwww" edc:impl="0x350FF" edc:_addr="0x40038640">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Disable"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:nzwidth="0x1" edc:desc="Pipe Freeze Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPIDR9" edc:nzwidth="0x20" edc:access="--------------ww-w-w----wwwwwwww" edc:impl="0x350FF" edc:_addr="0x40038644">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="RXINEC" edc:nzwidth="0x1" edc:desc="Received IN Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXOUTEC" edc:nzwidth="0x1" edc:desc="Transmitted OUT Data Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNDERFIEC" edc:nzwidth="0x1" edc:desc="Underflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="PERREC" edc:nzwidth="0x1" edc:desc="Pipe Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NAKEDEC" edc:nzwidth="0x1" edc:desc="NAKed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVERFIEC" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CRCERREC" edc:nzwidth="0x1" edc:desc="CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SHORTPACKETIEC" edc:nzwidth="0x1" edc:desc="Short Packet Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="NBUSYBKEC" edc:nzwidth="0x1" edc:desc="Number of Busy Banks Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOCONC" edc:nzwidth="0x1" edc:desc="FIFO Control Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PDISHDMAC" edc:nzwidth="0x1" edc:desc="Pipe Interrupts Disable HDMA Request Disable"/>
            <edc:SFRFieldDef edc:cname="PFREEZEC" edc:nzwidth="0x1" edc:desc="Pipe Freeze Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40038648"/>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPINRQ0" edc:nzwidth="0x20" edc:access="-----------------------nnnnnnnnn" edc:impl="0x1FF" edc:_addr="0x40038650">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:nzwidth="0x8" edc:desc="IN Request Number before Freeze"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:nzwidth="0x1" edc:desc="IN Request Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPINRQ1" edc:nzwidth="0x20" edc:access="-----------------------nnnnnnnnn" edc:impl="0x1FF" edc:_addr="0x40038654">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:nzwidth="0x8" edc:desc="IN Request Number before Freeze"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:nzwidth="0x1" edc:desc="IN Request Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPINRQ2" edc:nzwidth="0x20" edc:access="-----------------------nnnnnnnnn" edc:impl="0x1FF" edc:_addr="0x40038658">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:nzwidth="0x8" edc:desc="IN Request Number before Freeze"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:nzwidth="0x1" edc:desc="IN Request Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPINRQ3" edc:nzwidth="0x20" edc:access="-----------------------nnnnnnnnn" edc:impl="0x1FF" edc:_addr="0x4003865C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:nzwidth="0x8" edc:desc="IN Request Number before Freeze"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:nzwidth="0x1" edc:desc="IN Request Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPINRQ4" edc:nzwidth="0x20" edc:access="-----------------------nnnnnnnnn" edc:impl="0x1FF" edc:_addr="0x40038660">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:nzwidth="0x8" edc:desc="IN Request Number before Freeze"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:nzwidth="0x1" edc:desc="IN Request Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPINRQ5" edc:nzwidth="0x20" edc:access="-----------------------nnnnnnnnn" edc:impl="0x1FF" edc:_addr="0x40038664">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:nzwidth="0x8" edc:desc="IN Request Number before Freeze"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:nzwidth="0x1" edc:desc="IN Request Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPINRQ6" edc:nzwidth="0x20" edc:access="-----------------------nnnnnnnnn" edc:impl="0x1FF" edc:_addr="0x40038668">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:nzwidth="0x8" edc:desc="IN Request Number before Freeze"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:nzwidth="0x1" edc:desc="IN Request Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTPIPINRQ7" edc:nzwidth="0x20" edc:access="-----------------------nnnnnnnnn" edc:impl="0x1FF" edc:_addr="0x4003866C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="INRQ" edc:nzwidth="0x8" edc:desc="IN Request Number before Freeze"/>
            <edc:SFRFieldDef edc:cname="INMODE" edc:nzwidth="0x1" edc:desc="IN Request Mode"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
