Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA2USBHS_HSTDMASTATUS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:impl="0xFFFF0073" edc:_addr="0x4003873C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Status"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:nzwidth="0x1" edc:desc="Channel Active Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:nzwidth="0x1" edc:desc="End of Channel Transfer Status"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:nzwidth="0x1" edc:desc="End of Channel Buffer Status"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Status"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:nzwidth="0x10" edc:desc="Buffer Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA3USBHS_HSTDMANXTDSC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038740">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:nzwidth="0x20" edc:desc="Next Descriptor Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA3USBHS_HSTDMAADDRESS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038744">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:nzwidth="0x20" edc:desc="Buffer Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA3USBHS_HSTDMACONTROL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:impl="0xFFFF00FF" edc:_addr="0x40038748">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Command"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:nzwidth="0x1" edc:desc="Load Next Channel Transfer Descriptor Enable Command"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:nzwidth="0x1" edc:desc="End of Transfer Enable Control (OUT transfers only)"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:nzwidth="0x1" edc:desc="End of Buffer Enable Control"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:nzwidth="0x1" edc:desc="End of Transfer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:nzwidth="0x1" edc:desc="End of Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:nzwidth="0x1" edc:desc="Burst Lock Enable"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:nzwidth="0x10" edc:desc="Buffer Byte Length (Write-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA3USBHS_HSTDMASTATUS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:impl="0xFFFF0073" edc:_addr="0x4003874C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Status"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:nzwidth="0x1" edc:desc="Channel Active Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:nzwidth="0x1" edc:desc="End of Channel Transfer Status"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:nzwidth="0x1" edc:desc="End of Channel Buffer Status"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Status"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:nzwidth="0x10" edc:desc="Buffer Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA4USBHS_HSTDMANXTDSC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038750">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:nzwidth="0x20" edc:desc="Next Descriptor Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA4USBHS_HSTDMAADDRESS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038754">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="BUFF_ADD" edc:nzwidth="0x20" edc:desc="Buffer Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA4USBHS_HSTDMACONTROL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn--------nnnnnnnn" edc:impl="0xFFFF00FF" edc:_addr="0x40038758">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Command"/>
            <edc:SFRFieldDef edc:cname="LDNXT_DSC" edc:nzwidth="0x1" edc:desc="Load Next Channel Transfer Descriptor Enable Command"/>
            <edc:SFRFieldDef edc:cname="END_TR_EN" edc:nzwidth="0x1" edc:desc="End of Transfer Enable Control (OUT transfers only)"/>
            <edc:SFRFieldDef edc:cname="END_B_EN" edc:nzwidth="0x1" edc:desc="End of Buffer Enable Control"/>
            <edc:SFRFieldDef edc:cname="END_TR_IT" edc:nzwidth="0x1" edc:desc="End of Transfer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="END_BUFFIT" edc:nzwidth="0x1" edc:desc="End of Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DESC_LD_IT" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="BURST_LCK" edc:nzwidth="0x1" edc:desc="Burst Lock Enable"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="BUFF_LENGTH" edc:nzwidth="0x10" edc:desc="Buffer Byte Length (Write-only)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA4USBHS_HSTDMASTATUS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---------nnn--nn" edc:impl="0xFFFF0073" edc:_addr="0x4003875C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="CHANN_ENB" edc:nzwidth="0x1" edc:desc="Channel Enable Status"/>
            <edc:SFRFieldDef edc:cname="CHANN_ACT" edc:nzwidth="0x1" edc:desc="Channel Active Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="END_TR_ST" edc:nzwidth="0x1" edc:desc="End of Channel Transfer Status"/>
            <edc:SFRFieldDef edc:cname="END_BF_ST" edc:nzwidth="0x1" edc:desc="End of Channel Buffer Status"/>
            <edc:SFRFieldDef edc:cname="DESC_LDST" edc:nzwidth="0x1" edc:desc="Descriptor Loaded Status"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="BUFF_COUNT" edc:nzwidth="0x10" edc:desc="Buffer Byte Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="USBHS" edc:cname="USBHS_HSTDMA5USBHS_HSTDMANXTDSC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40038760">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USBHS">
            <edc:SFRFieldDef edc:cname="NXT_DSC_ADD" edc:nzwidth="0x20" edc:desc="Next Descriptor Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
