Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40048024"/>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_DSCR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnn------" edc:impl="0xFFFFFFC0" edc:_addr="0x40048030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DASA" edc:nzwidth="0x1A" edc:desc="Descriptor Area Start Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_HASH" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnn-------" edc:impl="0xFFFFFF80" edc:_addr="0x40048034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="HASA" edc:nzwidth="0x19" edc:desc="Hash Area Start Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40048038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL1" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4004803C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL2" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40048040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL3" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40048044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL4" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40048048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL5" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4004804C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL6" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40048050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ICM" edc:cname="ICM_UIHVAL7" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x40048054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ICM">
            <edc:SFRFieldDef edc:cname="VAL" edc:nzwidth="0x20" edc:desc="Initial Hash Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3FA8" edc:_addr="0x40048058"/>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_CFG1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn-nnnnnnnnnnnnn--" edc:impl="0xFFFF7FFC" edc:_addr="0x4004C000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HSYNC_POL" edc:nzwidth="0x1" edc:desc="Horizontal Synchronization Polarity"/>
            <edc:SFRFieldDef edc:cname="VSYNC_POL" edc:nzwidth="0x1" edc:desc="Vertical Synchronization Polarity"/>
            <edc:SFRFieldDef edc:cname="PIXCLK_POL" edc:nzwidth="0x1" edc:desc="Pixel Clock Polarity"/>
            <edc:SFRFieldDef edc:cname="GRAYLE" edc:nzwidth="0x1" edc:desc="Grayscale Little Endian"/>
            <edc:SFRFieldDef edc:cname="EMB_SYNC" edc:nzwidth="0x1" edc:desc="Embedded Synchronization"/>
            <edc:SFRFieldDef edc:cname="CRC_SYNC" edc:nzwidth="0x1" edc:desc="Embedded Synchronization Correction"/>
            <edc:SFRFieldDef edc:cname="FRATE" edc:nzwidth="0x3" edc:desc="Frame Rate [0..7]"/>
            <edc:SFRFieldDef edc:cname="DISCR" edc:nzwidth="0x1" edc:desc="Disable Codec Request"/>
            <edc:SFRFieldDef edc:cname="FULL" edc:nzwidth="0x1" edc:desc="Full Mode is Allowed"/>
            <edc:SFRFieldDef edc:cname="THMASK" edc:nzwidth="0x2" edc:desc="Threshold Mask">
              <edc:SFRFieldSemantic edc:cname="BEATS_4" edc:desc="Only 4 beats AHB burst allowed" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="BEATS_8" edc:desc="Only 4 and 8 beats AHB burst allowed" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="BEATS_16" edc:desc="4, 8 and 16 beats AHB burst allowed" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SLD" edc:nzwidth="0x8" edc:desc="Start of Line Delay"/>
            <edc:SFRFieldDef edc:cname="SFD" edc:nzwidth="0x8" edc:desc="Start of Frame Delay"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_CFG2" edc:nzwidth="0x20" edc:access="nnnn-nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xF7FFFFFF" edc:_addr="0x4004C004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="IM_VSIZE" edc:nzwidth="0xB" edc:desc="Vertical Size of the Image Sensor [0..2047]"/>
            <edc:SFRFieldDef edc:cname="GS_MODE" edc:nzwidth="0x1" edc:desc="Grayscale Pixel Format Mode"/>
            <edc:SFRFieldDef edc:cname="RGB_MODE" edc:nzwidth="0x1" edc:desc="RGB Input Mode"/>
            <edc:SFRFieldDef edc:cname="GRAYSCALE" edc:nzwidth="0x1" edc:desc="Grayscale Mode Format Enable"/>
            <edc:SFRFieldDef edc:cname="RGB_SWAP" edc:nzwidth="0x1" edc:desc="RGB Format Swap Mode"/>
            <edc:SFRFieldDef edc:cname="COL_SPACE" edc:nzwidth="0x1" edc:desc="Color Space for the Image Data"/>
            <edc:SFRFieldDef edc:cname="IM_HSIZE" edc:nzwidth="0xB" edc:desc="Horizontal Size of the Image Sensor [0..2047]"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="YCC_SWAP" edc:nzwidth="0x2" edc:desc="YCrCb Format Swap Mode">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Byte 0 Cb(i)Byte 1 Y(i)Byte 2 Cr(i)Byte 3 Y(i+1)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="Byte 0 Cr(i)Byte 1 Y(i)Byte 2 Cb(i)Byte 3 Y(i+1)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="Byte 0 Y(i)Byte 1 Cb(i)Byte 2 Y(i+1)Byte 3 Cr(i)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="Byte 0 Y(i)Byte 1 Cr(i)Byte 2 Y(i+1)Byte 3 Cb(i)" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RGB_CFG" edc:nzwidth="0x2" edc:desc="RGB Pixel Mapping Configuration">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="Byte 0 R/G(MSB)Byte 1 G(LSB)/BByte 2 R/G(MSB)Byte 3 G(LSB)/B" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MODE1" edc:desc="Byte 0 B/G(MSB)Byte 1 G(LSB)/RByte 2 B/G(MSB)Byte 3 G(LSB)/R" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MODE2" edc:desc="Byte 0 G(LSB)/RByte 1 B/G(MSB)Byte 2 G(LSB)/RByte 3 B/G(MSB)" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODE3" edc:desc="Byte 0 G(LSB)/BByte 1 R/G(MSB)Byte 2 G(LSB)/BByte 3 R/G(MSB)" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_PSIZE" edc:nzwidth="0x20" edc:access="------nnnnnnnnnn------nnnnnnnnnn" edc:impl="0x3FF03FF" edc:_addr="0x4004C008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="PREV_VSIZE" edc:nzwidth="0xA" edc:desc="Vertical Size for the Preview Path"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="PREV_HSIZE" edc:nzwidth="0xA" edc:desc="Horizontal Size for the Preview Path"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_PDECF" edc:nzwidth="0x20" edc:access="------------------------nnnnnnnn" edc:impl="0xFF" edc:_addr="0x4004C00C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="DEC_FACTOR" edc:nzwidth="0x8" edc:desc="Decimation Factor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_Y2R_SET0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4004C010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="C0" edc:nzwidth="0x8" edc:desc="Color Space Conversion Matrix Coefficient C0"/>
            <edc:SFRFieldDef edc:cname="C1" edc:nzwidth="0x8" edc:desc="Color Space Conversion Matrix Coefficient C1"/>
            <edc:SFRFieldDef edc:cname="C2" edc:nzwidth="0x8" edc:desc="Color Space Conversion Matrix Coefficient C2"/>
            <edc:SFRFieldDef edc:cname="C3" edc:nzwidth="0x8" edc:desc="Color Space Conversion Matrix Coefficient C3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_Y2R_SET1" edc:nzwidth="0x20" edc:access="-----------------nnn---nnnnnnnnn" edc:impl="0x71FF" edc:_addr="0x4004C014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="C4" edc:nzwidth="0x9" edc:desc="Color Space Conversion Matrix Coefficient C4"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="Yoff" edc:nzwidth="0x1" edc:desc="Color Space Conversion Luminance Default Offset"/>
            <edc:SFRFieldDef edc:cname="Croff" edc:nzwidth="0x1" edc:desc="Color Space Conversion Red Chrominance Default Offset"/>
            <edc:SFRFieldDef edc:cname="Cboff" edc:nzwidth="0x1" edc:desc="Color Space Conversion Blue Chrominance Default Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_R2Y_SET0" edc:nzwidth="0x20" edc:access="-------n-nnnnnnn-nnnnnnn-nnnnnnn" edc:impl="0x17F7F7F" edc:_addr="0x4004C018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="C0" edc:nzwidth="0x7" edc:desc="Color Space Conversion Matrix Coefficient C0"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C1" edc:nzwidth="0x7" edc:desc="Color Space Conversion Matrix Coefficient C1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C2" edc:nzwidth="0x7" edc:desc="Color Space Conversion Matrix Coefficient C2"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Roff" edc:nzwidth="0x1" edc:desc="Color Space Conversion Red Component Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_R2Y_SET1" edc:nzwidth="0x20" edc:access="-------n-nnnnnnn-nnnnnnn-nnnnnnn" edc:impl="0x17F7F7F" edc:_addr="0x4004C01C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="C3" edc:nzwidth="0x7" edc:desc="Color Space Conversion Matrix Coefficient C3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C4" edc:nzwidth="0x7" edc:desc="Color Space Conversion Matrix Coefficient C4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C5" edc:nzwidth="0x7" edc:desc="Color Space Conversion Matrix Coefficient C5"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Goff" edc:nzwidth="0x1" edc:desc="Color Space Conversion Green Component Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_R2Y_SET2" edc:nzwidth="0x20" edc:access="-------n-nnnnnnn-nnnnnnn-nnnnnnn" edc:impl="0x17F7F7F" edc:_addr="0x4004C020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="C6" edc:nzwidth="0x7" edc:desc="Color Space Conversion Matrix Coefficient C6"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C7" edc:nzwidth="0x7" edc:desc="Color Space Conversion Matrix Coefficient C7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="C8" edc:nzwidth="0x7" edc:desc="Color Space Conversion Matrix Coefficient C8"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="Boff" edc:nzwidth="0x1" edc:desc="Color Space Conversion Blue Component Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
