Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_CR" edc:nzwidth="0x20" edc:access="-----------------------w-----www" edc:impl="0x107" edc:_addr="0x4004C024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="ISI_EN" edc:nzwidth="0x1" edc:desc="ISI Module Enable Request"/>
            <edc:SFRFieldDef edc:cname="ISI_DIS" edc:nzwidth="0x1" edc:desc="ISI Module Disable Request"/>
            <edc:SFRFieldDef edc:cname="ISI_SRST" edc:nzwidth="0x1" edc:desc="ISI Software Reset Request"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="ISI_CDC" edc:nzwidth="0x1" edc:desc="ISI Codec Request"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_SR" edc:nzwidth="0x20" edc:access="----rrrr----r-rr-----r-r-----rrr" edc:impl="0xF0B0507" edc:_addr="0x4004C028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Module Enable"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:nzwidth="0x1" edc:desc="Module Disable Request has Terminated (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:nzwidth="0x1" edc:desc="Module Software Reset Request has Terminated (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="CDC_PND" edc:nzwidth="0x1" edc:desc="Pending Codec Request"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:nzwidth="0x1" edc:desc="Vertical Synchronization (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:nzwidth="0x1" edc:desc="Preview DMA Transfer has Terminated (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:nzwidth="0x1" edc:desc="Codec DMA Transfer has Terminated (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SIP" edc:nzwidth="0x1" edc:desc="Synchronization in Progress"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:nzwidth="0x1" edc:desc="Preview Datapath Overflow (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:nzwidth="0x1" edc:desc="Codec Datapath Overflow (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:nzwidth="0x1" edc:desc="CRC Synchronization Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:nzwidth="0x1" edc:desc="Frame Rate Overrun (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_IER" edc:nzwidth="0x20" edc:access="----wwww------ww-----w-------ww-" edc:impl="0xF030406" edc:_addr="0x4004C02C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:nzwidth="0x1" edc:desc="Disable Done Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:nzwidth="0x1" edc:desc="Software Reset Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:nzwidth="0x1" edc:desc="Vertical Synchronization Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:nzwidth="0x1" edc:desc="Preview DMA Transfer Done Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:nzwidth="0x1" edc:desc="Codec DMA Transfer Done Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:nzwidth="0x1" edc:desc="Preview Datapath Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:nzwidth="0x1" edc:desc="Codec Datapath Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:nzwidth="0x1" edc:desc="Embedded Synchronization CRC Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:nzwidth="0x1" edc:desc="Frame Rate Overflow Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_IDR" edc:nzwidth="0x20" edc:access="----wwww------ww-----w-------ww-" edc:impl="0xF030406" edc:_addr="0x4004C030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:nzwidth="0x1" edc:desc="Disable Done Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:nzwidth="0x1" edc:desc="Software Reset Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:nzwidth="0x1" edc:desc="Vertical Synchronization Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:nzwidth="0x1" edc:desc="Preview DMA Transfer Done Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:nzwidth="0x1" edc:desc="Codec DMA Transfer Done Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:nzwidth="0x1" edc:desc="Preview Datapath Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:nzwidth="0x1" edc:desc="Codec Datapath Overflow Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:nzwidth="0x1" edc:desc="Embedded Synchronization CRC Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:nzwidth="0x1" edc:desc="Frame Rate Overflow Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_IMR" edc:nzwidth="0x20" edc:access="----rrrr------rr-----r-------rr-" edc:impl="0xF030406" edc:_addr="0x4004C034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DIS_DONE" edc:nzwidth="0x1" edc:desc="Module Disable Operation Completed"/>
            <edc:SFRFieldDef edc:cname="SRST" edc:nzwidth="0x1" edc:desc="Software Reset Completed"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="VSYNC" edc:nzwidth="0x1" edc:desc="Vertical Synchronization"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="PXFR_DONE" edc:nzwidth="0x1" edc:desc="Preview DMA Transfer Completed"/>
            <edc:SFRFieldDef edc:cname="CXFR_DONE" edc:nzwidth="0x1" edc:desc="Codec DMA Transfer Completed"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="P_OVR" edc:nzwidth="0x1" edc:desc="Preview FIFO Overflow"/>
            <edc:SFRFieldDef edc:cname="C_OVR" edc:nzwidth="0x1" edc:desc="Codec FIFO Overflow"/>
            <edc:SFRFieldDef edc:cname="CRC_ERR" edc:nzwidth="0x1" edc:desc="CRC Synchronization Error"/>
            <edc:SFRFieldDef edc:cname="FR_OVR" edc:nzwidth="0x1" edc:desc="Frame Rate Overrun"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_DMA_CHER" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:impl="0x3" edc:_addr="0x4004C038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="P_CH_EN" edc:nzwidth="0x1" edc:desc="Preview Channel Enable"/>
            <edc:SFRFieldDef edc:cname="C_CH_EN" edc:nzwidth="0x1" edc:desc="Codec Channel Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
