Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_DMA_CHDR" edc:nzwidth="0x20" edc:access="------------------------------ww" edc:impl="0x3" edc:_addr="0x4004C03C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="P_CH_DIS" edc:nzwidth="0x1" edc:desc="Preview Channel Disable Request"/>
            <edc:SFRFieldDef edc:cname="C_CH_DIS" edc:nzwidth="0x1" edc:desc="Codec Channel Disable Request"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_DMA_CHSR" edc:nzwidth="0x20" edc:access="------------------------------rr" edc:impl="0x3" edc:_addr="0x4004C040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="P_CH_S" edc:nzwidth="0x1" edc:desc="Preview DMA Channel Status"/>
            <edc:SFRFieldDef edc:cname="C_CH_S" edc:nzwidth="0x1" edc:desc="Code DMA Channel Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_DMA_P_ADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:impl="0xFFFFFFFC" edc:_addr="0x4004C044">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="P_ADDR" edc:nzwidth="0x1E" edc:desc="Preview Image Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_DMA_P_CTRL" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0x4004C048">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="P_FETCH" edc:nzwidth="0x1" edc:desc="Descriptor Fetch Control Bit"/>
            <edc:SFRFieldDef edc:cname="P_WB" edc:nzwidth="0x1" edc:desc="Descriptor Writeback Control Bit"/>
            <edc:SFRFieldDef edc:cname="P_IEN" edc:nzwidth="0x1" edc:desc="Transfer Done Flag Control"/>
            <edc:SFRFieldDef edc:cname="P_DONE" edc:nzwidth="0x1" edc:desc="Preview Transfer Done"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_DMA_P_DSCR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:impl="0xFFFFFFFC" edc:_addr="0x4004C04C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="P_DSCR" edc:nzwidth="0x1E" edc:desc="Preview Descriptor Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_DMA_C_ADDR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:impl="0xFFFFFFFC" edc:_addr="0x4004C050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="C_ADDR" edc:nzwidth="0x1E" edc:desc="Codec Image Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_DMA_C_CTRL" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0x4004C054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="C_FETCH" edc:nzwidth="0x1" edc:desc="Descriptor Fetch Control Bit"/>
            <edc:SFRFieldDef edc:cname="C_WB" edc:nzwidth="0x1" edc:desc="Descriptor Writeback Control Bit"/>
            <edc:SFRFieldDef edc:cname="C_IEN" edc:nzwidth="0x1" edc:desc="Transfer Done Flag Control"/>
            <edc:SFRFieldDef edc:cname="C_DONE" edc:nzwidth="0x1" edc:desc="Codec Transfer Done"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_DMA_C_DSCR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn--" edc:impl="0xFFFFFFFC" edc:_addr="0x4004C058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="C_DSCR" edc:nzwidth="0x1E" edc:desc="Codec Descriptor Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x88" edc:_addr="0x4004C05C"/>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x4004C0E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x495349"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ISI" edc:cname="ISI_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x4004C0E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ISI">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
