Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_SR" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:impl="0xF" edc:_addr="0x4005C00C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CHID0" edc:nzwidth="0x1" edc:desc="Channel ID"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:nzwidth="0x1" edc:desc="Channel ID"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:nzwidth="0x1" edc:desc="Channel ID"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:nzwidth="0x1" edc:desc="Channel ID"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_IER1" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x4005C010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CHID0" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 3 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_IDR1" edc:nzwidth="0x20" edc:access="------------wwww------------wwww" edc:impl="0xF000F" edc:_addr="0x4005C014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CHID0" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 2 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 3 Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_IMR1" edc:nzwidth="0x20" edc:access="------------rrrr------------rrrr" edc:impl="0xF000F" edc:_addr="0x4005C018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CHID0" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 0 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 1 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 2 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 3 Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PWM1" edc:cname="PWM1_ISR1" edc:nzwidth="0x20" edc:access="------------rrrr------------rrrr" edc:impl="0xF000F" edc:_addr="0x4005C01C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CHID0" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 0"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 2"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:nzwidth="0x1" edc:desc="Counter Event on Channel 3"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 0"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 1"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 2"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:nzwidth="0x1" edc:desc="Fault Protection Trigger on Channel 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
