Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_CHSR" edc:nzwidth="0x20" edc:access="--------------------rrrrrrrrrrrr" edc:impl="0xFFF" edc:_addr="0x4006401C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="CH0" edc:nzwidth="0x1" edc:desc="Channel 0 Status"/>
            <edc:SFRFieldDef edc:cname="CH1" edc:nzwidth="0x1" edc:desc="Channel 1 Status"/>
            <edc:SFRFieldDef edc:cname="CH2" edc:nzwidth="0x1" edc:desc="Channel 2 Status"/>
            <edc:SFRFieldDef edc:cname="CH3" edc:nzwidth="0x1" edc:desc="Channel 3 Status"/>
            <edc:SFRFieldDef edc:cname="CH4" edc:nzwidth="0x1" edc:desc="Channel 4 Status"/>
            <edc:SFRFieldDef edc:cname="CH5" edc:nzwidth="0x1" edc:desc="Channel 5 Status"/>
            <edc:SFRFieldDef edc:cname="CH6" edc:nzwidth="0x1" edc:desc="Channel 6 Status"/>
            <edc:SFRFieldDef edc:cname="CH7" edc:nzwidth="0x1" edc:desc="Channel 7 Status"/>
            <edc:SFRFieldDef edc:cname="CH8" edc:nzwidth="0x1" edc:desc="Channel 8 Status"/>
            <edc:SFRFieldDef edc:cname="CH9" edc:nzwidth="0x1" edc:desc="Channel 9 Status"/>
            <edc:SFRFieldDef edc:cname="CH10" edc:nzwidth="0x1" edc:desc="Channel 10 Status"/>
            <edc:SFRFieldDef edc:cname="CH11" edc:nzwidth="0x1" edc:desc="Channel 11 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_LCDR" edc:nzwidth="0x20" edc:access="----rrrr--------rrrrrrrrrrrrrrrr" edc:impl="0xF00FFFF" edc:_addr="0x40064020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="LDATA" edc:nzwidth="0x10" edc:desc="Last Data Converted"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="CHNB" edc:nzwidth="0x4" edc:desc="Channel Number"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_IER" edc:nzwidth="0x20" edc:access="-w---www------------wwwwwwwwwwww" edc:impl="0x47000FFF" edc:_addr="0x40064024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 7"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 8"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 9"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 10"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Enable 11"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:nzwidth="0x1" edc:desc="Temperature Change Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_IDR" edc:nzwidth="0x20" edc:access="-w---www------------wwwwwwwwwwww" edc:impl="0x47000FFF" edc:_addr="0x40064028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 7"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 8"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 9"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 10"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Disable 11"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:nzwidth="0x1" edc:desc="Temperature Change Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
