Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_IMR" edc:nzwidth="0x20" edc:access="-r---rrr------------rrrrrrrrrrrr" edc:impl="0x47000FFF" edc:_addr="0x4006402C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 0"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 1"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 2"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 3"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 4"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 5"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 6"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 7"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 8"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 9"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 10"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:nzwidth="0x1" edc:desc="End of Conversion Interrupt Mask 11"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Event Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:nzwidth="0x1" edc:desc="Temperature Change Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_ISR" edc:nzwidth="0x20" edc:access="-r---rrr------------rrrrrrrrrrrr" edc:impl="0x47000FFF" edc:_addr="0x40064030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="EOC0" edc:nzwidth="0x1" edc:desc="End of Conversion 0 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC1" edc:nzwidth="0x1" edc:desc="End of Conversion 1 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC2" edc:nzwidth="0x1" edc:desc="End of Conversion 2 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC3" edc:nzwidth="0x1" edc:desc="End of Conversion 3 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC4" edc:nzwidth="0x1" edc:desc="End of Conversion 4 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC5" edc:nzwidth="0x1" edc:desc="End of Conversion 5 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC6" edc:nzwidth="0x1" edc:desc="End of Conversion 6 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC7" edc:nzwidth="0x1" edc:desc="End of Conversion 7 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC8" edc:nzwidth="0x1" edc:desc="End of Conversion 8 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC9" edc:nzwidth="0x1" edc:desc="End of Conversion 9 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC10" edc:nzwidth="0x1" edc:desc="End of Conversion 10 (cleared by reading AFEC_CDRx)"/>
            <edc:SFRFieldDef edc:cname="EOC11" edc:nzwidth="0x1" edc:desc="End of Conversion 11 (cleared by reading AFEC_CDRx)"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Data Ready (cleared by reading AFEC_LCDR)"/>
            <edc:SFRFieldDef edc:cname="GOVRE" edc:nzwidth="0x1" edc:desc="General Overrun Error (cleared by reading AFEC_ISR)"/>
            <edc:SFRFieldDef edc:cname="COMPE" edc:nzwidth="0x1" edc:desc="Comparison Error (cleared by reading AFEC_ISR)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCHG" edc:nzwidth="0x1" edc:desc="Temperature Change (cleared on read)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0x40064034"/>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_OVER" edc:nzwidth="0x20" edc:access="--------------------rrrrrrrrrrrr" edc:impl="0xFFF" edc:_addr="0x4006404C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="OVRE0" edc:nzwidth="0x1" edc:desc="Overrun Error 0"/>
            <edc:SFRFieldDef edc:cname="OVRE1" edc:nzwidth="0x1" edc:desc="Overrun Error 1"/>
            <edc:SFRFieldDef edc:cname="OVRE2" edc:nzwidth="0x1" edc:desc="Overrun Error 2"/>
            <edc:SFRFieldDef edc:cname="OVRE3" edc:nzwidth="0x1" edc:desc="Overrun Error 3"/>
            <edc:SFRFieldDef edc:cname="OVRE4" edc:nzwidth="0x1" edc:desc="Overrun Error 4"/>
            <edc:SFRFieldDef edc:cname="OVRE5" edc:nzwidth="0x1" edc:desc="Overrun Error 5"/>
            <edc:SFRFieldDef edc:cname="OVRE6" edc:nzwidth="0x1" edc:desc="Overrun Error 6"/>
            <edc:SFRFieldDef edc:cname="OVRE7" edc:nzwidth="0x1" edc:desc="Overrun Error 7"/>
            <edc:SFRFieldDef edc:cname="OVRE8" edc:nzwidth="0x1" edc:desc="Overrun Error 8"/>
            <edc:SFRFieldDef edc:cname="OVRE9" edc:nzwidth="0x1" edc:desc="Overrun Error 9"/>
            <edc:SFRFieldDef edc:cname="OVRE10" edc:nzwidth="0x1" edc:desc="Overrun Error 10"/>
            <edc:SFRFieldDef edc:cname="OVRE11" edc:nzwidth="0x1" edc:desc="Overrun Error 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_CWR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40064050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="LOWTHRES" edc:nzwidth="0x10" edc:desc="Low Threshold"/>
            <edc:SFRFieldDef edc:cname="HIGHTHRES" edc:nzwidth="0x10" edc:desc="High Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_CGR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40064054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="GAIN0" edc:nzwidth="0x2" edc:desc="Gain for Channel 0"/>
            <edc:SFRFieldDef edc:cname="GAIN1" edc:nzwidth="0x2" edc:desc="Gain for Channel 1"/>
            <edc:SFRFieldDef edc:cname="GAIN2" edc:nzwidth="0x2" edc:desc="Gain for Channel 2"/>
            <edc:SFRFieldDef edc:cname="GAIN3" edc:nzwidth="0x2" edc:desc="Gain for Channel 3"/>
            <edc:SFRFieldDef edc:cname="GAIN4" edc:nzwidth="0x2" edc:desc="Gain for Channel 4"/>
            <edc:SFRFieldDef edc:cname="GAIN5" edc:nzwidth="0x2" edc:desc="Gain for Channel 5"/>
            <edc:SFRFieldDef edc:cname="GAIN6" edc:nzwidth="0x2" edc:desc="Gain for Channel 6"/>
            <edc:SFRFieldDef edc:cname="GAIN7" edc:nzwidth="0x2" edc:desc="Gain for Channel 7"/>
            <edc:SFRFieldDef edc:cname="GAIN8" edc:nzwidth="0x2" edc:desc="Gain for Channel 8"/>
            <edc:SFRFieldDef edc:cname="GAIN9" edc:nzwidth="0x2" edc:desc="Gain for Channel 9"/>
            <edc:SFRFieldDef edc:cname="GAIN10" edc:nzwidth="0x2" edc:desc="Gain for Channel 10"/>
            <edc:SFRFieldDef edc:cname="GAIN11" edc:nzwidth="0x2" edc:desc="Gain for Channel 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40064058"/>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_DIFFR" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0x40064060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="DIFF0" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 0"/>
            <edc:SFRFieldDef edc:cname="DIFF1" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 1"/>
            <edc:SFRFieldDef edc:cname="DIFF2" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 2"/>
            <edc:SFRFieldDef edc:cname="DIFF3" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 3"/>
            <edc:SFRFieldDef edc:cname="DIFF4" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 4"/>
            <edc:SFRFieldDef edc:cname="DIFF5" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 5"/>
            <edc:SFRFieldDef edc:cname="DIFF6" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 6"/>
            <edc:SFRFieldDef edc:cname="DIFF7" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 7"/>
            <edc:SFRFieldDef edc:cname="DIFF8" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 8"/>
            <edc:SFRFieldDef edc:cname="DIFF9" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 9"/>
            <edc:SFRFieldDef edc:cname="DIFF10" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 10"/>
            <edc:SFRFieldDef edc:cname="DIFF11" edc:nzwidth="0x1" edc:desc="Differential inputs for channel 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_CSELR" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0x40064064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="CSEL" edc:nzwidth="0x4" edc:desc="Channel Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_CDR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrrrrrrrrrr" edc:impl="0xFFFF" edc:_addr="0x40064068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x10" edc:desc="Converted Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
