Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_COCR" edc:nzwidth="0x20" edc:access="----------------------nnnnnnnnnn" edc:impl="0x3FF" edc:_addr="0x4006406C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="AOFF" edc:nzwidth="0xA" edc:desc="Analog Offset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_TEMPMR" edc:nzwidth="0x20" edc:access="--------------------------nn---n" edc:impl="0x31" edc:_addr="0x40064070">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="RTCT" edc:nzwidth="0x1" edc:desc="Temperature Sensor RTC Trigger Mode"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TEMPCMPMOD" edc:nzwidth="0x2" edc:desc="Temperature Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="Generates an event when the converted data is lower than the low threshold of the window." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="Generates an event when the converted data is higher than the high threshold of the window." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IN" edc:desc="Generates an event when the converted data is in the comparison window." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Generates an event when the converted data is out of the comparison window." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_TEMPCWR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40064074">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="TLOWTHRES" edc:nzwidth="0x10" edc:desc="Temperature Low Threshold"/>
            <edc:SFRFieldDef edc:cname="THIGHTHRES" edc:nzwidth="0x10" edc:desc="Temperature High Threshold"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x40064078"/>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_ACR" edc:nzwidth="0x20" edc:access="----------------------nn----nn--" edc:impl="0x30C" edc:_addr="0x40064094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PGA0EN" edc:nzwidth="0x1" edc:desc="PGA0 Enable"/>
            <edc:SFRFieldDef edc:cname="PGA1EN" edc:nzwidth="0x1" edc:desc="PGA1 Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="IBCTL" edc:nzwidth="0x2" edc:desc="AFE Bias Current Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40064098"/>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_SHMR" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0x400640A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="DUAL0" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 0"/>
            <edc:SFRFieldDef edc:cname="DUAL1" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 1"/>
            <edc:SFRFieldDef edc:cname="DUAL2" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 2"/>
            <edc:SFRFieldDef edc:cname="DUAL3" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 3"/>
            <edc:SFRFieldDef edc:cname="DUAL4" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 4"/>
            <edc:SFRFieldDef edc:cname="DUAL5" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 5"/>
            <edc:SFRFieldDef edc:cname="DUAL6" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 6"/>
            <edc:SFRFieldDef edc:cname="DUAL7" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 7"/>
            <edc:SFRFieldDef edc:cname="DUAL8" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 8"/>
            <edc:SFRFieldDef edc:cname="DUAL9" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 9"/>
            <edc:SFRFieldDef edc:cname="DUAL10" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 10"/>
            <edc:SFRFieldDef edc:cname="DUAL11" edc:nzwidth="0x1" edc:desc="Dual Sample &amp; Hold for channel 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2C" edc:_addr="0x400640A4"/>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_COSR" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:impl="0x1" edc:_addr="0x400640D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="CSEL" edc:nzwidth="0x1" edc:desc="Sample &amp; Hold unit Correction Select"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_CVR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400640D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:nzwidth="0x10" edc:desc="Offset Correction"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:nzwidth="0x10" edc:desc="Gain Correction"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AFEC1" edc:cname="AFEC1_CECR" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0x400640D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AFEC1">
            <edc:SFRFieldDef edc:cname="ECORR0" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 0"/>
            <edc:SFRFieldDef edc:cname="ECORR1" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 1"/>
            <edc:SFRFieldDef edc:cname="ECORR2" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 2"/>
            <edc:SFRFieldDef edc:cname="ECORR3" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 3"/>
            <edc:SFRFieldDef edc:cname="ECORR4" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 4"/>
            <edc:SFRFieldDef edc:cname="ECORR5" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 5"/>
            <edc:SFRFieldDef edc:cname="ECORR6" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 6"/>
            <edc:SFRFieldDef edc:cname="ECORR7" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 7"/>
            <edc:SFRFieldDef edc:cname="ECORR8" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 8"/>
            <edc:SFRFieldDef edc:cname="ECORR9" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 9"/>
            <edc:SFRFieldDef edc:cname="ECORR10" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 10"/>
            <edc:SFRFieldDef edc:cname="ECORR11" edc:nzwidth="0x1" edc:desc="Error Correction Enable for channel 11"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
