Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GE" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x4007801C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="EN0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Enable Bit"/>
            <edc:SFRFieldDef edc:cname="EN23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Enable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GD" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x40078020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DI0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DI23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Disable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GS" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFFF" edc:_addr="0x40078024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="ST0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Status Bit"/>
            <edc:SFRFieldDef edc:cname="ST23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Status Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GRS" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40078028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="RS0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Read Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RS23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Read Suspend Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GWS" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4007802C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="WS0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="WS23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Write Suspend Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GRWS" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x40078030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="RWS0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Read Write Suspend Bit"/>
            <edc:SFRFieldDef edc:cname="RWS23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Read Write Suspend Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GRWR" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x40078034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="RWR0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Read Write Resume Bit"/>
            <edc:SFRFieldDef edc:cname="RWR23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Read Write Resume Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
