Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_GSWF" edc:nzwidth="0x20" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:impl="0xFFFFFF" edc:_addr="0x40078040">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SWF0" edc:nzwidth="0x1" edc:desc="XDMAC Channel 0 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF1" edc:nzwidth="0x1" edc:desc="XDMAC Channel 1 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF2" edc:nzwidth="0x1" edc:desc="XDMAC Channel 2 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF3" edc:nzwidth="0x1" edc:desc="XDMAC Channel 3 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF4" edc:nzwidth="0x1" edc:desc="XDMAC Channel 4 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF5" edc:nzwidth="0x1" edc:desc="XDMAC Channel 5 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF6" edc:nzwidth="0x1" edc:desc="XDMAC Channel 6 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF7" edc:nzwidth="0x1" edc:desc="XDMAC Channel 7 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF8" edc:nzwidth="0x1" edc:desc="XDMAC Channel 8 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF9" edc:nzwidth="0x1" edc:desc="XDMAC Channel 9 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF10" edc:nzwidth="0x1" edc:desc="XDMAC Channel 10 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF11" edc:nzwidth="0x1" edc:desc="XDMAC Channel 11 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF12" edc:nzwidth="0x1" edc:desc="XDMAC Channel 12 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF13" edc:nzwidth="0x1" edc:desc="XDMAC Channel 13 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF14" edc:nzwidth="0x1" edc:desc="XDMAC Channel 14 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF15" edc:nzwidth="0x1" edc:desc="XDMAC Channel 15 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF16" edc:nzwidth="0x1" edc:desc="XDMAC Channel 16 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF17" edc:nzwidth="0x1" edc:desc="XDMAC Channel 17 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF18" edc:nzwidth="0x1" edc:desc="XDMAC Channel 18 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF19" edc:nzwidth="0x1" edc:desc="XDMAC Channel 19 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF20" edc:nzwidth="0x1" edc:desc="XDMAC Channel 20 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF21" edc:nzwidth="0x1" edc:desc="XDMAC Channel 21 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF22" edc:nzwidth="0x1" edc:desc="XDMAC Channel 22 Software Flush Request Bit"/>
            <edc:SFRFieldDef edc:cname="SWF23" edc:nzwidth="0x1" edc:desc="XDMAC Channel 23 Software Flush Request Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40078044"/>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID0XDMAC_CIE" edc:nzwidth="0x20" edc:access="-------------------------wwwwwww" edc:impl="0x7F" edc:_addr="0x40078050">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIE" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="LIE" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="FIE" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="RBIE" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="WBIE" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="ROIE" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Enable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID0XDMAC_CID" edc:nzwidth="0x20" edc:access="-------------------------wwwwwww" edc:impl="0x7F" edc:_addr="0x40078054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BID" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="LID" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DID" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="FID" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="RBEID" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="WBEID" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ROID" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Disable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID0XDMAC_CIM" edc:nzwidth="0x20" edc:access="-------------------------rrrrrrr" edc:impl="0x7F" edc:_addr="0x40078058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIM" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="LIM" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="DIM" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="FIM" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="RBEIM" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="WBEIM" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="ROIM" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Mask Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID0XDMAC_CIS" edc:nzwidth="0x20" edc:access="-------------------------rrrrrrr" edc:impl="0x7F" edc:_addr="0x4007805C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIS" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="LIS" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="DIS" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="FIS" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="RBEIS" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="WBEIS" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="ROIS" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Status Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID0XDMAC_CSA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40078060">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SA" edc:nzwidth="0x20" edc:desc="Channel x Source Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID0XDMAC_CDA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40078064">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DA" edc:nzwidth="0x20" edc:desc="Channel x Destination Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID0XDMAC_CNDA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-n" edc:impl="0xFFFFFFFD" edc:_addr="0x40078068">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="NDAIF" edc:nzwidth="0x1" edc:desc="Channel x Next Descriptor Interface"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NDA" edc:nzwidth="0x1E" edc:desc="Channel x Next Descriptor Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
