Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID6XDMAC_CDS_MSP" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400781FC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SDS_MSP" edc:nzwidth="0x10" edc:desc="Channel x Source Data stride or Memory Set Pattern"/>
            <edc:SFRFieldDef edc:cname="DDS_MSP" edc:nzwidth="0x10" edc:desc="Channel x Destination Data Stride or Memory Set Pattern"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID6XDMAC_CSUS" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40078200">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SUBS" edc:nzwidth="0x18" edc:desc="Channel x Source Microblock Stride"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID6XDMAC_CDUS" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40078204">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DUBS" edc:nzwidth="0x18" edc:desc="Channel x Destination Microblock Stride"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40078208"/>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID7XDMAC_CIE" edc:nzwidth="0x20" edc:access="-------------------------wwwwwww" edc:impl="0x7F" edc:_addr="0x40078210">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIE" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="LIE" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="FIE" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="RBIE" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="WBIE" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="ROIE" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Enable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID7XDMAC_CID" edc:nzwidth="0x20" edc:access="-------------------------wwwwwww" edc:impl="0x7F" edc:_addr="0x40078214">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BID" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="LID" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DID" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="FID" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="RBEID" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="WBEID" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ROID" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Disable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID7XDMAC_CIM" edc:nzwidth="0x20" edc:access="-------------------------rrrrrrr" edc:impl="0x7F" edc:_addr="0x40078218">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIM" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="LIM" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="DIM" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="FIM" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="RBEIM" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="WBEIM" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Mask Bit"/>
            <edc:SFRFieldDef edc:cname="ROIM" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Mask Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID7XDMAC_CIS" edc:nzwidth="0x20" edc:access="-------------------------rrrrrrr" edc:impl="0x7F" edc:_addr="0x4007821C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIS" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="LIS" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="DIS" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="FIS" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="RBEIS" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="WBEIS" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Status Bit"/>
            <edc:SFRFieldDef edc:cname="ROIS" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Status Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID7XDMAC_CSA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40078220">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SA" edc:nzwidth="0x20" edc:desc="Channel x Source Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
