Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID8XDMAC_CNDA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-n" edc:impl="0xFFFFFFFD" edc:_addr="0x40078268">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="NDAIF" edc:nzwidth="0x1" edc:desc="Channel x Next Descriptor Interface"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NDA" edc:nzwidth="0x1E" edc:desc="Channel x Next Descriptor Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID8XDMAC_CNDC" edc:nzwidth="0x20" edc:access="---------------------------nnnnn" edc:impl="0x1F" edc:_addr="0x4007826C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="NDE" edc:nzwidth="0x1" edc:desc="Channel x Next Descriptor Enable">
              <edc:SFRFieldSemantic edc:cname="DSCR_FETCH_DIS" edc:desc="Descriptor fetch is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DSCR_FETCH_EN" edc:desc="Descriptor fetch is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NDSUP" edc:nzwidth="0x1" edc:desc="Channel x Next Descriptor Source Update">
              <edc:SFRFieldSemantic edc:cname="SRC_PARAMS_UNCHANGED" edc:desc="Source parameters remain unchanged." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SRC_PARAMS_UPDATED" edc:desc="Source parameters are updated when the descriptor is retrieved." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NDDUP" edc:nzwidth="0x1" edc:desc="Channel x Next Descriptor Destination Update">
              <edc:SFRFieldSemantic edc:cname="DST_PARAMS_UNCHANGED" edc:desc="Destination parameters remain unchanged." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DST_PARAMS_UPDATED" edc:desc="Destination parameters are updated when the descriptor is retrieved." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NDVIEW" edc:nzwidth="0x2" edc:desc="Channel x Next Descriptor View">
              <edc:SFRFieldSemantic edc:cname="NDV0" edc:desc="Next Descriptor View 0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="NDV1" edc:desc="Next Descriptor View 1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NDV2" edc:desc="Next Descriptor View 2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="NDV3" edc:desc="Next Descriptor View 3" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID8XDMAC_CUBC" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40078270">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="UBLEN" edc:nzwidth="0x18" edc:desc="Channel x Microblock Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID8XDMAC_CBC" edc:nzwidth="0x20" edc:access="--------------------nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0x40078274">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BLEN" edc:nzwidth="0xC" edc:desc="Channel x Block Length"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID8XDMAC_CC" edc:nzwidth="0x20" edc:access="-nnnnnnnnnn-nnnn-nnnnnnnnn-n-nnn" edc:impl="0x7FEF7FD7" edc:_addr="0x40078278">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="TYPE" edc:nzwidth="0x1" edc:desc="Channel x Transfer Type">
              <edc:SFRFieldSemantic edc:cname="MEM_TRAN" edc:desc="Self-triggered mode (memory-to-memory transfer)." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PER_TRAN" edc:desc="Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MBSIZE" edc:nzwidth="0x2" edc:desc="Channel x Memory Burst Size">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="The memory burst size is set to one." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FOUR" edc:desc="The memory burst size is set to four." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT" edc:desc="The memory burst size is set to eight." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEEN" edc:desc="The memory burst size is set to sixteen." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSYNC" edc:nzwidth="0x1" edc:desc="Channel x Synchronization">
              <edc:SFRFieldSemantic edc:cname="PER2MEM" edc:desc="Peripheral-to-memory transfer." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MEM2PER" edc:desc="Memory-to-peripheral transfer." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ" edc:nzwidth="0x1" edc:desc="Channel x Software Request Trigger">
              <edc:SFRFieldSemantic edc:cname="HWR_CONNECTED" edc:desc="Hardware request line is connected to the peripheral request line." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SWR_CONNECTED" edc:desc="Software request is connected to the peripheral request line." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MEMSET" edc:nzwidth="0x1" edc:desc="Channel x Fill Block of memory">
              <edc:SFRFieldSemantic edc:cname="NORMAL_MODE" edc:desc="Memset is not activated." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HW_MODE" edc:desc="Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSIZE" edc:nzwidth="0x3" edc:desc="Channel x Chunk Size">
              <edc:SFRFieldSemantic edc:cname="CHK_1" edc:desc="1 data transferred" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CHK_2" edc:desc="2 data transferred" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CHK_4" edc:desc="4 data transferred" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CHK_8" edc:desc="8 data transferred" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CHK_16" edc:desc="16 data transferred" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DWIDTH" edc:nzwidth="0x2" edc:desc="Channel x Data Width">
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="The data size is set to 8 bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALFWORD" edc:desc="The data size is set to 16 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WORD" edc:desc="The data size is set to 32 bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIF" edc:nzwidth="0x1" edc:desc="Channel x Source Interface Identifier">
              <edc:SFRFieldSemantic edc:cname="AHB_IF0" edc:desc="The data is read through the system bus interface 0." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AHB_IF1" edc:desc="The data is read through the system bus interface 1." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIF" edc:nzwidth="0x1" edc:desc="Channel x Destination Interface Identifier">
              <edc:SFRFieldSemantic edc:cname="AHB_IF0" edc:desc="The data is written through the system bus interface 0." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AHB_IF1" edc:desc="The data is written though the system bus interface 1." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SAM" edc:nzwidth="0x2" edc:desc="Channel x Source Addressing Mode">
              <edc:SFRFieldSemantic edc:cname="FIXED_AM" edc:desc="The address remains unchanged." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="INCREMENTED_AM" edc:desc="The addressing mode is incremented (the increment size is set to the data size)." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UBS_AM" edc:desc="The microblock stride is added at the microblock boundary." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UBS_DS_AM" edc:desc="The microblock stride is added at the microblock boundary, the data stride is added at the data boundary." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DAM" edc:nzwidth="0x2" edc:desc="Channel x Destination Addressing Mode">
              <edc:SFRFieldSemantic edc:cname="FIXED_AM" edc:desc="The address remains unchanged." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="INCREMENTED_AM" edc:desc="The addressing mode is incremented (the increment size is set to the data size)." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UBS_AM" edc:desc="The microblock stride is added at the microblock boundary." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UBS_DS_AM" edc:desc="The microblock stride is added at the microblock boundary; the data stride is added at the data boundary." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INITD" edc:nzwidth="0x1" edc:desc="Channel Initialization Terminated (this bit is read-only)">
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="Channel initialization is in progress." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TERMINATED" edc:desc="Channel initialization is completed." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RDIP" edc:nzwidth="0x1" edc:desc="Read in Progress (this bit is read-only)">
              <edc:SFRFieldSemantic edc:cname="DONE" edc:desc="No active read transaction on the bus." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="A read transaction is in progress." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WRIP" edc:nzwidth="0x1" edc:desc="Write in Progress (this bit is read-only)">
              <edc:SFRFieldSemantic edc:cname="DONE" edc:desc="No active write transaction on the bus." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="A write transaction is in progress." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PERID" edc:nzwidth="0x7" edc:desc="Channel x Peripheral Hardware Request Line Identifier">
              <edc:SFRFieldSemantic edc:cname="HSMCI" edc:desc="HSMCI" edc:when="(field &amp; 0x7F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SPI0_TX" edc:desc="SPI0_TX" edc:when="(field &amp; 0x7F) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SPI0_RX" edc:desc="SPI0_RX" edc:when="(field &amp; 0x7F) == 2"/>
              <edc:SFRFieldSemantic edc:cname="QSPI_TX" edc:desc="QSPI_TX" edc:when="(field &amp; 0x7F) == 5"/>
              <edc:SFRFieldSemantic edc:cname="QSPI_RX" edc:desc="QSPI_RX" edc:when="(field &amp; 0x7F) == 6"/>
              <edc:SFRFieldSemantic edc:cname="USART0_TX" edc:desc="USART0_TX" edc:when="(field &amp; 0x7F) == 7"/>
              <edc:SFRFieldSemantic edc:cname="USART0_RX" edc:desc="USART0_RX" edc:when="(field &amp; 0x7F) == 8"/>
              <edc:SFRFieldSemantic edc:cname="USART1_TX" edc:desc="USART1_TX" edc:when="(field &amp; 0x7F) == 9"/>
              <edc:SFRFieldSemantic edc:cname="USART1_RX" edc:desc="USART1_RX" edc:when="(field &amp; 0x7F) == 10"/>
              <edc:SFRFieldSemantic edc:cname="USART2_TX" edc:desc="USART2_TX" edc:when="(field &amp; 0x7F) == 11"/>
              <edc:SFRFieldSemantic edc:cname="USART2_RX" edc:desc="USART2_RX" edc:when="(field &amp; 0x7F) == 12"/>
              <edc:SFRFieldSemantic edc:cname="PWM0" edc:desc="PWM0" edc:when="(field &amp; 0x7F) == 13"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS0_TX" edc:desc="TWIHS0_TX" edc:when="(field &amp; 0x7F) == 14"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS0_RX" edc:desc="TWIHS0_RX" edc:when="(field &amp; 0x7F) == 15"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS1_TX" edc:desc="TWIHS1_TX" edc:when="(field &amp; 0x7F) == 16"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS1_RX" edc:desc="TWIHS1_RX" edc:when="(field &amp; 0x7F) == 17"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS2_TX" edc:desc="TWIHS2_TX" edc:when="(field &amp; 0x7F) == 18"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS2_RX" edc:desc="TWIHS2_RX" edc:when="(field &amp; 0x7F) == 19"/>
              <edc:SFRFieldSemantic edc:cname="UART0_TX" edc:desc="UART0_TX" edc:when="(field &amp; 0x7F) == 20"/>
              <edc:SFRFieldSemantic edc:cname="UART0_RX" edc:desc="UART0_RX" edc:when="(field &amp; 0x7F) == 21"/>
              <edc:SFRFieldSemantic edc:cname="UART1_TX" edc:desc="UART1_TX" edc:when="(field &amp; 0x7F) == 22"/>
              <edc:SFRFieldSemantic edc:cname="UART1_RX" edc:desc="UART1_RX" edc:when="(field &amp; 0x7F) == 23"/>
              <edc:SFRFieldSemantic edc:cname="UART2_TX" edc:desc="UART2_TX" edc:when="(field &amp; 0x7F) == 24"/>
              <edc:SFRFieldSemantic edc:cname="UART2_RX" edc:desc="UART2_RX" edc:when="(field &amp; 0x7F) == 25"/>
              <edc:SFRFieldSemantic edc:cname="UART3_TX" edc:desc="UART3_TX" edc:when="(field &amp; 0x7F) == 26"/>
              <edc:SFRFieldSemantic edc:cname="UART3_RX" edc:desc="UART3_RX" edc:when="(field &amp; 0x7F) == 27"/>
              <edc:SFRFieldSemantic edc:cname="UART4_TX" edc:desc="UART4_TX" edc:when="(field &amp; 0x7F) == 28"/>
              <edc:SFRFieldSemantic edc:cname="UART4_RX" edc:desc="UART4_RX" edc:when="(field &amp; 0x7F) == 29"/>
              <edc:SFRFieldSemantic edc:cname="DACC0" edc:desc="DACC0" edc:when="(field &amp; 0x7F) == 30"/>
              <edc:SFRFieldSemantic edc:cname="DACC1" edc:desc="DACC1" edc:when="(field &amp; 0x7F) == 31"/>
              <edc:SFRFieldSemantic edc:cname="SSC_TX" edc:desc="SSC_TX" edc:when="(field &amp; 0x7F) == 32"/>
              <edc:SFRFieldSemantic edc:cname="SSC_RX" edc:desc="SSC_RX" edc:when="(field &amp; 0x7F) == 33"/>
              <edc:SFRFieldSemantic edc:cname="PIOA" edc:desc="PIOA" edc:when="(field &amp; 0x7F) == 34"/>
              <edc:SFRFieldSemantic edc:cname="AFEC0" edc:desc="AFEC0" edc:when="(field &amp; 0x7F) == 35"/>
              <edc:SFRFieldSemantic edc:cname="AFEC1" edc:desc="AFEC1" edc:when="(field &amp; 0x7F) == 36"/>
              <edc:SFRFieldSemantic edc:cname="AES_TX" edc:desc="AES_TX" edc:when="(field &amp; 0x7F) == 37"/>
              <edc:SFRFieldSemantic edc:cname="AES_RX" edc:desc="AES_RX" edc:when="(field &amp; 0x7F) == 38"/>
              <edc:SFRFieldSemantic edc:cname="PWM1" edc:desc="PWM1" edc:when="(field &amp; 0x7F) == 39"/>
              <edc:SFRFieldSemantic edc:cname="TC0" edc:desc="TC0" edc:when="(field &amp; 0x7F) == 40"/>
              <edc:SFRFieldSemantic edc:cname="TC3" edc:desc="TC3" edc:when="(field &amp; 0x7F) == 41"/>
              <edc:SFRFieldSemantic edc:cname="TC6" edc:desc="TC6" edc:when="(field &amp; 0x7F) == 42"/>
              <edc:SFRFieldSemantic edc:cname="TC9" edc:desc="TC9" edc:when="(field &amp; 0x7F) == 43"/>
              <edc:SFRFieldSemantic edc:cname="I2SC0_TX_LEFT" edc:desc="I2SC0_TX_LEFT" edc:when="(field &amp; 0x7F) == 44"/>
              <edc:SFRFieldSemantic edc:cname="I2SC0_RX_LEFT" edc:desc="I2SC0_RX_LEFT" edc:when="(field &amp; 0x7F) == 45"/>
              <edc:SFRFieldSemantic edc:cname="I2SC0_TX_RIGHT" edc:desc="I2SC0_TX_RIGHT" edc:when="(field &amp; 0x7F) == 48"/>
              <edc:SFRFieldSemantic edc:cname="I2SC0_RX_RIGHT" edc:desc="I2SC0_RX_RIGHT" edc:when="(field &amp; 0x7F) == 49"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID8XDMAC_CDS_MSP" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4007827C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SDS_MSP" edc:nzwidth="0x10" edc:desc="Channel x Source Data stride or Memory Set Pattern"/>
            <edc:SFRFieldDef edc:cname="DDS_MSP" edc:nzwidth="0x10" edc:desc="Channel x Destination Data Stride or Memory Set Pattern"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID8XDMAC_CSUS" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40078280">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SUBS" edc:nzwidth="0x18" edc:desc="Channel x Source Microblock Stride"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID8XDMAC_CDUS" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x40078284">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DUBS" edc:nzwidth="0x18" edc:desc="Channel x Destination Microblock Stride"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40078288"/>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID9XDMAC_CIE" edc:nzwidth="0x20" edc:access="-------------------------wwwwwww" edc:impl="0x7F" edc:_addr="0x40078290">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BIE" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="LIE" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="DIE" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="FIE" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="RBIE" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="WBIE" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Enable Bit"/>
            <edc:SFRFieldDef edc:cname="ROIE" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Enable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="XDMAC" edc:cname="XDMAC_CHID9XDMAC_CID" edc:nzwidth="0x20" edc:access="-------------------------wwwwwww" edc:impl="0x7F" edc:_addr="0x40078294">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BID" edc:nzwidth="0x1" edc:desc="End of Block Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="LID" edc:nzwidth="0x1" edc:desc="End of Linked List Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="DID" edc:nzwidth="0x1" edc:desc="End of Disable Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="FID" edc:nzwidth="0x1" edc:desc="End of Flush Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="RBEID" edc:nzwidth="0x1" edc:desc="Read Bus Error Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="WBEID" edc:nzwidth="0x1" edc:desc="Write Bus Error Interrupt Disable Bit"/>
            <edc:SFRFieldDef edc:cname="ROID" edc:nzwidth="0x1" edc:desc="Request Overflow Error Interrupt Disable Bit"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
