Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:AdjustPoint edc:offset="0x38" edc:_addr="0x400880C8"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_MRCR" edc:nzwidth="0x20" edc:access="-------------------nnn-nnnnnnnnn" edc:impl="0x1DFF" edc:_addr="0x40088100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="RCB0" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 0"/>
            <edc:SFRFieldDef edc:cname="RCB1" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 1"/>
            <edc:SFRFieldDef edc:cname="RCB2" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 2"/>
            <edc:SFRFieldDef edc:cname="RCB3" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 3"/>
            <edc:SFRFieldDef edc:cname="RCB4" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 4"/>
            <edc:SFRFieldDef edc:cname="RCB5" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 5"/>
            <edc:SFRFieldDef edc:cname="RCB6" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 6"/>
            <edc:SFRFieldDef edc:cname="RCB7" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 7"/>
            <edc:SFRFieldDef edc:cname="RCB8" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 8"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RCB10" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 10"/>
            <edc:SFRFieldDef edc:cname="RCB11" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 11"/>
            <edc:SFRFieldDef edc:cname="RCB12" edc:nzwidth="0x1" edc:desc="Remap Command Bit for Master 12"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40088104"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="CCFG_CAN0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn----------------" edc:impl="0xFFFF0000" edc:_addr="0x40088110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="CAN0DMABA" edc:nzwidth="0x10" edc:desc="CAN0 DMA Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="CCFG_SYSIO" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---n----nnnn----" edc:impl="0xFFFF10F0" edc:_addr="0x40088114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO4" edc:nzwidth="0x1" edc:desc="PB4 or TDI Assignment"/>
            <edc:SFRFieldDef edc:cname="SYSIO5" edc:nzwidth="0x1" edc:desc="PB5 or TDO/TRACESWO Assignment"/>
            <edc:SFRFieldDef edc:cname="SYSIO6" edc:nzwidth="0x1" edc:desc="PB6 or TMS/SWDIO Assignment"/>
            <edc:SFRFieldDef edc:cname="SYSIO7" edc:nzwidth="0x1" edc:desc="PB7 or TCK/SWCLK Assignment"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SYSIO12" edc:nzwidth="0x1" edc:desc="PB12 or ERASE Assignment"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CAN1DMABA" edc:nzwidth="0x10" edc:desc="CAN1 DMA Base Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="CCFG_PCCR" edc:nzwidth="0x20" edc:access="---------nnn--------------------" edc:impl="0x700000" edc:_addr="0x40088118">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="TC0CC" edc:nzwidth="0x1" edc:desc="TC0 Clock Configuration"/>
            <edc:SFRFieldDef edc:cname="I2SC0CC" edc:nzwidth="0x1" edc:desc="I2SC0 Clock Configuration"/>
            <edc:SFRFieldDef edc:cname="I2SC1CC" edc:nzwidth="0x1" edc:desc="I2SC1 Clock Configuration"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="CCFG_DYNCKG" edc:nzwidth="0x20" edc:access="-----------------------------nnn" edc:impl="0x7" edc:_addr="0x4008811C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="MATCKG" edc:nzwidth="0x1" edc:desc="MATRIX Dynamic Clock Gating"/>
            <edc:SFRFieldDef edc:cname="BRIDCKG" edc:nzwidth="0x1" edc:desc="Bridge Dynamic Clock Gating Enable"/>
            <edc:SFRFieldDef edc:cname="EFCCKG" edc:nzwidth="0x1" edc:desc="EFC Dynamic Clock Gating Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x40088120"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="CCFG_SMCNFCS" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:impl="0xF" edc:_addr="0x40088124">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="SMC_NFCS0" edc:nzwidth="0x1" edc:desc="SMC NAND Flash Chip Select 0 Assignment"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS1" edc:nzwidth="0x1" edc:desc="SMC NAND Flash Chip Select 1 Assignment"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS2" edc:nzwidth="0x1" edc:desc="SMC NAND Flash Chip Select 2 Assignment"/>
            <edc:SFRFieldDef edc:cname="SMC_NFCS3" edc:nzwidth="0x1" edc:desc="SMC NAND Flash Chip Select 3 Assignment"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xBC" edc:_addr="0x40088128"/>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400881E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x4D4154"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MATRIX" edc:cname="MATRIX_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400881E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MATRIX">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3E14" edc:_addr="0x400881EC"/>
      <edc:SFRDef ltx:memberofperipheral="I2SC0" edc:cname="I2SC0_CR" edc:nzwidth="0x20" edc:access="------------------------w-wwwwww" edc:impl="0xBF" edc:_addr="0x4008C000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Receiver Enable"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:nzwidth="0x1" edc:desc="Receiver Disable"/>
            <edc:SFRFieldDef edc:cname="CKEN" edc:nzwidth="0x1" edc:desc="Clocks Enable"/>
            <edc:SFRFieldDef edc:cname="CKDIS" edc:nzwidth="0x1" edc:desc="Clocks Disable"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:nzwidth="0x1" edc:desc="Transmitter Enable"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:nzwidth="0x1" edc:desc="Transmitter Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2SC0" edc:cname="I2SC0_MR" edc:nzwidth="0x20" edc:access="nnnnnnnn--nnnnnn-nnn-nnn---nnn-n" edc:impl="0xFF3F771D" edc:_addr="0x4008C004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:SFRFieldDef edc:cname="MODE" edc:nzwidth="0x1" edc:desc="Inter-IC Sound Controller Mode">
              <edc:SFRFieldSemantic edc:cname="SLAVE" edc:desc="I2SC_CK and I2SC_WS pin inputs used as bit clock and word select/frame synchronization." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MASTER" edc:desc="Bit clock and word select/frame synchronization generated by I2SC from MCK and output to I2SC_CK and I2SC_WS pins. Peripheral clock or GCLK is output as master clock on I2SC_MCK if I2SC_MR.IMCKMODE is set." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DATALENGTH" edc:nzwidth="0x3" edc:desc="Data Word Length">
              <edc:SFRFieldSemantic edc:cname="_32_BITS" edc:desc="Data length is set to 32 bits" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_24_BITS" edc:desc="Data length is set to 24 bits" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_20_BITS" edc:desc="Data length is set to 20 bits" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_18_BITS" edc:desc="Data length is set to 18 bits" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="_16_BITS" edc:desc="Data length is set to 16 bits" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="_16_BITS_COMPACT" edc:desc="Data length is set to 16-bit compact stereo. Left sample in bits 15:0 and right sample in bits 31:16 of same word." edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="_8_BITS" edc:desc="Data length is set to 8 bits" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="_8_BITS_COMPACT" edc:desc="Data length is set to 8-bit compact stereo. Left sample in bits 7:0 and right sample in bits 15:8 of the same word." edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RXMONO" edc:nzwidth="0x1" edc:desc="Receive Mono"/>
            <edc:SFRFieldDef edc:cname="RXDMA" edc:nzwidth="0x1" edc:desc="Single or Multiple DMA Controller Channels for Receiver"/>
            <edc:SFRFieldDef edc:cname="RXLOOP" edc:nzwidth="0x1" edc:desc="Loopback Test Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXMONO" edc:nzwidth="0x1" edc:desc="Transmit Mono"/>
            <edc:SFRFieldDef edc:cname="TXDMA" edc:nzwidth="0x1" edc:desc="Single or Multiple DMA Controller Channels for Transmitter"/>
            <edc:SFRFieldDef edc:cname="TXSAME" edc:nzwidth="0x1" edc:desc="Transmit Data when Underrun"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="IMCKDIV" edc:nzwidth="0x6" edc:desc="Selected Clock to I2SC Master Clock Ratio"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="IMCKFS" edc:nzwidth="0x6" edc:desc="Master Clock to fs Ratio">
              <edc:SFRFieldSemantic edc:cname="M2SF32" edc:desc="Sample frequency ratio set to 32" edc:when="(field &amp; 0x3F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="M2SF64" edc:desc="Sample frequency ratio set to 64" edc:when="(field &amp; 0x3F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="M2SF96" edc:desc="Sample frequency ratio set to 96" edc:when="(field &amp; 0x3F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="M2SF128" edc:desc="Sample frequency ratio set to 128" edc:when="(field &amp; 0x3F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="M2SF192" edc:desc="Sample frequency ratio set to 192" edc:when="(field &amp; 0x3F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="M2SF256" edc:desc="Sample frequency ratio set to 256" edc:when="(field &amp; 0x3F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="M2SF384" edc:desc="Sample frequency ratio set to 384" edc:when="(field &amp; 0x3F) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="M2SF512" edc:desc="Sample frequency ratio set to 512" edc:when="(field &amp; 0x3F) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="M2SF768" edc:desc="Sample frequency ratio set to 768" edc:when="(field &amp; 0x3F) == 0x17"/>
              <edc:SFRFieldSemantic edc:cname="M2SF1024" edc:desc="Sample frequency ratio set to 1024" edc:when="(field &amp; 0x3F) == 0x1F"/>
              <edc:SFRFieldSemantic edc:cname="M2SF1536" edc:desc="Sample frequency ratio set to 1536" edc:when="(field &amp; 0x3F) == 0x2F"/>
              <edc:SFRFieldSemantic edc:cname="M2SF2048" edc:desc="Sample frequency ratio set to 2048" edc:when="(field &amp; 0x3F) == 0x3F"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="IMCKMODE" edc:nzwidth="0x1" edc:desc="Master Clock Mode"/>
            <edc:SFRFieldDef edc:cname="IWS" edc:nzwidth="0x1" edc:desc="I2SC_WS Slot Width"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2SC0" edc:cname="I2SC0_SR" edc:nzwidth="0x20" edc:access="----------rr----------rr-rrr-rrr" edc:impl="0x300377" edc:_addr="0x4008C008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Receiver Enabled"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Ready"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:nzwidth="0x1" edc:desc="Receive Overrun"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:nzwidth="0x1" edc:desc="Transmitter Enabled"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:nzwidth="0x1" edc:desc="Transmit Underrun"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXORCH" edc:nzwidth="0x2" edc:desc="Receive Overrun Channel"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="TXURCH" edc:nzwidth="0x2" edc:desc="Transmit Underrun Channel"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2SC0" edc:cname="I2SC0_SCR" edc:nzwidth="0x20" edc:access="----------ww----------ww-w---w--" edc:impl="0x300344" edc:_addr="0x4008C00C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:nzwidth="0x1" edc:desc="Receive Overrun Status Clear"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:nzwidth="0x1" edc:desc="Transmit Underrun Status Clear"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXORCH" edc:nzwidth="0x2" edc:desc="Receive Overrun Per Channel Status Clear"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="TXURCH" edc:nzwidth="0x2" edc:desc="Transmit Underrun Per Channel Status Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2SC0" edc:cname="I2SC0_SSR" edc:nzwidth="0x20" edc:access="----------ww----------ww-w---w--" edc:impl="0x300344" edc:_addr="0x4008C010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:nzwidth="0x1" edc:desc="Receive Overrun Status Set"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:nzwidth="0x1" edc:desc="Transmit Underrun Status Set"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXORCH" edc:nzwidth="0x2" edc:desc="Receive Overrun Per Channel Status Set"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="TXURCH" edc:nzwidth="0x2" edc:desc="Transmit Underrun Per Channel Status Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2SC0" edc:cname="I2SC0_IER" edc:nzwidth="0x20" edc:access="-------------------------ww--ww-" edc:impl="0x66" edc:_addr="0x4008C014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receiver Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:nzwidth="0x1" edc:desc="Receiver Overrun Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:nzwidth="0x1" edc:desc="Transmit Underflow Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2SC0" edc:cname="I2SC0_IDR" edc:nzwidth="0x20" edc:access="-------------------------ww--ww-" edc:impl="0x66" edc:_addr="0x4008C018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receiver Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:nzwidth="0x1" edc:desc="Receiver Overrun Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:nzwidth="0x1" edc:desc="Transmit Underflow Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2SC0" edc:cname="I2SC0_IMR" edc:nzwidth="0x20" edc:access="-------------------------rr--rr-" edc:impl="0x66" edc:_addr="0x4008C01C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receiver Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXOR" edc:nzwidth="0x1" edc:desc="Receiver Overrun Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXUR" edc:nzwidth="0x1" edc:desc="Transmit Underflow Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2SC0" edc:cname="I2SC0_RHR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4008C020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:SFRFieldDef edc:cname="RHR" edc:nzwidth="0x20" edc:desc="Receiver Holding Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="I2SC0" edc:cname="I2SC0_THR" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:_addr="0x4008C024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="I2SC0">
            <edc:SFRFieldDef edc:cname="THR" edc:nzwidth="0x20" edc:desc="Transmitter Holding Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
