Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:AdjustPoint edc:offset="0x543E8" edc:_addr="0x4008C028"/>
      <edc:SFRDef ltx:memberofperipheral="UTMI" edc:cname="UTMI_OHCIICR" edc:nzwidth="0x20" edc:access="--------n-----------------nn---n" edc:impl="0x800031" edc:_addr="0x400E0410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UTMI">
            <edc:SFRFieldDef edc:cname="RES0" edc:nzwidth="0x1" edc:desc="USB PORTx Reset"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ARIE" edc:nzwidth="0x1" edc:desc="OHCI Asynchronous Resume Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="APPSTART" edc:nzwidth="0x1" edc:desc="Reserved"/>
            <edc:AdjustPoint edc:offset="0x11"/>
            <edc:SFRFieldDef edc:cname="UDPPUDIS" edc:nzwidth="0x1" edc:desc="USB Device Pull-up Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x400E0414"/>
      <edc:SFRDef ltx:memberofperipheral="UTMI" edc:cname="UTMI_CKTRIM" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x400E0430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UTMI">
            <edc:SFRFieldDef edc:cname="FREQ" edc:nzwidth="0x2" edc:desc="UTMI Reference Clock Frequency">
              <edc:SFRFieldSemantic edc:cname="XTAL12" edc:desc="12 MHz reference clock" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="XTAL16" edc:desc="16 MHz reference clock" edc:when="(field &amp; 0x3) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1CC" edc:_addr="0x400E0434"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SCER" edc:nzwidth="0x20" edc:access="----------------wwwwwwww--w-----" edc:impl="0xFF20" edc:_addr="0x400E0600">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="USBCLK" edc:nzwidth="0x1" edc:desc="Enable USB FS Clock"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:nzwidth="0x1" edc:desc="Programmable Clock 0 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:nzwidth="0x1" edc:desc="Programmable Clock 1 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:nzwidth="0x1" edc:desc="Programmable Clock 2 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:nzwidth="0x1" edc:desc="Programmable Clock 3 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK4" edc:nzwidth="0x1" edc:desc="Programmable Clock 4 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK5" edc:nzwidth="0x1" edc:desc="Programmable Clock 5 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK6" edc:nzwidth="0x1" edc:desc="Programmable Clock 6 Output Enable"/>
            <edc:SFRFieldDef edc:cname="PCK7" edc:nzwidth="0x1" edc:desc="Programmable Clock 7 Output Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SCDR" edc:nzwidth="0x20" edc:access="----------------wwwwwwww--w-----" edc:impl="0xFF20" edc:_addr="0x400E0604">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="USBCLK" edc:nzwidth="0x1" edc:desc="Disable USB FS Clock"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:nzwidth="0x1" edc:desc="Programmable Clock 0 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:nzwidth="0x1" edc:desc="Programmable Clock 1 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:nzwidth="0x1" edc:desc="Programmable Clock 2 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:nzwidth="0x1" edc:desc="Programmable Clock 3 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK4" edc:nzwidth="0x1" edc:desc="Programmable Clock 4 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK5" edc:nzwidth="0x1" edc:desc="Programmable Clock 5 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK6" edc:nzwidth="0x1" edc:desc="Programmable Clock 6 Output Disable"/>
            <edc:SFRFieldDef edc:cname="PCK7" edc:nzwidth="0x1" edc:desc="Programmable Clock 7 Output Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SCSR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrr--r----r" edc:impl="0xFF21" edc:_addr="0x400E0608">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="HCLKS" edc:nzwidth="0x1" edc:desc="HCLK Status"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="USBCLK" edc:nzwidth="0x1" edc:desc="USB FS Clock Status"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PCK0" edc:nzwidth="0x1" edc:desc="Programmable Clock 0 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK1" edc:nzwidth="0x1" edc:desc="Programmable Clock 1 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK2" edc:nzwidth="0x1" edc:desc="Programmable Clock 2 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK3" edc:nzwidth="0x1" edc:desc="Programmable Clock 3 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK4" edc:nzwidth="0x1" edc:desc="Programmable Clock 4 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK5" edc:nzwidth="0x1" edc:desc="Programmable Clock 5 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK6" edc:nzwidth="0x1" edc:desc="Programmable Clock 6 Output Status"/>
            <edc:SFRFieldDef edc:cname="PCK7" edc:nzwidth="0x1" edc:desc="Programmable Clock 7 Output Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400E060C"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCER0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwww-wwww-ww-ww-------" edc:impl="0xFFFDED80" edc:_addr="0x400E0610">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:nzwidth="0x1" edc:desc="Peripheral Clock 7 Enable"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral Clock 8 Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral Clock 10 Enable"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral Clock 11 Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral Clock 13 Enable"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral Clock 14 Enable"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:nzwidth="0x1" edc:desc="Peripheral Clock 15 Enable"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral Clock 16 Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:nzwidth="0x1" edc:desc="Peripheral Clock 18 Enable"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:nzwidth="0x1" edc:desc="Peripheral Clock 19 Enable"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:nzwidth="0x1" edc:desc="Peripheral Clock 20 Enable"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:nzwidth="0x1" edc:desc="Peripheral Clock 21 Enable"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral Clock 22 Enable"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral Clock 23 Enable"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral Clock 24 Enable"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral Clock 25 Enable"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral Clock 26 Enable"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral Clock 27 Enable"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral Clock 28 Enable"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral Clock 29 Enable"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:nzwidth="0x1" edc:desc="Peripheral Clock 30 Enable"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:nzwidth="0x1" edc:desc="Peripheral Clock 31 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCDR0" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwww-wwww-ww-ww-------" edc:impl="0xFFFDED80" edc:_addr="0x400E0614">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:nzwidth="0x1" edc:desc="Peripheral Clock 7 Disable"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral Clock 8 Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral Clock 10 Disable"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral Clock 11 Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral Clock 13 Disable"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral Clock 14 Disable"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:nzwidth="0x1" edc:desc="Peripheral Clock 15 Disable"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral Clock 16 Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:nzwidth="0x1" edc:desc="Peripheral Clock 18 Disable"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:nzwidth="0x1" edc:desc="Peripheral Clock 19 Disable"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:nzwidth="0x1" edc:desc="Peripheral Clock 20 Disable"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:nzwidth="0x1" edc:desc="Peripheral Clock 21 Disable"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral Clock 22 Disable"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral Clock 23 Disable"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral Clock 24 Disable"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral Clock 25 Disable"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral Clock 26 Disable"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral Clock 27 Disable"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral Clock 28 Disable"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral Clock 29 Disable"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:nzwidth="0x1" edc:desc="Peripheral Clock 30 Disable"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:nzwidth="0x1" edc:desc="Peripheral Clock 31 Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCSR0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrr-rrrr-rr-rr-------" edc:impl="0xFFFDED80" edc:_addr="0x400E0618">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:nzwidth="0x1" edc:desc="Peripheral Clock 7 Status"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:nzwidth="0x1" edc:desc="Peripheral Clock 8 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:nzwidth="0x1" edc:desc="Peripheral Clock 10 Status"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:nzwidth="0x1" edc:desc="Peripheral Clock 11 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:nzwidth="0x1" edc:desc="Peripheral Clock 13 Status"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:nzwidth="0x1" edc:desc="Peripheral Clock 14 Status"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:nzwidth="0x1" edc:desc="Peripheral Clock 15 Status"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:nzwidth="0x1" edc:desc="Peripheral Clock 16 Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:nzwidth="0x1" edc:desc="Peripheral Clock 18 Status"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:nzwidth="0x1" edc:desc="Peripheral Clock 19 Status"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:nzwidth="0x1" edc:desc="Peripheral Clock 20 Status"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:nzwidth="0x1" edc:desc="Peripheral Clock 21 Status"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:nzwidth="0x1" edc:desc="Peripheral Clock 22 Status"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:nzwidth="0x1" edc:desc="Peripheral Clock 23 Status"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:nzwidth="0x1" edc:desc="Peripheral Clock 24 Status"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:nzwidth="0x1" edc:desc="Peripheral Clock 25 Status"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:nzwidth="0x1" edc:desc="Peripheral Clock 26 Status"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:nzwidth="0x1" edc:desc="Peripheral Clock 27 Status"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:nzwidth="0x1" edc:desc="Peripheral Clock 28 Status"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:nzwidth="0x1" edc:desc="Peripheral Clock 29 Status"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:nzwidth="0x1" edc:desc="Peripheral Clock 30 Status"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:nzwidth="0x1" edc:desc="Peripheral Clock 31 Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
