Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="CKGR_UCKR" edc:nzwidth="0x20" edc:access="--------nnnn---n----------------" edc:impl="0xF10000" edc:_addr="0x400E061C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="UPLLEN" edc:nzwidth="0x1" edc:desc="UTMI PLL Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="UPLLCOUNT" edc:nzwidth="0x4" edc:desc="UTMI PLL Start-up Time"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="CKGR_MOR" edc:nzwidth="0x20" edc:access="-----nnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:impl="0x7FFFF7F" edc:_addr="0x400E0620">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTEN" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="MOSCXTBY" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Bypass"/>
            <edc:SFRFieldDef edc:cname="WAITMODE" edc:nzwidth="0x1" edc:desc="Wait Mode Command (Write-only)"/>
            <edc:SFRFieldDef edc:cname="MOSCRCEN" edc:nzwidth="0x1" edc:desc="Main RC Oscillator Enable"/>
            <edc:SFRFieldDef edc:cname="MOSCRCF" edc:nzwidth="0x3" edc:desc="Main RC Oscillator Frequency Selection">
              <edc:SFRFieldSemantic edc:cname="_4_MHz" edc:desc="The RC oscillator frequency is at 4 MHz" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_8_MHz" edc:desc="The RC oscillator frequency is at 8 MHz" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_12_MHz" edc:desc="The RC oscillator frequency is at 12 MHz" edc:when="(field &amp; 0x7) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MOSCXTST" edc:nzwidth="0x8" edc:desc="Main Crystal Oscillator Startup Time"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Write Access Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0x37"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MOSCSEL" edc:nzwidth="0x1" edc:desc="Main Clock Oscillator Selection"/>
            <edc:SFRFieldDef edc:cname="CFDEN" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Enable"/>
            <edc:SFRFieldDef edc:cname="XT32KFME" edc:nzwidth="0x1" edc:desc="32.768 kHz Crystal Oscillator Frequency Monitoring Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="CKGR_MCFR" edc:nzwidth="0x20" edc:access="-------n---n---nnnnnnnnnnnnnnnnn" edc:impl="0x111FFFF" edc:_addr="0x400E0624">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MAINF" edc:nzwidth="0x10" edc:desc="Main Clock Frequency"/>
            <edc:SFRFieldDef edc:cname="MAINFRDY" edc:nzwidth="0x1" edc:desc="Main Clock Frequency Measure Ready"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RCMEAS" edc:nzwidth="0x1" edc:desc="RC Oscillator Frequency Measure (write-only)"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CCSS" edc:nzwidth="0x1" edc:desc="Counter Clock Source Selection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="CKGR_PLLAR" edc:nzwidth="0x20" edc:access="--n--nnnnnnnnnnn--nnnnnnnnnnnnnn" edc:impl="0x27FF3FFF" edc:_addr="0x400E0628">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="DIVA" edc:nzwidth="0x8" edc:desc="PLLA Front End Divider">
              <edc:SFRFieldSemantic edc:cname="_0" edc:desc="Divider output is 0 and PLLA is disabled." edc:when="(field &amp; 0xFF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="BYPASS" edc:desc="Divider is bypassed (divide by 1) and PLLA is enabled." edc:when="(field &amp; 0xFF) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PLLACOUNT" edc:nzwidth="0x6" edc:desc="PLLA Counter"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MULA" edc:nzwidth="0xB" edc:desc="PLLA Multiplier"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ONE" edc:nzwidth="0x1" edc:desc="Must Be Set to 1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x400E062C"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_MCKR" edc:nzwidth="0x20" edc:access="------------------n---nn-nnn--nn" edc:impl="0x2373" edc:_addr="0x400E0630">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="CSS" edc:nzwidth="0x2" edc:desc="Master Clock Source Selection">
              <edc:SFRFieldSemantic edc:cname="SLOW_CLK" edc:desc="Slow Clock is selected" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MAIN_CLK" edc:desc="Main Clock is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PLLA_CLK" edc:desc="PLLA Clock is selected" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UPLL_CLK" edc:desc="Divided UPLL Clock is selected" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PRES" edc:nzwidth="0x3" edc:desc="Processor Clock Prescaler">
              <edc:SFRFieldSemantic edc:cname="CLK_1" edc:desc="Selected clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_2" edc:desc="Selected clock divided by 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLK_4" edc:desc="Selected clock divided by 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLK_8" edc:desc="Selected clock divided by 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CLK_16" edc:desc="Selected clock divided by 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CLK_32" edc:desc="Selected clock divided by 32" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CLK_64" edc:desc="Selected clock divided by 64" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="CLK_3" edc:desc="Selected clock divided by 3" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MDIV" edc:nzwidth="0x2" edc:desc="Master Clock Division">
              <edc:SFRFieldSemantic edc:cname="EQ_PCK" edc:desc="Master Clock is Prescaler Output Clock divided by 1." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PCK_DIV2" edc:desc="Master Clock is Prescaler Output Clock divided by 2." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PCK_DIV4" edc:desc="Master Clock is Prescaler Output Clock divided by 4." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PCK_DIV3" edc:desc="Master Clock is Prescaler Output Clock divided by 3." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="UPLLDIV2" edc:nzwidth="0x1" edc:desc="UPLL Divider by 2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
