Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_FOCR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x400E0678">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FOCLR" edc:nzwidth="0x1" edc:desc="Fault Output Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x68" edc:_addr="0x400E067C"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400E06E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x504D43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400E06E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x400E06EC"/>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCER1" edc:nzwidth="0x20" edc:access="---wwwww--wwwwwwwwwww-ww--w-wwww" edc:impl="0x1F3FFB2F" edc:_addr="0x400E0700">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:nzwidth="0x1" edc:desc="Peripheral Clock 32 Enable"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:nzwidth="0x1" edc:desc="Peripheral Clock 33 Enable"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:nzwidth="0x1" edc:desc="Peripheral Clock 34 Enable"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:nzwidth="0x1" edc:desc="Peripheral Clock 35 Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:nzwidth="0x1" edc:desc="Peripheral Clock 37 Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:nzwidth="0x1" edc:desc="Peripheral Clock 40 Enable"/>
            <edc:SFRFieldDef edc:cname="PID41" edc:nzwidth="0x1" edc:desc="Peripheral Clock 41 Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:nzwidth="0x1" edc:desc="Peripheral Clock 43 Enable"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:nzwidth="0x1" edc:desc="Peripheral Clock 44 Enable"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:nzwidth="0x1" edc:desc="Peripheral Clock 45 Enable"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:nzwidth="0x1" edc:desc="Peripheral Clock 46 Enable"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:nzwidth="0x1" edc:desc="Peripheral Clock 47 Enable"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:nzwidth="0x1" edc:desc="Peripheral Clock 48 Enable"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:nzwidth="0x1" edc:desc="Peripheral Clock 49 Enable"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:nzwidth="0x1" edc:desc="Peripheral Clock 50 Enable"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:nzwidth="0x1" edc:desc="Peripheral Clock 51 Enable"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:nzwidth="0x1" edc:desc="Peripheral Clock 52 Enable"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:nzwidth="0x1" edc:desc="Peripheral Clock 53 Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:nzwidth="0x1" edc:desc="Peripheral Clock 56 Enable"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:nzwidth="0x1" edc:desc="Peripheral Clock 57 Enable"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:nzwidth="0x1" edc:desc="Peripheral Clock 58 Enable"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:nzwidth="0x1" edc:desc="Peripheral Clock 59 Enable"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:nzwidth="0x1" edc:desc="Peripheral Clock 60 Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_PCDR1" edc:nzwidth="0x20" edc:access="---wwwww--wwwwwwwwwww-ww--w-wwww" edc:impl="0x1F3FFB2F" edc:_addr="0x400E0704">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="PID32" edc:nzwidth="0x1" edc:desc="Peripheral Clock 32 Disable"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:nzwidth="0x1" edc:desc="Peripheral Clock 33 Disable"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:nzwidth="0x1" edc:desc="Peripheral Clock 34 Disable"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:nzwidth="0x1" edc:desc="Peripheral Clock 35 Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:nzwidth="0x1" edc:desc="Peripheral Clock 37 Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:nzwidth="0x1" edc:desc="Peripheral Clock 40 Disable"/>
            <edc:SFRFieldDef edc:cname="PID41" edc:nzwidth="0x1" edc:desc="Peripheral Clock 41 Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:nzwidth="0x1" edc:desc="Peripheral Clock 43 Disable"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:nzwidth="0x1" edc:desc="Peripheral Clock 44 Disable"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:nzwidth="0x1" edc:desc="Peripheral Clock 45 Disable"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:nzwidth="0x1" edc:desc="Peripheral Clock 46 Disable"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:nzwidth="0x1" edc:desc="Peripheral Clock 47 Disable"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:nzwidth="0x1" edc:desc="Peripheral Clock 48 Disable"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:nzwidth="0x1" edc:desc="Peripheral Clock 49 Disable"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:nzwidth="0x1" edc:desc="Peripheral Clock 50 Disable"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:nzwidth="0x1" edc:desc="Peripheral Clock 51 Disable"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:nzwidth="0x1" edc:desc="Peripheral Clock 52 Disable"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:nzwidth="0x1" edc:desc="Peripheral Clock 53 Disable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:nzwidth="0x1" edc:desc="Peripheral Clock 56 Disable"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:nzwidth="0x1" edc:desc="Peripheral Clock 57 Disable"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:nzwidth="0x1" edc:desc="Peripheral Clock 58 Disable"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:nzwidth="0x1" edc:desc="Peripheral Clock 59 Disable"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:nzwidth="0x1" edc:desc="Peripheral Clock 60 Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
