Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400E0EE4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x50494F"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400E0EE8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x400E0EEC"/>
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_SCHMITT" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E0F00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="SCHMITT0" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT1" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT2" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT3" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT4" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT5" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT6" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT7" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT8" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT9" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT10" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT11" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT12" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT13" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT14" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT15" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT16" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT17" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT18" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT19" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT20" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT21" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT22" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT23" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT24" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT25" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT26" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT27" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT28" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT29" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT30" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
            <edc:SFRFieldDef edc:cname="SCHMITT31" edc:nzwidth="0x1" edc:desc="Schmitt Trigger Control"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x400E0F04"/>
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_DRIVER" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E0F18">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="LINE0" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 0">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE1" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 1">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE2" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 2">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE3" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 3">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE4" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 4">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE5" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 5">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE6" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 6">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE7" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 7">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE8" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 8">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE9" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 9">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE10" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 10">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE11" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 11">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE12" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 12">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE13" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 13">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE14" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 14">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE15" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 15">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE16" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 16">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE17" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 17">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE18" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 18">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE19" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 19">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE20" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 20">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE21" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 21">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE22" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 22">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE23" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 23">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE24" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 24">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE25" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 25">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE26" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 26">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE27" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 27">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE28" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 28">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE29" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 29">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE30" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 30">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LINE31" edc:nzwidth="0x1" edc:desc="Drive of PIO Line 31">
              <edc:SFRFieldSemantic edc:cname="LOW_DRIVE" edc:desc="Lowest drive" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_DRIVE" edc:desc="Highest drive" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x34" edc:_addr="0x400E0F1C"/>
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_PCMR" edc:nzwidth="0x20" edc:access="--------------------nnn---nn---n" edc:impl="0xE31" edc:_addr="0x400E0F50">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="PCEN" edc:nzwidth="0x1" edc:desc="Parallel Capture Mode Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DSIZE" edc:nzwidth="0x2" edc:desc="Parallel Capture Mode Data Size">
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="The reception data in the PIO_PCRHR is a byte (8-bit)" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALFWORD" edc:desc="The reception data in the PIO_PCRHR is a half-word (16-bit)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WORD" edc:desc="The reception data in the PIO_PCRHR is a word (32-bit)" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ALWYS" edc:nzwidth="0x1" edc:desc="Parallel Capture Mode Always Sampling"/>
            <edc:SFRFieldDef edc:cname="HALFS" edc:nzwidth="0x1" edc:desc="Parallel Capture Mode Half Sampling"/>
            <edc:SFRFieldDef edc:cname="FRSTS" edc:nzwidth="0x1" edc:desc="Parallel Capture Mode First Sample"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PIOA" edc:cname="PIOA_PCIER" edc:nzwidth="0x20" edc:access="----------------------------wwww" edc:impl="0xF" edc:_addr="0x400E0F54">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PIOA">
            <edc:SFRFieldDef edc:cname="DRDY" edc:nzwidth="0x1" edc:desc="Parallel Capture Mode Data Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Parallel Capture Mode Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Reception Transfer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
