Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_TIMR" edc:nzwidth="0x20" edc:access="---------nnnnnnn-nnnnnnn-nnnnnnn" edc:impl="0x7F7F7F" edc:_addr="0x400E1868">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x7" edc:desc="Current Second"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MIN" edc:nzwidth="0x7" edc:desc="Current Minute"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x6" edc:desc="Current Hour"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:nzwidth="0x1" edc:desc="Ante Meridiem Post Meridiem Indicator"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_CALR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnnnnnnnnn-nnnnnnn" edc:impl="0x3FFFFF7F" edc:_addr="0x400E186C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="CENT" edc:nzwidth="0x7" edc:desc="Current Century"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="YEAR" edc:nzwidth="0x8" edc:desc="Current Year"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x5" edc:desc="Current Month"/>
            <edc:SFRFieldDef edc:cname="DAY" edc:nzwidth="0x3" edc:desc="Current Day in Current Week"/>
            <edc:SFRFieldDef edc:cname="DATE" edc:nzwidth="0x6" edc:desc="Current Day in Current Month"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_TIMALR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x400E1870">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x7" edc:desc="Second Alarm"/>
            <edc:SFRFieldDef edc:cname="SECEN" edc:nzwidth="0x1" edc:desc="Second Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="MIN" edc:nzwidth="0x7" edc:desc="Minute Alarm"/>
            <edc:SFRFieldDef edc:cname="MINEN" edc:nzwidth="0x1" edc:desc="Minute Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="HOUR" edc:nzwidth="0x6" edc:desc="Hour Alarm"/>
            <edc:SFRFieldDef edc:cname="AMPM" edc:nzwidth="0x1" edc:desc="AM/PM Indicator"/>
            <edc:SFRFieldDef edc:cname="HOUREN" edc:nzwidth="0x1" edc:desc="Hour Alarm Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_CALALR" edc:nzwidth="0x20" edc:access="n-nnnnnnn--nnnnn----------------" edc:impl="0xBF9F0000" edc:_addr="0x400E1874">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="MONTH" edc:nzwidth="0x5" edc:desc="Month Alarm"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MTHEN" edc:nzwidth="0x1" edc:desc="Month Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="DATE" edc:nzwidth="0x6" edc:desc="Date Alarm"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DATEEN" edc:nzwidth="0x1" edc:desc="Date Alarm Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SR" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:impl="0x3F" edc:_addr="0x400E1878">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKUPD" edc:nzwidth="0x1" edc:desc="Acknowledge for Update">
              <edc:SFRFieldSemantic edc:cname="FREERUN" edc:desc="Time and calendar registers cannot be updated." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Time and calendar registers can be updated." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALARM" edc:nzwidth="0x1" edc:desc="Alarm Flag">
              <edc:SFRFieldSemantic edc:cname="NO_ALARMEVENT" edc:desc="No alarm matching condition occurred." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ALARMEVENT" edc:desc="An alarm matching condition has occurred." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x1" edc:desc="Second Event">
              <edc:SFRFieldSemantic edc:cname="NO_SECEVENT" edc:desc="No second event has occurred since the last clear." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SECEVENT" edc:desc="At least one second event has occurred since the last clear." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TIMEV" edc:nzwidth="0x1" edc:desc="Time Event">
              <edc:SFRFieldSemantic edc:cname="NO_TIMEVENT" edc:desc="No time event has occurred since the last clear." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TIMEVENT" edc:desc="At least one time event has occurred since the last clear." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CALEV" edc:nzwidth="0x1" edc:desc="Calendar Event">
              <edc:SFRFieldSemantic edc:cname="NO_CALEVENT" edc:desc="No calendar event has occurred since the last clear." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CALEVENT" edc:desc="At least one calendar event has occurred since the last clear." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TDERR" edc:nzwidth="0x1" edc:desc="Time and/or Date Free Running Error">
              <edc:SFRFieldSemantic edc:cname="CORRECT" edc:desc="The internal free running counters are carrying valid values since the last read of the Status Register (RTC_SR)." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ERR_TIMEDATE" edc:desc="The internal free running counters have been corrupted (invalid date or time, non-BCD values) since the last read and/or they are still invalid." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
