Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_SCCR" edc:nzwidth="0x20" edc:access="--------------------------wwwwww" edc:impl="0x3F" edc:_addr="0x400E187C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKCLR" edc:nzwidth="0x1" edc:desc="Acknowledge Clear"/>
            <edc:SFRFieldDef edc:cname="ALRCLR" edc:nzwidth="0x1" edc:desc="Alarm Clear"/>
            <edc:SFRFieldDef edc:cname="SECCLR" edc:nzwidth="0x1" edc:desc="Second Clear"/>
            <edc:SFRFieldDef edc:cname="TIMCLR" edc:nzwidth="0x1" edc:desc="Time Clear"/>
            <edc:SFRFieldDef edc:cname="CALCLR" edc:nzwidth="0x1" edc:desc="Calendar Clear"/>
            <edc:SFRFieldDef edc:cname="TDERRCLR" edc:nzwidth="0x1" edc:desc="Time and/or Date Free Running Error Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_IER" edc:nzwidth="0x20" edc:access="--------------------------wwwwww" edc:impl="0x3F" edc:_addr="0x400E1880">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKEN" edc:nzwidth="0x1" edc:desc="Acknowledge Update Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ALREN" edc:nzwidth="0x1" edc:desc="Alarm Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SECEN" edc:nzwidth="0x1" edc:desc="Second Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TIMEN" edc:nzwidth="0x1" edc:desc="Time Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CALEN" edc:nzwidth="0x1" edc:desc="Calendar Event Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TDERREN" edc:nzwidth="0x1" edc:desc="Time and/or Date Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_IDR" edc:nzwidth="0x20" edc:access="--------------------------wwwwww" edc:impl="0x3F" edc:_addr="0x400E1884">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACKDIS" edc:nzwidth="0x1" edc:desc="Acknowledge Update Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ALRDIS" edc:nzwidth="0x1" edc:desc="Alarm Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SECDIS" edc:nzwidth="0x1" edc:desc="Second Event Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TIMDIS" edc:nzwidth="0x1" edc:desc="Time Event Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="CALDIS" edc:nzwidth="0x1" edc:desc="Calendar Event Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TDERRDIS" edc:nzwidth="0x1" edc:desc="Time and/or Date Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_IMR" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:impl="0x3F" edc:_addr="0x400E1888">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="ACK" edc:nzwidth="0x1" edc:desc="Acknowledge Update Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ALR" edc:nzwidth="0x1" edc:desc="Alarm Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="SEC" edc:nzwidth="0x1" edc:desc="Second Event Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TIM" edc:nzwidth="0x1" edc:desc="Time Event Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CAL" edc:nzwidth="0x1" edc:desc="Calendar Event Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TDERR" edc:nzwidth="0x1" edc:desc="Time and/or Date Error Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RTC" edc:cname="RTC_VER" edc:nzwidth="0x20" edc:access="----------------------------rrrr" edc:impl="0xF" edc:_addr="0x400E188C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RTC">
            <edc:SFRFieldDef edc:cname="NVTIM" edc:nzwidth="0x1" edc:desc="Non-valid Time"/>
            <edc:SFRFieldDef edc:cname="NVCAL" edc:nzwidth="0x1" edc:desc="Non-valid Calendar"/>
            <edc:SFRFieldDef edc:cname="NVTIMALR" edc:nzwidth="0x1" edc:desc="Non-valid Time Alarm"/>
            <edc:SFRFieldDef edc:cname="NVCALALR" edc:nzwidth="0x1" edc:desc="Non-valid Calendar Alarm"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPBR" edc:cname="SYS_GPBR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E1890">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:nzwidth="0x20" edc:desc="Value of GPBR x"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPBR" edc:cname="SYS_GPBR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E1894">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:nzwidth="0x20" edc:desc="Value of GPBR x"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPBR" edc:cname="SYS_GPBR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E1898">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:nzwidth="0x20" edc:desc="Value of GPBR x"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPBR" edc:cname="SYS_GPBR3" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E189C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:nzwidth="0x20" edc:desc="Value of GPBR x"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPBR" edc:cname="SYS_GPBR4" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E18A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:nzwidth="0x20" edc:desc="Value of GPBR x"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
