Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="GPBR" edc:cname="SYS_GPBR5" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E18A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:nzwidth="0x20" edc:desc="Value of GPBR x"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPBR" edc:cname="SYS_GPBR6" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E18A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:nzwidth="0x20" edc:desc="Value of GPBR x"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GPBR" edc:cname="SYS_GPBR7" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E18AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GPBR">
            <edc:SFRFieldDef edc:cname="GPBR_VALUE" edc:nzwidth="0x20" edc:desc="Value of GPBR x"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x34" edc:_addr="0x400E18B0"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SYSC_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400E18E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x525443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0x400E18E8"/>
      <edc:SFRDef ltx:memberofperipheral="RSWDT" edc:cname="RSWDT_CR" edc:nzwidth="0x20" edc:access="wwwwwwww-----------------------w" edc:impl="0xFF000001" edc:_addr="0x400E1900">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSWDT">
            <edc:SFRFieldDef edc:cname="WDRSTT" edc:nzwidth="0x1" edc:desc="Watchdog Restart"/>
            <edc:AdjustPoint edc:offset="0x17"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation." edc:when="(field &amp; 0xFF) == 0xC4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RSWDT" edc:cname="RSWDT_MR" edc:nzwidth="0x20" edc:access="--nnnnnnnnnnnnnnn-nnnnnnnnnnnnnn" edc:impl="0x3FFFBFFF" edc:_addr="0x400E1904">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSWDT">
            <edc:SFRFieldDef edc:cname="WDV" edc:nzwidth="0xC" edc:desc="Watchdog Counter Value"/>
            <edc:SFRFieldDef edc:cname="WDFIEN" edc:nzwidth="0x1" edc:desc="Watchdog Fault Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="WDRSTEN" edc:nzwidth="0x1" edc:desc="Watchdog Reset Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WDDIS" edc:nzwidth="0x1" edc:desc="Watchdog Disable"/>
            <edc:SFRFieldDef edc:cname="ALLONES" edc:nzwidth="0xC" edc:desc="Must Always Be Written with 0xFFF"/>
            <edc:SFRFieldDef edc:cname="WDDBGHLT" edc:nzwidth="0x1" edc:desc="Watchdog Debug Halt"/>
            <edc:SFRFieldDef edc:cname="WDIDLEHLT" edc:nzwidth="0x1" edc:desc="Watchdog Idle Halt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="RSWDT" edc:cname="RSWDT_SR" edc:nzwidth="0x20" edc:access="-------------------------------r" edc:impl="0x1" edc:_addr="0x400E1908">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSWDT">
            <edc:SFRFieldDef edc:cname="WDUNF" edc:nzwidth="0x1" edc:desc="Watchdog Underflow"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xF4" edc:_addr="0x400E190C"/>
      <edc:SFRDef ltx:memberofperipheral="UART2" edc:cname="UART2_CR" edc:nzwidth="0x20" edc:access="-------------------w---wwwwwww--" edc:impl="0x11FC" edc:_addr="0x400E1A00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART2">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RSTRX" edc:nzwidth="0x1" edc:desc="Reset Receiver"/>
            <edc:SFRFieldDef edc:cname="RSTTX" edc:nzwidth="0x1" edc:desc="Reset Transmitter"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Receiver Enable"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:nzwidth="0x1" edc:desc="Receiver Disable"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:nzwidth="0x1" edc:desc="Transmitter Enable"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:nzwidth="0x1" edc:desc="Transmitter Disable"/>
            <edc:SFRFieldDef edc:cname="RSTSTA" edc:nzwidth="0x1" edc:desc="Reset Status"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="REQCLR" edc:nzwidth="0x1" edc:desc="Request Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART2" edc:cname="UART2_MR" edc:nzwidth="0x20" edc:access="----------------nn-nnnn----n----" edc:impl="0xDE10" edc:_addr="0x400E1A04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART2">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FILTER" edc:nzwidth="0x1" edc:desc="Receiver Digital Filter">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="UART does not filter the receive line." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="UART filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PAR" edc:nzwidth="0x3" edc:desc="Parity Type">
              <edc:SFRFieldSemantic edc:cname="EVEN" edc:desc="Even Parity" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ODD" edc:desc="Odd Parity" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPACE" edc:desc="Space: parity forced to 0" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MARK" edc:desc="Mark: parity forced to 1" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No parity" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BRSRCCK" edc:nzwidth="0x1" edc:desc="Baud Rate Source Clock">
              <edc:SFRFieldSemantic edc:cname="PERIPH_CLK" edc:desc="The baud rate is driven by the peripheral clock" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PMC_PCK" edc:desc="The baud rate is driven by a PMC-programmable clock PCK (see section Power Management Controller (PMC))." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CHMODE" edc:nzwidth="0x2" edc:desc="Channel Mode">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AUTOMATIC" edc:desc="Automatic echo" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LOCAL_LOOPBACK" edc:desc="Local loopback" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REMOTE_LOOPBACK" edc:desc="Remote loopback" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
