Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.9.100/samv70b/edc/ATSAMV70N20B.PIC
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="MMFAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE000ED34">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:nzwidth="0x20" edc:desc="Data address for an MPU fault"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="BFAR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE000ED38">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:nzwidth="0x20" edc:desc="Data address for a precise bus fault"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="AFSR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE000ED3C"/>
      <edc:AdjustPoint edc:offset="0x38" edc:_addr="0xE000ED40"/>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="CLIDR" edc:nzwidth="0x20" edc:access="--rrrrrr------------------------" edc:por="00001001000000000000000000000011" edc:mclr="00001001000000000000000000000011" edc:impl="0x3F000000" edc:_addr="0xE000ED78">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="LoC" edc:nzwidth="0x3" edc:desc="Level of Coherency">
              <edc:SFRFieldSemantic edc:cname="LEVEL_1" edc:desc="if neither instruction nor data cache is implemented" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LEVEL_2" edc:desc="if either cache is implemented" edc:when="(field &amp; 0x7) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LoU" edc:nzwidth="0x3" edc:desc="Level of Unification">
              <edc:SFRFieldSemantic edc:cname="LEVEL_1" edc:desc="if neither instruction nor data cache is implemented" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LEVEL_2" edc:desc="if either cache is implemented" edc:when="(field &amp; 0x7) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="CTR" edc:nzwidth="0x20" edc:access="rrr-rrrrrrrrrrrr------------rrrr" edc:por="10000011000000111100000000000011" edc:mclr="10000011000000111100000000000011" edc:impl="0xEFFF000F" edc:_addr="0xE000ED7C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="IMINLINE" edc:nzwidth="0x4" edc:desc="Smallest cache line of all the instruction caches under the control of the processor"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DMINLINE" edc:nzwidth="0x4" edc:desc="Smallest cache line of all the data and unified caches under the core control"/>
            <edc:SFRFieldDef edc:cname="ERG" edc:nzwidth="0x4" edc:desc="Exclusives Reservation Granule"/>
            <edc:SFRFieldDef edc:cname="CWG" edc:nzwidth="0x4" edc:desc="Cache Writeback Granule"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FORMAT" edc:nzwidth="0x3" edc:desc="Register format"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="CCSIDR" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0xE000ED80">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="LineSize" edc:nzwidth="0x3" edc:desc="number of words in each cache line"/>
            <edc:SFRFieldDef edc:cname="Associativity" edc:nzwidth="0x9" edc:desc="number of ways"/>
            <edc:SFRFieldDef edc:cname="NumSets" edc:nzwidth="0x10" edc:desc="number of sets"/>
            <edc:SFRFieldDef edc:cname="WA" edc:nzwidth="0x1" edc:desc="Write allocation support"/>
            <edc:SFRFieldDef edc:cname="RA" edc:nzwidth="0x1" edc:desc="Read allocation support"/>
            <edc:SFRFieldDef edc:cname="WB" edc:nzwidth="0x1" edc:desc="Write-Back support"/>
            <edc:SFRFieldDef edc:cname="WT" edc:nzwidth="0x1" edc:desc="Write-Through support"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="CSSELR" edc:nzwidth="0x20" edc:access="----------------------------nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF" edc:_addr="0xE000ED84">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="IND" edc:nzwidth="0x1" edc:desc="selection of instruction or data cache">
              <edc:SFRFieldSemantic edc:cname="DATA" edc:desc="Data cache" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INSTRUCTION" edc:desc="Instruction cache" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL" edc:nzwidth="0x3" edc:desc="cache level selected"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SCB" edc:cname="CPACR" edc:nzwidth="0x20" edc:access="--------nnnn--------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF00000" edc:_addr="0xE000ED88">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="CP10" edc:nzwidth="0x2" edc:desc="Access privileges for coprocessor 10."/>
            <edc:SFRFieldDef edc:cname="CP11" edc:nzwidth="0x2" edc:desc="Access privileges for coprocessor 11."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xE000ED8C"/>
      <edc:SFRDef ltx:memberofperipheral="MPU" edc:cname="TYPE" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnn-------n" edc:por="00000000000000000001000000000000" edc:mclr="00000000000000000001000000000000" edc:impl="0xFFFF01" edc:_addr="0xE000ED90">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="SEPARATE" edc:nzwidth="0x1" edc:desc="Indicates support for unified or separate instruction and date memory maps."/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DREGION" edc:nzwidth="0x8" edc:desc="Indicates the number of supported MPU instruction regions."/>
            <edc:SFRFieldDef edc:cname="IREGION" edc:nzwidth="0x8" edc:desc="Indicates the number of supported MPU data regions."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
